{
  "product": "LENOVO Legion 5",
  "reviews": [
    "Reddit: I asked my parents for a legion 5 pro with rtx 5070 ti, got this instead\n**EDIT: i am grateful of this laptop, not ungrateful. Please keep that in mind before commenting hate. Some people got it wrong.**\n\nI genuinely don’t think i could be happier, since i never thought id get such a powerful laptop. Big upgrade from my legion 5 pro rtx 4070.\n\nHonest review after 2 weeks, id say it performs quite well.\n\nAround 40-70 fps on red dead 2 on ultra graphics, can stutter a bit\n\nTemps i’ve not seen risen over 75 degrees celsius on cpu, gpu stayed around 65 celsius\n\nBeamNG.Drive also performs extremely well on ultra graphics, 60 fps with traffic, seems good because the game is in Alpha and is yet not that optimized\n\nNo cons. Im also surprised it has facial recognition aswell. Thats something new for a gaming laptop, havent seen it before\n\nOtherwise a great laptop, if you have any questions let me know.\n\nI’m also looking for good steam games like red dead 2, if you have any suggestions i’m open about them",
    "Reddit: My Legion Go 2 Review\nHey all,\n\nI made a post yesterday about how I was underwhelmed by the Legion Go 2's performance, so I wanted to follow that up with a full review now that I've had a couple of days with the device. This'll just be a good / mid / bad list, with an overall verdict at the end as to who I think this device is for, and who it isn't for. Quick disclaimer as well, my handheld up until this point has been the SD OLED, so this may provide an ideal review for those who are also thinking of upgrading from that device. So without any further waffling, here's my review, starting with:\n\n  \n**The Good**\n\n* The display is great. This probably won't come as much of a surprise as I think the display is the main selling point of the device. It's big, bright and just downright impressive with no drawbacks as far as I'm concerned. 144Hz refresh rate, if you're able to hit it, is also a pretty big bonus. As an example, you can easily hit that in a game like Hades, and it's a significant upgrade when compared to the 90Hz display of the SD OLED.\n* Detachable controllers are great. They're ergonomic, the finish on them feels quite premium and the buttons / joysticks are also a joy to use. \n* Thermals and fan noise are surprisingly good. Monitoring thermals when pushing it, it never looks to hit thermal throttling territory and the device stays cool to the touch in all the important places. Fan noise is about on-par with the SD OLED, which is to say that it's noticeable but never annoying.\n\n  \n**The Mid**\n\n* Performance is solid, after some tweaking. Yesterday, my post caused a bit of a stir where I said that there are certain games where the SD OLED seems to be getting close, if not matching the LeGo 2 in performance. After some poking around, I noticed that the frame buffer was set to 2GB by default. Why Lenovo have done this is beyond me, there aren't many games outside of basic indies that use less than 2GB. After setting this to 8GB, performance across the board stabilised and performance in the games where the SD OLED was matching it, it was now pulling well ahead, so that was a relief.\n* Ergonomics with the controllers attached is reasonably comfortable. The controllers are well sculpted and, despite its pretty huge size, it masks this well when playing all sorts of games. Not much more to say there really!\n* Battery is also pretty good. I've been mostly playing with it in performance mode (25w), and it's able to last around 2.5 hours if the GPU and CPU are working pretty hard in games such as Diablo 4, for example. \n* Trackpad is serviceable, if it is a bit small\n\n  \n**The Bad**\n\n* Windows gets in the way, as we've all largely come to expect. If you want a unbox-and-play experience, be prepared to overcome the standard Windows hurdles before you do so.\n* The Lenovo launcher software (can't remember what it's called off the top of my head) isn't great. It's buggy, fails to launch some games entirely and often freezes and crashes. I've disabled it from starting up entirely on my device.\n* It's HEAVY. I didn't think this would be much of a problem to me, but after having it in my hands for 20 minutes, I can feel my hands and forearms tiring. It's a large departure from the significantly lighter SD OLED.\n* The value. For what Lenovo are charging for this thing, I think the value proposition is off by quite a margin. When other premium tier devices such as the Claw 8 AI, Xbox Ally X (rumoured) and the Ally X are a solid 20-25% cheaper, I think this makes it a hard sell, especially given the cons I've listed above. When you compare it to the SD OLED (which is more than 50% cheaper), it suffers even more in this category in my opinion.\n\n  \n**Verdict**\n\nFor me personally, I'll be returning the device. I think it's a good device overall, which performs quite well, has the best display on any handheld and from what I've read, is a significant upgrade over the original device. If that's what you're looking for, I think this device is for you. For me however, ergonomically, the SD OLED is the superior device, has a display that, even though smaller, rivals this, and the overall experience with Steam OS out of the box is vastly superior to Windows in its current state. Furthermore, the performance difference isn't so vastly significant that it makes it hard to go back to the SD. Despite the lesser hardware, the SD does make better use of its hardware overall IMO. Actually, now that I mention that, let me quickly put together some bullet points as to who I think this device is for, and who it's not for:\n\n\n\n**Who Should Buy This?**\n\n* You own a lower tier performing device, such as the SD OLED, and want to experience significantly higher framerates.\n* You're already a fan of the form factor of the original and just want a flat upgrade. Performance-wise I don't think you're going to see anything too significant, but there's no denying that the display is a knockout. It looks superb.\n\n**Who Shouldn't Buy This?**\n\n* You already own a device with a Z1 Extreme or equivalent and want a significant performance upgrade.\n* You have small / average sized hands (trust me this thing is an absolute unit).\n* If you've tried using Windows on a handheld in the past and didn't get on with it, your opinion isn't going to change this time around.\n\n  \nI think that covers all the important stuff. If there's something that I've missed please do leave a comment and I'll get back to you ASAP.",
    "Reddit: Got a Lenovo Legion Pro 5 OLED laptop!\nSpecs: RTX 5060 GPU, Ryzen 7 8745HX CPU, 32GB RAM, 1TB SSD, and 16” 2560x1600 165Hz 500 nits OLED screen\n\nBought from Best Buy for $1300 pre-tax with Black Friday deal. It has a nice metal build quality, fans aren’t super loud, and the screen is fucking gorgeous. The speakers could be better but I usually play with a headset so whatevs. \n\nDespite the 8GB VRAM, the 115W GPU is good enough for my needs as I’ve been a console gamer most of my life. I get 60-100 FPS on medium/high settings in demanding games like Cyberpunk 2077, Stalker 2, Oblivion Remastered, Baldur’s Gate 3, and Ready or Not. It feels like my PS5 Pro in PC form.\n\nAfterburner says the GPU temp hovers around 65° and CPU at 75-85° under load in Ready or Not. That’s with the laptop slightly elevated. The CPU spikes to 101° while compiling shaders in Stalker 2. Not sure if that’s normal but I just hit FN+Q to go in silent mode and get it down to 80° but it’s otherwise normal in game on auto/balanced mode. Performance mode got me a whopping four extra frames with loud ass fans so auto mode it is lol. Not bothering to OC the GPU either.\n\nHopefully this bad boy can last 4-5 years. I know Lenovo is known for their decent laptops, yet I came from an MSI Vector 16 that had audio stutters due to latency spikes. Fucking around with drivers, audio settings, and BIOS lead nowhere. Only solution I found was disabling the Intel CPU e-cores with Process Lasso but it borked my audio in BG3 and I read it has compatibility issues with anti-cheat games, so I just had enough. I didn’t wanna deal with the headache anymore after six months and it left a bad taste in my mouth. I sold it on Marketplace for half of what I bought it for and the buyer seemed to like it despite me making the audio issue known. \n\nThe Legion is an upgrade in pretty much every way except graphics and refresh rate; the MSI had a 5070 Ti and 240Hz refresh rate. I can see Jarrod shaking his head right now lol. I’m aware of the $1300 MSI with 5070 Ti at Walmart but it doesn’t have OLED and it has iffy ratings/reviews. I didn’t wanna take another chance on MSI again. I don’t mind that much because I was always chasing frames instead of enjoying games. I even contemplated not buying another laptop and just sticking with my PS5 Pro and ROG Xbox Ally X, but I knew I’d miss playing shooters and BG3 with KB/M. I was tearing my hair out trying to find a laptop with desired specs/decent price the last few days and I kept coming back to this specific Legion Pro 5. All in all, I’m pretty happy with the laptop so far! \n\nAnd my cat’s name is Sally.  She’s a lovable, affectionate, and playful little furball! ❤️",
    "Reddit: Is anyone else as excited as I am for the Lenovo Legion Go 2?\nI am so excited that I have begun preparing for the release. Currently I have a pretty serious PC with 9950X3D/5090 Astral Etc... , ROG Acronym(4070M) with 4090M XG Mobile and a MSI Claw 8 AI+. I really do like the form factor of gaming handhelds running the Windows operating system, especially when I'm away from a desk. I owned a Steam Deck OLED in the past and got rid of it for an Ally. Then I got rid of the Ally and got an Ally X and OG Legion Go. I got rid of both of those handhelds months ago. For me they both felt like they were missing something....\nprobably an OLED display. The Claw 8 is exempt from this kind of thought, because of the excellent increase in performance it has given over all of the previous handhelds I have owned.\n\nWhen I saw the pre-order price of the Lenovo Legion Go 2 Z2E,  I laughed and immediately placed my pre-order with Best Buy.\n\nRecently I seriously considered purchasing a fully decked out Ayaneo 3 OLED. It was going to cost me around $1,700USD. What stopped me from pulling the trigger was waiting for the press release of the Lenovo Legion Go 2 and the fact that the Ayaneo comes with a subpar battery.\n\nCurrently, I do most of my mobile gaming/retro gaming on the Claw 8 with 2TB NVME and 1TB MicroSD. I am very pleased with that device. At the same time I demand an OLED display. All of the TVs in my home are OLED, including my PG32UCDM-R gaming monitor. So for a person like me, it's noticeable when the display I'm staring at is not OLED. Lenovo has really come through with exactly what I expect of a new gaming handheld released in the later half of 2025. \n\nSo far I have purchased portable battery banks and high output chargers to make \"on the go gaming\" sustainable. Yesterday I noticed that the Lenovo Legion Go Sling had 11 in stock at my local Best Buy. Today they had two.\nhttps://www.bestbuy.com/product/lenovo-legion-go-sling-bag-black/JJGCYLZ4ZC\n So I bought one today for the Legion Go 2. I also purchased a 1 TB micro SD card and a 2TB 990 Pro NVME for it. \nhttps://www.bestbuy.com/product/samsung-pro-plus-1-tb-microsdxc-memory-card/J3ZYG2H8KR/sku/6588058\n\nhttps://www.bestbuy.com/product/samsung-990-pro-2tb-internal-ssd-pcle-gen-4x4-nvme/J3ZYG28J3S/sku/6523595\n\n\nUsually I purchase a 4 TB NVME but never use the space. I assume other people are also purchasing the Sling for the same reason. I also purchased the controller connector from Lenovo's website. What's annoying is that it's taking forever to ship, even though it says it's ready to ship lol.\nhttps://www.lenovo.com/us/en/p/accessories-and-software/chargers-and-batteries/power-banks/gxh1q27134?orgRef=https%253A%252F%252Faccount.lenovo.com%252Fus%252Fen%252Faccount%252Forder%252Fdetail.html%253FecommerceId%253D1323814552\n\nMy plan is to alternate between the Claw 8 and the Legion Go 2, when I'm at home and the battery is almost depleted.\n\n\nWhat's super frustrating to me is that other countries are getting a release on September 12th 2025. Here in Anchorage Alaska I'll have to wait until October 31st 2025....lame.\nIs anyone else excited/preparing in their own way for the Legion Go 2?",
    "Reddit: 🧩 [Guide] Massive Performance Fix for the Legion Go 2 (Z2 Extreme) — Use Lenovo’s Official AMD Driver, Not Windows Update!\n🧠 What went wrong initially\n\nWhen I first set up my Legion Go 2 (Z2 Extreme), Windows Update automatically installed AMD GPU drivers.\nAt first, I thought that was fine — but performance was terrible, and I got frequent crashes in games.\n\nEven after I installed Lenovo’s additional AMD drivers on top of the Windows ones, it didn’t help — the mix of both caused even more instability.\n\n\n---\n\n⚠️ The real issue\n\nWindows Update installs generic AMD drivers that aren’t optimized for the Legion Go 2’s APU or OLED display.\nThey cause:\n\nPoor gaming performance\n\nDriver crashes / instability\n\nWeird power and sleep behavior\n\nDuller colors and worse HDR on the OLED\n\n\n\n---\n\n🔧 How I fixed it (safe &amp;amp; simple)\n\n1. Turn off Wi-Fi / disconnect Internet\n→ prevents Windows from auto-installing the wrong AMD driver again\n\n\n2. Run DDU (Display Driver Uninstaller)\n\nSelect GPU → AMD\n\nClick “Clean and restart”\n\n⚠️ Important: you don’t need Safe Mode!\n\nSafe Mode can cause login issues on handhelds (PIN unavailable)\n\nDDU works perfectly fine in normal Windows mode\n\n\n\n\n3. After restart, Windows will fall back to the Microsoft Basic Display Adapter (that’s normal)\n\n\n4. Download and install the official AMD driver from Lenovo’s product page for the new Legion Go 2:\n👉 Lenovo Legion Go 2 AMD Display Driver\n\nhttps://pcsupport.lenovo.com/us/en/products/laptops-and-netbooks/legion-series/legion-go-8ahp2/downloads/driver-list/component?name=Display%20and%20Video%20Graphics&amp;amp;id=635380F4-448F-4129-AA77-265289D96F6F\n\n\n5. After installation, restart your system\n\n\n6. If AMD Adrenalin doesn’t show up right away, just restart one more time — it appeared automatically for me after the second reboot\n\n\n7. Reconnect Wi-Fi and you’re done ✅\n\n\n\n\n---\n\n🎮 Before vs. After (Real Results)\n\nGhost of Tsushima:\nBefore → Barely playable at 800p, frequent crashes.\nAfter → Runs smoothly at 1000p–1200p on Medium/High settings, around 60 FPS in Performance Mode.\n\nEA FC 26:\nBefore → Under 50 FPS in Balanced Mode.\nAfter → Around 80 FPS at 1200p in Balanced Mode, smooth and stable gameplay.\n\nOverall system:\nBefore → Random stutters in games, dull OLED colors, sluggish menus.\nAfter → Noticeably smoother performance, brighter image, richer OLED colors — everything feels more responsive and stable.\n\n\n---\n\n💡 Extra Notes\n\nMany reviewers and YouTubers likely tested with the wrong (Windows Update or generic laptop ones) driver — so their benchmarks underestimate the device’s true potential.\n\nLenovo’s official AMD driver is tuned for the Go’s APU, power curves, and OLED color calibration.\n\nSince switching, I’ve had zero crashes, smoother gameplay, better colors, and significantly higher FPS.\n\n\n\n---\n\n✅ TL;DR\n\nIf your Legion Go 2 runs poorly or crashes:\n\n&amp;gt; 🔹 Turn off Wi-Fi\n🔹 Use DDU (no Safe Mode)\n🔹 Install Lenovo’s official AMD driver\n🔹 Restart once — if Adrenalin isn’t there, restart again\n🔹 Reconnect Wi-Fi and enjoy smooth, stable performance\n\n\n\nThis fixed all my issues and boosted FPS massively — now I can run Ghost of Tsushima at 1000–1200p, Medium/High settings, around 60 FPS in Performance Mode, and EA FC 26 at about 80 FPS in Balanced Mode. \n\n\n\n---\nIf u don't have problems ok. \nBut for me honestly, I was this close to returning the Legion Go 2 because of all the crashes and bad performance — but after doing this clean driver setup, it feels like a completely different device. I’m super happy with it now; everything runs smooth, looks great, and performs the way it should.\n \nI hope i can help other's with this post.",
    "Reddit: Legion go 2 first day impressions/review.\nHi,\n\nI thought i would throw together some initial impressions i have of the legion go gen 2 after 1 full day of playing. I know some of you may be eagerly awaiting the device, particularly over in the US where you have a little bit longer to wait until release. This is my first legion go device so anything i find to be a slight negative for me may sound familiar to you if you own the original legion go because i suspect what i dont like would have been an issue with the first... ok ill just say, its the side buttons on the right controller, they just feel so alien to me. Im not going to touch on the price, we all know what it costs, you have to determine if its worth it. My unit is the Z2E 1TB version and i got it for just under £1000 with a 10 percent voucher, making it about £100 more than a claw 8ai which i have owned and about the same premium over the upcoming Xbox ally X. I also wont touch on performance as we all know pretty much what to expect.\n\n**UNBOXING:**\n\nOpening the box is a relatively standard experience, there is a case included and its of reasonably good quality (see pic), its a semi hard case, not totally soft but not steam deck case hard either, it will survive in a bag, but i wouldn't sit on it and get back up with confidence it survived like a steam deck case. There is also an included charger, you can save £10 or so removing this option from the lenovo setup website if you wish but its well worth having, good 65w charger, long enough cable, ofcourse you are keeping it in. I wish a screen protector was included, but then how could they ever sell you one right.\n\n**7/10**\n\n**MATERIALS:**\n\nThe unit itself is made of soft touch super smooth plastic, very pleasant to touch and hold but after a few hours of gaming your hands can leave behind visible oils/sweat/residue... its the trade off for the material they are using i feel - one that i can live with. It looks and feels premium. Having not had the original legion go i was going into this expecting there to be some play in the controllers connection to the main unit, like a switch however its a solid connection, i was brave enough to give it a good twist in my hands, it creaked but was solid, i wouldn't want to do it again. The handheld as a complete unit does weigh quite a bit, its not something you will be too pleased to hold in 1 hand while you scratch your head with the other or something, its just at that point of being at risk of a drop from one hand however the ergonomics are enough to give you a really solid grip... it feels super close to the steam deck in hand.\n\n**9/10**\n\n**CONTROLS + BUTTONS:**\n\nThe controls all feel great, analogue sticks have a long throw, the longest of any handheld ive used to date including both deck and deck OLED, ally and ally X and claw 8AI, I think in fact it might be a longer throw than a genuine xbox controller... being hall effect its a good idea to go into steam settings and reduce the joystick deadzones because they are set far too high to compensate for the natural drift of standard sticks. They feel great to use, very smooth rotation equal to my xbox elite 2 controller, some of the best ive used if not the best. The D-pad is also very good to use, my last handheld was the claw 8AI and the D-pad there was stiff and had some problems (broke on me twice in 3 months in the exact same way). Here the D-pad is easy to roll and accurate. If you have a legion go S, its probably the exact same. triggers and shoulder buttons feel great, i think the shoulder buttons could be slightly better damped, they are clicky and a bit noisy after the claw 8 for me.\n\nI am not particularly a fan of the multitude of side buttons and didn't even realize the rear scroll wheel was there for 5 hours of gaming, i didnt really take a very close look at the rear. So far they have done nothing for me except be in contact with my hands and fingers while being of no particular use. Im aware their main purpose is to accommodate the FPS mode etc however.\n\n**8/10**\n\n**SOUND/SPEAKERS:**\n\nI am pretty happy with the sound, i know this was one of the main criticisms of the first gen handheld. The sound is still a step behind a device like the claw 8ai but only because it lacks a bit of punch and warmth. The sound however still rocks in its own way, its very clear considering the top fire nature and there is absolutely a sense of surrounding immersion which elevates the legion go gen 2 above handhelds like the Ally X in the sound department. A hint of extra warmth and bass would have pushed this to the very top which im led to believe would be a massive and welcome overhaul. You can rest assured the speakers here are well in the running with the best on a handheld, but still second best to the MSI handhelds.\n\nIm going to throw a small note in here on the fan, the question for most is how noisy is it - its certainly noisier than the MSI claw 8 however its not all that obtrusive and becomes unnoticeable when playing indie games or those of the lighter variety, i would say its tone is more in line with what a steam deck OLED is like and perhaps it has that similarity because its a single fan setup just like the steam deck... or maybe its coincidence but i feel like perhaps dual fan system perhaps just have to work less hard overall in heavier titles. Temperatures here were well under control but i couldn't yet put any numbers to it, just not tested enough.\n\n**8/10**\n\n**DISPLAY:**\n\nSo here is the star of the show, 8.8in OLED HDR 144hz VRR display and its amazing as anybody would expect, the colors are astonishing, the resolution is just enough to keep it as sharp and clean as its main rivals. This display is very bright and vibrant however it remains relatively dim below 65-70 percent only really starting to come alive after that and really start showing what it can do. Uniformity looks great on solid 5 percent grey, little to no banding noticeable. During the setup phase i noticed there is quite aggressive ABL (Automatic brightness limiter) happening, this kicks in relatively quickly and adjusts itself quite sporadically so you can be looking at the screen while not doing much on it and see the brightness fluctuate up and down as it tries to effectively save your screen the burn in time i guess. I only noticed this during the setup phase and have not noticed it during windows operation or while gaming. The display does get dim on request but it does not get that dim compared to other displays so very dark room gaming is less than ideal if you really want a very dark screen. Overall however it is perhaps the very best display currently on a handheld, certainly what ive used.  \n  \n**9.5/10**\n\n**OVERALL DAY 1:**\n\nIm super impressed with the Legion go gen 2 with my first day. Ive played around 10 games on and off all day, ive got plenty of emulation up and running also and its been a joy. I know the premium they ask for this is high but im pretty happy to say i can find very little if any compromises made at all. The materials feel really good in hand, there is a density to the unit we all like but perhaps that which may contribute to the weight. All the controls feel great and the display is eye searingly good.\n\nI know the main discussion amongst most of us will be just is this worth paying for if you have literally any other handheld that does the job for you. The answer ofcourse is no, the leap in performance is not large enough to change your enjoyment of most games and that is just how it is. However i do feel that Lenovo knew this was the case so they made the choice even more compelling by giving it the deck OLED treatment and another step forward with the resolution and size... This aspect alone can truly change your experience, horror games in the dark, something like alien isolation is just something else entirely on an OLED display, but performance will always be the leap that never happened here.\n\nI hope this gives you guys some helpful information to work with and help you make a decision, maybe you have ordered and you are waiting, maybe you cant order until that release date arrives where you are, either way feel free to let us all know what you like or dont like about it when you have hands on.\n\nCheers.",
    "Reddit: Read this if you are considering buying a Legion 5/Pro 5 (or really any Legion laptops)\nI have seen many posts recently about the Legion Pro 5/5i failing here and there, so I just want to share the other side of the story for those who are worried (like I used to).\n\nFirst of all, this is my personal experience with the Lenovo Legion series in the U.S., and therefore could be different from yours. I'm also not very knowledgeable on some of these stuff, I probably just know a little bit more than an average person. However, if the posts about failed mobos are making you think that it happens to all Legions, then this post is for you.\n\n**Negativity Bias**\n\nOkay, let's talk about those posts you're seeing. I believe many have pointed this out, but this is a case of **negativity bias**. People are much more likely to talk about a bad experience than a good one. Try looking up the reviews for Lenovo, they are all like 1 star right? Now look up the reviews for any laptop brand, oh wait, they are all 1 star! I'm not saying those issues aren't happening, they could happen to anyone, but you must have done something wrong while using your Legion or you are just really unlucky to get a faulty one.\n\n**How's my Legion doing?**\n\nWith that being said, I got my Legion Pro 5 16IAX10H (Intel Ultra 9 275HX | RTX 5070 Ti | 32 GB DDR5 | 1 TB SSD) a little over 2 months ago. I used it for about 2 weeks before adding a 2 TB 990 Samsung SSD (I couldn't choose the 2 TB option when buying since this specific config was on sale for like 25%).\n\nAs of right now, everything worked great, there were mostly no issues except for the freezes in Helldivers 2 which I believe is just the game's optimization since none of my other games have issues.\n\nP.S. I didn't overclock/undervolt anything if you're wondering.\n\n**Tips**\n\nNow, if you bought your Legion and is waiting for it, here are some tips for you. This is my 5th laptop and 2nd gaming laptop if that makes me more credible for you :&amp;gt;.\n\n**1. Watch Youtube videos on how to setup your new laptop**\n\nI cannot tell you how helpful these videos are. Yeah, they mostly repeat the same stuff you already know again and again like \"Update your drivers\" or \"Uninstall the bloatwares,\" but that's because those are actually important.\n\n**2. Join the Discord**\n\nThe Legion Discord is really amazing, you can find guides and ask questions about everything in there. They genuinely helped me save so much time setting up my laptop instead of having to spend hours trying to mess around with the settings. If you don't want to spend time watching Youtube videos for general setup, at least follow the guide in the server since it is specific for Legion laptops.  \nHere's the link, you can also find this in the description of this sub: [https://discord.gg/legionseries](https://discord.gg/legionseries)\n\n**3. Get a laptop stand/cooling pad**\n\nPLEASE, allow your laptop to breathe. The best option is a cooling pad, though I have heard mixed results for the 10th gen. You can also get a laptop stand for like $10, which is what I'm currently doing. This is the absolute minimum you need to do, heck, just get something thick and put in under the back your laptop and that should work too if you don't wanna spend more money, just make sure not to cover the vents.\n\n**4. (OUTDATED) DO NOT update to the latest NVIDIA drivers**\n\nThe latest NVIDIA driver (581.57) apparently fixed all of the issues. I'm still keeping this tip though since it is a good example of the Discord saving me.\n\nI know this contradicts the general tip of updating your drivers, but I will explain. This is why I wrote #2, because I wouldn't have known this had I not join the Discord. Legions are having issues with NVIDIA's recent drivers. So only update to the latest stable version for Legions, which is 577.xx. If it comes with a more recent version than 577, there should be a lot of guides in this subreddit or in the Discord to revert back.\n\nThat is it for now, I might update the tips if I remember anything else. Thanks for reading!",
    "Reddit: Just like the OLED Deck, Lenovo has put a Samsung OLED panel with PWM that is aggressive to the eyes in the Legion Go 2\nAnd this isn't good news. I was the one who did the PWM analysis on the Steam Deck OLED screen, where at least 5% of people have problems with eyestrain, nausea, or tired eyes due to using a panel with aggressive PWM. Like the Steam Deck OLED, the panel is Samsung, those black bars captured in the slow motion recording indicate that the screen, especially below 50% brightness, turns on and off very drastically, and it has a low PWM Hz frequency, like the OLED Deck. \n\nI was hoping that Lenovo would include DC-Dimming or a high Hz PWM frequency so that it wouldn't affect people, but unfortunately this won't be a console that everyone will be able to use comfortably. The screenshots are from a chinese review of the Lenovo Legion GO 2. \n\nHere's my analysis of the Steam Deck OLED screen if you want to understand what I'm talking about in a more technical way:\nhttps://www.reddit.com/r/SteamDeck/comments/1882kys/analysis_of_the_pwmflickervisual_fatigue_of_the/",
    "Reddit: Lenovo Legion Pro 7i Gen 10 RTX 5080 | Initial Impressions\nSo I have been testing out the new Legion Gen 10 with a RTX 5080 for the past couple days, and I wanted to go over some initial impressions while I piece together a review for their 2025 refresh. My Initial impression is \"GO BUY IT NOW!\" Alright post over....   \n\nJokes aside this unit has been something very interesting that deserves a close look and deep consideration. So grab a snack, and get ready for an organized rant/look at their new laptop.\n\n\n\n\\---First Impression---  \nIf you have ever unboxed a Lenovo legion before, there is nothing new here. Very straightforward packaging and nothing fancy. As I take the laptop out of the cloth sleeve I see the new stunning eclipse black finish. it looks really nice and a very premium shade of black so people will now this is not just some plastic cheap laptop. However, as I sat it on my desk and moved away my hand it became clear they will also see finger prints. This is something pretty much all darker laptops have to deal with to a degree and seems to be worse on the lid than the internal deck, but they will wipe away.\n\n\n\n\\---The Display---  \nTurning it on for the first time reveals the amazing OLED panel Lenovo has chosen for this laptop. The absolute true black levels make the screen looks like its off while bright vibrant colors shine through. The 1000nit peak brightness can make your eyes water. The glossy finish is a bit of a trade off. On one hand it is highly reflective and could be problematic in brightly lit rooms. However, what you loose in refections you gain in image quality. Anyone who has ever used a glossy display knows just. how sharp images look on a glossy display versus slightly muted on a matte screen. For my use case and area the gloss has never bothered me. This is hands down the best panel I have ever seen.\n\n\n\n\\---This panel Vs. ASUS Mini-LED---  \nHaving tested the SCAR 18 last gen, which I thought then was the best display I had ever seen. I thought I would take a moment to compare the two and why OLED is worth your time. With the Scar panel you got an 18inch (2inches larger) panel that is very immersive. It had great colors, amazing HDR, and is a truly great panel. However, it leaves frames on the table. Having had the chance to test the Scar (Mini-LED) &amp;amp; Strix (IPS) side by side it was very obvious how much slower in G2G response time the Mini-LED was. It was not horrible, and for many game types it is more than fine. However, for fast paced games the faster response time from the Strix IPS felt like a clear advantage. Moving to OLED with its 0.5ms response time it was such a huge upgrade. Everything is sooo incredibly smooth. 120Hz on this looks like 240Hz on that IPS. If you play fast paced games the OLED is such a game changer that it feels like there is no other option.  \n\n \n\n\\---The Chassis---  \nThe Keyboard feels very nice. Not mechanical levels of good, but has very good key travel and is a joy to type on. The trackpad is plastic and while it feels better than last years to me, its not glass and is not amazing. It's definitely passable, but I wish they would bring back the glass top. Build quality over all was very good and it feels like a very solid unit. The new rear RGB is ok. Personally I disable the rear lighting by the vents because I don't want any extra heat near the pipes, and also on the logo to keep any heat away from the OLED panel. The RGB is bright a very vibrant, really high quality LEDs being used for sure.\n\n\n\n\\---Temperatures---  \nWhile I will go into more depth in the full review, the temps are mix. The new intel CPU is offering some really great performance, but it gets hot. On the top Performance mode, sitting in the COD lobby witch is a good CPU/GPU taxer, it would reach 86c on the GPU which is its max temp. Running the TimeSpy stress test it was only getting 94.5% starting at 153FPS and ending on the 20th run at 144FPS. not great. The balanced and quiet modes where great with a 99.1% score which is pretty darn good. Using throttlestop I was able to apply a small -45mv undervolt to the core, cache, and system which brought that score up to 98.1% and the FPS never went lower than 150. CoD was also not showing it go above 83c. Due to their shared heat pipes if the CPU is hot the GPU is hot, so undervolting does a lot and I would highly recommend applying a small one to take the edge off for max performance.\n\nOn another note the deck on this laptop is one of the coolest I have ever felt. After gaming for a couple hours it still felt cool to the touch in the wrist and keyboard area. You could game on this all day comfortably.\n\n\n\n\\---Fan Noise---  \nThe fan noise on this machine is one of the best I have ever heard. And as you will see in the benchmarks at the bottom, all performance levels offer great gaming. Yes the top mode is a little up there and the middle mode is not the quietest I have heard but they sound pleasant. No high pitched sounds. No whining, no ear piercing ringing. It sounds good and this means everything to me. I have returned dozens of laptops for horrible fan noise or horrible performance on the lower fan settings, but this laptop delivers on both fronts.  \n\n\n\n\\---Early Adopter Issues---  \nThere have been a couple quarks being an early adopter of a brand new unit I want to go over. The first is that G-Sync was broken out of the box. After working with their support, they were already working on a BIOS update to fix this. Once it was updated G-Sync worked. The other is the refresh rate is not reporting correctly. With G-Sync on it shows an strange 103hz-240hz VRR range. I am not sure whats thats about, and I have talked with other who do not have this problem, but it is something I am dealing with. The last thing is after updating the Nvidia driver the HDR brightness dropped to 170nits peak. Now it is easy enough just to recalibrate, it takes 30 seconds to set the dark to 0, and the other two brightness to the expected 1100 it said before, but its still odd and thing to be aware of.\n\n\n\n\\---Summary---  \nThe laptop may not be perfect, but after testing dozens and dozens of laptops over the years, none of them are. You have to make compromises and get one that checks enough boxes to make you happy. I have to say that this one for me checks all the boxes I care about. It performs so well, and is just such a jow to use. Lenovo knocked it out of the park this year and if you can find a good deal among all the madness right now, I would say pick it up in a heart beat.\n\n\n\n\\---BECHMARKS---  \nCinebench R23  \nSingleRun Multi-core = 37,399  \nSingleRun Single-core = 2,194\n\n—————————————————————————————————\n\n\\---TimeSpy---\n\nPerformance (OC was enabled by default) 56/49db  \nOverall: 22,204  \nGraphics: 23,205  \nCPU: 17,844\n\nBalanced 49/40db  \nOverall: 17,160  \nGraphics: 17,159  \nCPU: 17,169\n\nQuiet 42/36db  \nOverall: 14,929  \nGraphics: 14,685  \nCPU: 16,482\n\n—————————————————————————————————\n\n\\---Steel Nomad---\n\nPerformance  54/46db  \nOverall: 5,268\n\nBalanced 47/39db  \nOverall: 3,762\n\nQuiet 41/35db  \nOverall: 3,479\n\n—————————————————————————————————\n\n\\---Port Royal---\n\nPerformance 56/49db  \nOverall: 14,699\n\nBalanced 47.5/40db  \nOverall: 10,968\n\nQuiet 44/37db  \nOverall: 9,661\n\n—————————————————————————————————\n\n**Shadow of the Tomb Raider (Highest Preset / Performance Mode)**\n\n1080p/TAA/DX12/DLSS OFF: 235 \n\n1080p/DX12/DLSS Quality: 238\n\n1440p/TAA/DX12/DLSS OFF: 191\n\n1440p/DX12/DLSS Quality: 212\n\n————————————————————————————\n\nCyberPunk 2077\n\n1600p / Ultra / DLSS off / Performance Mode: 94.58 FPS\n\n1600p / Ultra / DLSS off / Balanced Mode: 72.54 FPS\n\n1600p / Ultra / DLSS off / Quiet Mode: 56.95 FPS\n\n————————————————————————————\n\nSilent Hill 2 Remake (At start, looking with bathrooms on left with the trash can on the screen edge and his car on the right edge)\n\n1600p / RTX on / Quality Preset High / Performance Mode: 65FPS  \n1600p / RTX on / Quality Preset High / Balanced Mode: 52FPS  \n1600p / RTX on / Quality Preset High / Quiet Mode: 42FPS\n\n1600p / RTX off / Quality Preset High / Performance Mode: 80FPS  \n1600p / RTX off / Quality Preset High / Balanced Mode: 63FPS  \n1600p / RTX off / Quality Preset High / Quiet Mode: 51FPS",
    "Reddit: Lenovo Legion R27qe review: Good. Just good.\n**Intro**\n\nI have been scavenging Amazon for a 27\" 1440p monitor and came across affordable Lenovo Legion R27qe (£150). I haven't found any decent reviews on it, so decided to write my own.\n\n**Preface**\n\nI have been using 2x24\" 1080p monitors for quite some time: AOC 24G4 (main, horizontal) and AOC 24G2 (secondary, portrait). I realised I do not like seeing all the pixels on my main screen, hence an upgrade.\n\nI have replaced my main monitor with Lenovo and swapped my secondary around with AOC 24G4.\n\n**Links**\n\n* Current monitor - Lenovo Legion R27qe official Lenovo web page: [https://www.lenovo.com/us/en/p/accessories-and-software/monitors/gaming/67c5gac1us](https://www.lenovo.com/us/en/p/accessories-and-software/monitors/gaming/67c5gac1us)\n* Big brother - Lenovo Legion R27q-30 official Lenovo web page: [https://www.lenovo.com/us/en/p/accessories-and-software/monitors/gaming/67b4gac1us](https://www.lenovo.com/us/en/p/accessories-and-software/monitors/gaming/67b4gac1us)\n* Some foreign language reviews (can use translated auto-captions):\n   * [https://www.youtube.com/watch?v=GswFb2o1doE](https://www.youtube.com/watch?v=GswFb2o1doE)\n   * [https://www.youtube.com/watch?v=PcUNbfsOrQM](https://www.youtube.com/watch?v=PcUNbfsOrQM)\n   * [https://www.youtube.com/watch?v=Oo-U5\\_PUR1E](https://www.youtube.com/watch?v=Oo-U5_PUR1E)\n* Other people discussing the monitor:\n   * [https://www.reddit.com/r/buildapc/comments/1h2hwfa/is\\_lenovo\\_legion\\_r27qe\\_good/](https://www.reddit.com/r/buildapc/comments/1h2hwfa/is_lenovo_legion_r27qe_good/)\n   * [https://www.reddit.com/r/PcBuild/comments/1fvct4q/what\\_budget\\_27\\_1440p\\_to\\_choose\\_lenovo\\_r27qe/](https://www.reddit.com/r/PcBuild/comments/1fvct4q/what_budget_27_1440p_to_choose_lenovo_r27qe/)\n* ICC colour profile: [https://www.reddit.com/r/LenovoLegion/comments/1hrywvw/where\\_to\\_get\\_an\\_icc\\_profile\\_for\\_lenovo\\_legion/](https://www.reddit.com/r/LenovoLegion/comments/1hrywvw/where_to_get_an_icc_profile_for_lenovo_legion/) (direct link: [https://download.lenovo.com/consumer/monitor/r27qe\\_driver.zip](https://download.lenovo.com/consumer/monitor/r27qe_driver.zip) )\n\n&amp;gt;The only ICC profile I found was the official from Lenovo. You can get on Lenovo's website [here](https://support.lenovo.com/ie/en/downloads/ds569750-lenovo-legion-r27qe-driver-for-microsoft-windows-11-64-bit-windows-10-64-bit). Just download the Zip file and it will have the `R27qe.icm` file which you can use to add a color profile for the monitor.\n\n&amp;gt;There are plenty of tutorials on YT on how to do it but the easiest would be (Windows 11):\n\n&amp;gt;\\- Download ZIP file\n\n&amp;gt;\\- Extract the entire folder\n\n&amp;gt;\\- Go to *Settings* \\&amp;gt; *System* \\&amp;gt; *Display*\n\n&amp;gt;\\- Select you monitor, if you have multiple (It will be highligted with purple; click **Identify** to ensure the right one is selected)\n\n&amp;gt;\\- Scroll down, click *Color Profile* under Brightness &amp;amp; color\n\n&amp;gt;\\- Click **Add profile**\n\n&amp;gt;\\- Find the `R27qe.icm` file in the folder you extracted previously, double click it (or select and click **Open**)\n\n&amp;gt;\\- The profile will be added and can be selected under Color Profile\n\n**Model comparison**\n\nComparing datasheets:\n\n* Lenovo Legion R27qe is missing speakers\n* Lenovo Legion R27qe is having a brighter display (450nits vs 400nits)\n\nOne note about R27q-30 - it is capable of 180Hz for short periods of time, it then drops the refresh rate. According to reviews of R27qe - it can handle 180Hz indefinitely.\n\nOtherwise, I believe both models are identical. That makes me think that R27qe is just a cheaper option of R27q-30 (£150 vs £250). I will not be able to do a head-to-head comparison, so \"trust me, bro\" is the only thing I can say here.\n\n**Case/Enclosure**\n\nThese monitor borders are THICC - \\~7mm. Comparing that to AOC 24G4 \\~5mm. It's not critical, but in multi-monitor setup, it will get time to get used to.\n\n**Stand/Arm**\n\nI use my own arm for dual-monitor set-up. So this goes unused in my case.\n\n**Colour/image settings**\n\nExact gamut coverage is available in this review: [https://youtu.be/Oo-U5\\_PUR1E?si=MzUR5LCD4kpVdbF0&amp;amp;t=304](https://youtu.be/Oo-U5_PUR1E?si=MzUR5LCD4kpVdbF0&amp;amp;t=304)\n\nOut-of-the-box experience was pretty poor - colours were dim and having a reddish tint. Below are my settings to make it right:\n\n(Settings below last updated 04/01/2025)\n\n* Game settings:\n   * Game mode: Standard\n   * Overdrive: Level 2\n   * Adaptive Sync: Auto (AMD FreeSync)\n   * Refresh Rate Num: Off\n* Screen settings:\n   * Brightness: 100\n   * Contrast: 75\n   * DCR: Off\n   * HDR: Off\n   * Dark boost: Level 4\n   * Sharpness: 50\n   * Relative Gamma: Off\n* Colour settings:\n   * Colour temp: User\n      * Red - 100\n      * Green - 86\n      * Blue - 100\n   * Saturation: 45\n* Port: Display port 1.4\n\nOut-of-the-box, Windows identified the following supported refresh rates (Hz):\n\n* When connected via Display Port (10-bit colour depth):\n   * 60\n   * 120\n   * 144\n   * 165\n   * 180\n* When connected via HDMI (8-bit colour depth):\n   * 60\n   * 120\n   * 144\n\nI have gone with DisplayPort and 144Hz - I know I can set it up to 180. However, my GPU then starts playing up by maxing out DRAM frequency no matter what I do (65W GPU consumption at idle). So I went with the more eco-friendly option of 144 - then my card drops to around 25W at idle.\n\n**Calibrated colours/settings**\n\nAfter adjusting the settings, the colours became similar to my AOC 24G4 which I deem pretty good. Going through a couple of the settings:\n\n* **Relative Gamma** seem to be skewing the colours a lot. I tried various settings but could not make it right - with one settings darks look pretty good, but red colour leaves the chat. With other - colours start looking washed out. So leaving it off is the way.\n* **Dark boost** does what you would expect - boosting dark areas of a screen. I really like different profiles, and it indeed boosts the dark regions of a screen. However, similar to **Relative gamma**, it becomes impossible to balance the colours. So, leaving it at Level 4 (default, and I believe it means off) is the way.\n* **HDR** \\- just leave this boy off, it's not a true HDR monitor. Thank me later.\n* **Colour settings** allows adjusting Saturation and RGB channel individually. Pretty solid. Again, those are adjusted to my liking - I prefer slightly vivid colours, but not too much.\n\n**Gaming performance**\n\nI use FreeSync. With that in mind, I tried various overdrive levels. Anything above Level 2 resulted in quite some ghosting, even when browsing the web (e.g. scrolling a lot of text on a white canvas). Only 3 reasonable options left: Off, Level 1 (4ms) or Level 2 (3ms).\n\n**Overall performance**\n\nOverall, it's a solid monitor. There is nothing to blame it for. There is nothing to give it awards for. Its a solid monitor. Especially when factoring in the price. In case you are planning of getting into 1440p gaming - this monitor could be a solid budget option.\n\nPS I might come back to this post in the future if I find anything else worth adding. At the time of writing, I had this monitor for like 5 hours.\n\nUpdate 05/12/24: The edges are having a bit of a backlit bleed. Not too critical - its only noticed with dark/black colours. Moving a bit to the side fixes that.\n\nUpdate 16/02/25: Added ICC colour profile link",
    "Reddit: A warning about the cheaper, 15.3\" IPS Legion 5 Gen 10 15AHP10 (as seen at Microcenter)\nSo, I bought this model with the sale from Microcenter, and I'm quite happy with it honestly, but I just wanted to make some the differences clear here, because Lenovo certainly doesn't. Here is the link to the model I'm talking about: [Lenovo Legion 5 15AHP10 15.3\" Gaming Laptop Computer - Eclipse Black; AMD Ryzen 7 260 3.8GHz Processor; NVIDIA GeForce - Micro Center](https://www.microcenter.com/product/698178/lenovo-legion-5-15ahp10-153-gaming-laptop-computer-eclipse-black)\n\nThere are pretty much 0 reviews for this version of the laptop, and I suspect that u/theworkingcusp is right that [this model is intentionally made as their \"holiday\" model](https://www.reddit.com/r/LenovoLegion/comments/1p9irkj/comment/nrd80gv/?utm_source=share&amp;amp;utm_medium=web3x&amp;amp;utm_name=web3xcss&amp;amp;utm_term=1&amp;amp;utm_content=share_button) which is made to look like the more popular 15.1\" OLED model while hiding some trimmed down specs. I also am not able to find the model for sale on the Lenovo website even, which makes me think it's a limited production model just for the holiday sales. I did see it in the refurbished / Outlet site briefly I think, but can't find it anymore.\n\nSo, here is the actual list of differences between the well-reviewed 15.1\" OLED Legion 5 Gen 10 and the cut-down 15.3\" IPS Legion 5 Gen 10.:\n\n||15.1\" OLED model|15.3\" IPS model|\n|:-|:-|:-|\n|Screen|OLED, 500 nits SDR / 1000 nits HDR|IPS 300 nits|\n|Battery|80whr|60whr|\n|Security|Windows Hello IR sensor|N/A|\n|Chassis|Aluminum top, plastic bottom|All plastic|\n|Dimensions|Same width and height between them, IPS model is slightly thicker and heavier|Same width and height between them, IPS model is slightly thicker and heavier|\n|Connectivity|Not sure|Mine came with the cheaper Realtek card that people complain about with these Gen 10's. WIFI seems to be okay, but bluetooth has been temperamental with my switch Pro controller |\n|Keyboard Backlight|24-Zone RGB backlight|White backlight|\n\nSome of the differences between these two models are detailed in the [PSREF document from Lenovo](https://psref.lenovo.com/syspool/Sys/PDF/Legion/Legion_5_15AHP10/Legion_5_15AHP10_Spec.pdf), but it doesn't tell the whole story. One thing that it's missing is that the 15.3\" IPS model does not have the IR camera, thus no windows Hello.\n\nI'm still loving the IPS Legion 5 so far, just wanted to make this clear for people who might be thinking the two models are exactly the same, or that the only difference is the screen, because its more than that. I Think it was kind of shady to decrease the battery size but especially shady to take out Windows Hello and not even mention it in the PSREF. It's also sketchy that there were seemingly no review units sent out for this cheaper model -- almost as if Lenovo doesn't want people to know about the true spec differences between the two...\n\nIt's still a solid value at &amp;lt;$1,000, but people should know what they are getting and how Lenovo cut costs to get to this price point.",
    "Reddit: Lenovo Legion Pro 5 2025 / R7000 2025 Chinese Version Full Review\nfter several days of use with the Lenovo Legion Pro 5 2025 (R7000 2025 Chinese version), I’ve gathered enough experience to share a detailed and honest review that blends actual usage with official specs.\n\nThis unit features an AMD Ryzen 9 8940HX processor, paired with an NVIDIA RTX 5060 Laptop GPU. It comes with 16GB DDR5-5200 RAM , and a 1TB PCIe Gen 4 SSD. The display is a 16″ WQXGA IPS panel (2560×1600), 240Hz refresh rate, 3ms response time, 500 nits brightness, 100% DCI-P3 color gamut, with support for G-Sync, FreeSync, Dolby Vision, HDR400, and Advanced Optimus. The system is powered by a 245W adapter .\n\nBuild quality is solid. The keyboard is one of the highlights it offers a tactile, responsive feel that’s surprisingly close to mechanical switches, making typing genuinely enjoyable. The design is clean and minimal, with no RGB lighting, which I personally prefer.\n\nOut of the box, the system comes with a Chinese version of Windows (OEM). To use it properly outside China, you’ll need to purchase and install a global Windows license. Without this, you may face language limitations.\n\nPerformance is excellent across the board. The system boots quickly, handles multitasking smoothly, and runs demanding applications without hiccups. In Cinebench R23, the CPU scored 33,000 in multi-core and 1,860 in single-core, confirming its high-end capabilities. However, the CPU runs very hot even when idle, it stays around 60–70°C. I attempted undervolting through the BIOS, but the option is locked and only overclocking is available. Hopefully, a future BIOS update will unlock undervolt support, because this chip clearly needs it. GPU temperatures are normal and stable during gaming, with no signs of throttling.\n\nFan noise is minimal during light and moderate use, and only becomes noticeable under heavy load. Overall, thermal behavior is acceptable for the GPU but concerning for the CPU.\n\nI tested a wide range of games including all Soulsborne titles (Dark Souls series, Elden Ring, etc.), Red Dead Redemption 2, Horizon Forbidden West, Cyberpunk 2077, Fortnite, Rocket League, and Marvel Rivals. All games were played at native 1600p resolution. In heavier titles, I had to lower graphics settings slightly to maintain stable frame rates and avoid VRAM bottlenecks especially since the RTX 5060 has 8GB of VRAM. Once adjusted, gameplay was smooth and consistent across the board.\n\nThe display is one of the strongest aspects of this laptop. The 240Hz refresh rate combined with G-Sync delivers incredibly smooth motion, and the HDR support. Colors are vibrant, contrast is excellent, and the overall visual experience is top-tier, whether gaming or watching content.\n\nOn the software side, Legion Space and Lenovo Vantage do not work properly on this Chinese version. The only functional control app is Legion Zone, which is entirely in Chinese. It takes time to get used to, especially if you don’t read Chinese, but once you memorize the layout and icons, it becomes manageable.performance modes, and GPU switching all work fine through it.\n\nIn summary, the Lenovo Legion Pro 5 2025 / R7000 2025 is a powerful and well-built machine with excellent display quality, strong gaming performance, and a great keyboard. The main drawbacks are the high CPU temperatures, the lack of undervolt support, the Chinese-only software, and the need to replace the bundled Windows with a global version. If you’re comfortable navigating Legion Zone and can live with the thermal behavior, this laptop delivers a solid experience for gaming and productivity alike.",
    "Reddit: Lenovo IdeaPad Pro 5 14\" (2025) - Performance Benchmarks\n# Performance Benchmarks\n\n**CineBench 2024** \\- **Single Core: 123 pts | Multi Core: 1036 pts**\n\n[Cinebench 2024 - Geek Mode, Plugged in, No BG Apps, Wi-Fi disabled ](https://preview.redd.it/af9m7micty0f1.png?width=2880&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=98ea0a8b6b54b1c645f6ca20c1e8b30d7ade4068)\n\n|[IdeaPad Pro 5 14\" - Intel Core Ultra 5 225H 14 Cores](https://lenovo-in.zlvv.net/zxR33m)|Single: 123|Multi: 1,036|\n|:-|:-|:-|\n|Lenovo Legion 5i (2024) - Intel i7-14700HX (20c(8P+12E)/28t)|Single: 123 (0%)|Multi: 1,426 (+37%)|\n|ASUS Zenbook S 14 (2024) - Intel Ultra 7 258V (8c(4P+4E)/8t)|Single: 122 (-0.8%)|Multi: 604 (-42%)|\n|Apple MacBook Pro 14 (2023) - M2 Max (12c(8P+4E)/12t)|Single: 121 (-1.8%)|Multi: 1042 (+0.6%)|\n|ASUS Zephyrus G16 (2024) - Ryzen AI 9 HX 370 (12c(4P+8E)/24t)|Single: 116 (-5.7%)|Multi: 1188 (+15%)|\n|HP Omen 14 (2024) - Intel Ultra 9 185H (16c(6P+8E+2LPE)/22t)|Single: 109 (-11.4%)|1,014 (-2.1%)|\n|Ryzen AI 9 365|Single: 114 (-7.3%)|Multi: 1043 (+0.7%)|\n|Ryzen AI 7 350|Single: 114 (-7.3%)|Multi: 820 (-21%)|\n\nThe percentages in the brackets shows how slow or fast that particular processor is in single or multi core performance in comparison to the IdeaPad Pro 5 14\" - Core Ultra 5 225H. The bechmark data for the comparison laptops are taken from [Jarrod's Tech](https://jarrods.tech/laptop-cpu-performance-in-cinebench-2024/) and [nanoreview](https://nanoreview.net/en/cpu-list/cinebench-scores).\n\nThese results show that the Core Ultra 5 225H can push impressive numbers that are capable of competing and outperforming several popular laptops. Notably, it performs very similarly to a MacBook Pro M2 Max. While this laptop is from 2023, it is still a Pro laptop which costs over 3 Lakhs (more than 3x price). It is also significantly faster than the latest ZenBook S 14 with Intel Core Ultra 7 258V as well.\n\nFor those comparing the Ryzen 7 350, in multi-core performance, the Core Ultra 225H is about 21% faster and in single core, it is about 7% faster.\n\nThe IdeaPad Pro 5 14 maintains around **72W** of sustained avg. power draw while maintaining around **92c** avg temperature during the **CB2024 Multi Core** benchmark. In **Single Core**, it remains relatively cool at around **17W** avg. power consumption and avg. temperature of around **62c**.\n\n\\-------------------------------------------------------------------------------------\n\nOther **CPU Benchmark Results**\n\n|Benchmark|Single|Multi|Overall|\n|:-|:-|:-|:-|\n|CineBench R23|1,910|17,667||\n|Geekbench 6|2,590|14,838||\n|CPU Mark|4,390||35,021|\n|PassMark|||7003|\n|||||\n\n[**cpubenchmark.net**](http://cpubenchmark.net) **- CPU Mark Result comparison**\n\n|CPU|**Single**|**CPU Mark Score**|Notes|\n|:-|:-|:-|:-|\n|[IdeaPad Pro 5 14\" - Intel Core Ultra 5 225H 14 Cores](https://lenovo-in.zlvv.net/zxR33m)|**4,390**|**35,021**|CPU Benchmark is a popular website fo CPU Performance comparison. These are the scores that my IdeaPad Pro scores in the PerformanceTest Benchmark.|\n|Intel Core Ultra 9 285H|4,416 (+0.6%)|33,031 (-5.7%)|Despite having 2 extra cores and threads and boost up to 5.4 Ghz compared to the 4.9Ghz on the Core Ultra 5 225H, this Core Ultra 9 285H is barely faster. It is possible that the IdeaPad has good optimization and boost/sustained power settings to get that additional performance.|\n|Intel Core i7-14650HX|*3,895 (-10.5%)*|35,217 (+0.6%)|This practically outperforms an i7-14650HX with a much higher TDP. The efficiency gains on this new 3nm node is quite impressive.|\n|AMD Ryzen 7 7800X3D|*3,754 (-14%)*|34,244 (+2.2%)||\n|AMD Ryzen AI 9 HX 370|*3,966 (-9%)*|35,165 (+0.4%)|That's on par with AMD's AI Ryzen 9 series!|\n|Apple M4 Pro 12 Core|4,605 (+4.9%)|*33,049 (-5.6%)*|A MacBook Pro with M4 Pro starts at 2 Lakhs and has only 24GB RAM and half storage. The performance is quite similar with only|\n|Apple M4 10 Core|4,584 (+4.4%)|*24,040 (-31.4%)*|The IdeaPad is comfortably in a league above the MacBook Air M4. (More so in the Display section)|\n|Intel Core Ultra 7 255H|4,449 (+1.3%)|*29,769 (-15%)*|This is an average of 93 samples. This likely means that when well optimized, a good Core Ultra 5 225H can be as good or better than an avg. Core Ultra 7 255H.|\n|AMD Ryzen AI Max 390|*4,236 (-3.5%)*|45,950 (+31.2%)|This is one of the few serious competition from Ryzen Series but it has a much higher TGP at upto 120W and costs significantly more.|\n|*Intel Core Ultra 9 288V*|*4,272 (-2.7%)*|*20,360 (-41.9%)*|The Core Ultra V series is one of the best when it comes to efficiency but even the Core Ultra 9 288V is significantly behind compared to H series 225H when it comes to multi core performance|\n|Intel Core i9-14900HX|4,285 (-2.4%)|45,408 (+30%)|Speaks for itself.|\n|*Intel Core Ultra 5 125H*|*3,422 (-22.1%)*|*21,268 (-39%)*|That's quite a significant jump in generational performance gains.|\n\nI repeated the tests a couple of times back to back and this was consistently outputting similar numbers.\n\nThe rest of the comparisons speak for themselves. I wanted to get the data out there without making you wait for the final polished review. Hence, no graphs. Will be present in the final review.\n\n**GPU Benchmark Results - To be Updated (\\*below data was taken before the graphics driver update except for Steel Nomad) - GPU - Intel Arc 130T (16GB) iGPU**\n\n|Benchmark|Points|Notes|\n|:-|:-|:-|\n|TimeSpy Extreme|Extreme - 2,006, Graphics Score - 1,787, CPU Score - 6,624||\n|FireStrike|Fire Strike Score - 9,199, Graphics Score - 9,734, Physics Score - 31,603, Combined Score - 3,716||\n|Steel Nomad\\*|Steel Nomad Score - 694, Graphics Test - 6.94 FPS||\n|Time Spy|Time Spy Score - 4,192, Graphics Score - 3,772, CPU Score - 11,398||\n\n\\---------------------------------------------------------------\n\n**Forza Horizon 5 Benchmarks**\n\n[2.8K Resolution native, no DLSS\\/FSR\\/XeSS\\/FG - High Preset with Ray Tracing - Medium, 40 FPS Avg with 0 stutters.](https://preview.redd.it/27azzvc7jz0f1.png?width=2880&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=79d7c31deabaa9c9bfc6238249aae138be81e328)\n\n[FHD+ Resolution, no DLSS\\/FSR\\/XeSS\\/FG - High Preset with Ray Tracing Medium - 58 FPS](https://preview.redd.it/wwda7878jz0f1.png?width=2880&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=d68d96cbbb8f6f2c1081e8175c8c1b7b06996b6c)\n\nI was quite skeptical initially about the claims of this iGPU but I think these screenshots speak for themselves. I actually preferred playing at 40-45 FPS at FHD+ but with Ultra Settings. The quality is noticeably better and the gaming is still smooth since there are no noticeable stutters. Quite Satisfied here and the iGPU is completely being used. Fun fact - the shared memory makes this a 16GB GPU. The CPU (and iGPU) temps while playing were very stable and cool at around 60c. The fan noise is barely audible due to the low temperature. Also, note that it can offer the exact same performance unplugged as well since it doesn't seem to have a power consumption limitation on Battery when in performance mode.\n\nSo, it is going to perform exactly the same when unplugged but you can probably game for around 2 hours before it drops to around 5%. This is based on my experience when I used it connected to TV to play FH5 in external display only mode. If there is no external display involved, the power consumption might be higher and your battery runtime for gaming at full performance might be around 1.5 hours. This is my speculation and not a tested number.\n\nDon't take the above numbers as the battery runtime of this device. That is the one part that I thoroughly need to test now. My expectations are that it should last 6-10 hours depending on the load and settings. I will try to run a web browser test and a video playback loop test and then update this post on a later date. This will take time and is a long task.\n\n**Link to Lenovo** [**IdeaPad Pro 5i 14IAH10 (2025) 83JKCTO1WWIN1 - Customized**](https://lenovo-in.zlvv.net/zxR33m) \\- starts at **Rs 84,101** for the base model with Core Ultra 5 225H, 32GB 8533Mhz RAM, 512GB Gen 4 SSD, 14in 500 nits SDR, HDR TrueBlack 1000 certified 1,100 nits (HDR) 120Hz 14in OLED - 100% DCI-P3 with 48-120Hz VRR in a fully metallic chassis weighing just 1.39 Kg.",
    "Reddit: Legion 5i Pro 2024 – 2 Week Honest User Review\nSo I’ve been using the new Legion 5i Pro (RTX 5060 , 275HX Graphics Card , 16\" IPS Screen ) for about 2 weeks now...\n\n I picked it up during Black Friday at Costco for $1199, and honestly, for that price it’s an absolute steal. I saw a lot of complaints on Reddit at first and even thought about canceling my order, but I’m glad I didn’t..\n\nOne thing people forget is that most folks come to legion reddit only when they have issues.. There are milliomss of people happily using this laptop while only a smaller percentage actually run into problems like motherboard failures or other defects..\n\nPerformance wise , this thing is awesome. The cooling is really solid , temps stay under control and gaming has been super smooth . \n\nI’ve been playing \"Where Winds Meet\" on high settings for the past 2 weeks and it runs great.. \nThe only downside for me is the IPS screen ,  OLED would’ve been amazing , but IPS is still perfectly fine..\n\nI did notice a very slight hinge issue, but nothing serious.. Keyboard feels great too, though I personally think the numpad is kinda useless for gamers since I never touch it 😂\nBattery life is decent: around 4 hours for normal use, and about 1.5 hours while gaming. But honestly , gaming with battery charge isn’t recommended anyway ( plug in if you want full performance ).. \n\nThere are a few flaws too.. The matte finish gets oily and picks up fingerprints easily and when I tried cleaning it , I kinda made it worse lol. \n\nBut overall, I definitely feel like this laptop can easily last 4+ years.\n\nIf you’ve got any questions, feel free to ask. And seriously, don’t get scared by all the negative posts in this sub. Out of millions sold, only a small percentage actually end up defective. If you stress test your laptop in the first week , any major issue will show up and you can just replace it.",
    "Reddit: Lenovo Legion Pro 5 16ARX8 review: Gaming laptop with RTX 4050 in great form",
    "Reddit: Lenovo Legion 5i Gen 9 review: 45 days in\nSo this is just gonna be a brief review/impressions with this thing. I\n\nSpecs:\n14900HX\n4070 Mobile GPU\n32GB DDR5 RAM (5600 megatransfers/sec)\n2.4K IPS 16\" display, 350 nits brightness\n4 zone backlit RGB keyboard \n\n \n\nThe build: So the first thing I noticed with this is how well built it feels. Everything is just SOLID. I know the entire bottom part is plastic, but it's good plastic. Along with a metal top lid, this thing feels way sturdier than my friend's Gigabyte Aorus laptop and MSI Stealth laptop. Everything about it is just rock solid.\n\nThe keyboard: Objectively the best gaming laptop keyboard. I compared it to a MSI sword laptop, as well as an HP Omen transcend 14 and HP victus laptops. The HP omen transcend had an amazing feeling keyboard as well, however some may not like its toy like appearance. The Legion keyboard looks and feels like a Thinkpad keyboard with RGB, and I love it. It's got the deepest travel I've ever felt on a laptop, as well as a keycap design that I'm a fan of. I heard some don't like the shiny black plastic but mine has zero fingerprint marks anywhere.\n\nThe exterior looks: this might be the most subtle gaming laptop I think I've ever come across. Now, this is my first gaming laptop, however after browsing online, testing friends' machines, and browsing stores, I can confidently say this is the least gamery gaming laptop. It's blocky, boring, and just the way I like it. Nobody bats an eye when you take this thing out in public. It's all a single color, and has no fancy designs or branding. The only giveaway are the enormous rear vents and the extremely subtle Legion logo on the lid, which even still blends into the color of the lid. It's appearance is essentially a Thinkpad with some extra text stamped on. Zero exterior RGB lighting, zero accent colors. \n\nThe interior looks: The sleeper type looks continue on some more once you open it up, with more grey plastic and plain black keycaps. Until you look a little closer, that is. Once you notice the I9 sticker and the GeForce RTX sticker, you realize this thing means business. The RGB keyboard turns on, and a beautiful 2.4k display greets you.\n\nThe display: Speaking of the display, it's pretty good. A 2560 x 1600 resolution makes everything crisper than my eyes can ever even notice, and a 16:10 aspect ratio makes it an amazing choice for when I'm using it for work. Complaints arise at the rather dim 350 nit peak brightness, and while I would appreciate at least 400 nits, it's nothing short of beautiful. Colors pop and when you do crank up the brightness, you'll never wish you had more. It really is bright enough for a laptop. \n\nThe performance: Wow. Just wow. It's FAST. Playing Battlefield V at full native res with ultra fidelity is no easy task, but this thing blasts through it at frame rates so smooth I don't even bother checking them. Well into the 100s, most likely over 120. Is fortnite at 2.4k res with raytracing on enough to stop it? Nope. It blasts through battle Royale games one after another with amazing smoothness. The laptop gets rather loud, however, so do pack some headphones and a stand or cooling pad if you're planning to push this thing to it's limits.\n\nBattery life: can't really talk about this area yet as I am yet to use it unplugged. Don't expect it to be great, however it comes with a plenty fast charger \n\n\nFinal thoughts: Very powerful machine. Cooling pad or stand should be a priority. I undervolted my CPU core slightly to negate the 14th gen Intel degradation issues. No crashes, super stable. Hella bulky, but well built and fast. I plan to keep it for as long as I possibly can :)",
    "Reddit: Lenovo Legion Pro 7i RTX 5090\nI was just wondering whether the price was the same during the black friday sale on B&amp;amp;H or not? Because I'm afraid that I'll overpay for it if I buy it now. Thanks in advance, guys!",
    "Reddit: Lenovo Legion or Acer Predator Helios\nSo I currently have the Acer Predator Helios 16S with the 5070ti throttled at 110W &amp;amp; OLED screen, I got it Black Friday for $1450. The subs and all the issues have been scaring me not going to lie, I have until mid January to return it, but I’m not sure if I should swap it for the Legion. It would cost me a little more.. but I’m not sure. \n\nMy goal is reliability. That’s all I ask for in a laptop. I’m even thinking of just swapping it out for the M5 MacBook because I have a desktop with a 9070 XT &amp;amp; 9800x3D. \n\nI sometimes travel for work &amp;amp; would like to be able to play BF6, Ready or Not, Broken Arrow and OSRS, or really even Assassins creed. I have had MacBooks before I know they aren’t the best for gaming but they are very reliable and battery life lasts a long time. I would also be using it for school. \n\nI haven’t really tested the laptop or benchmarked it yet, but I just keep seeing horror stories. I know Reddit is just full of the negative and not the positive, so I’m asking for some genuine answers on what will be better for reliability &amp;amp; overall which laptop will last me the longest with the ability to play games, do school work and other stuff. \n\nAll feedback is greatly appreciated.",
    "Reddit: Lenovo Legion 5 Pro with RTX 4070 review\nI brought a Lenovo Legion Pro 5 with a RTX 4070 about two months ago, and I will start out by saying this a great midrange gaming laptop, and imo belongs on a top ten list of gaming laptops.\n\nPros:\n\n\\-Excellent cooling\n\n\\-Can be brought for $1,000 which is a good price\n\n\\-Gaming performance is fantastic\n\n\\-Portable\n\n\\-RGB Lighting looks beautiful\n\n\\-Superb QHD 16\" screen\n\n\\-Great CPU\n\n\\-Solid build\n\n\\-140W power limit(real power limit is 105W, hmmm, maybe that is why the Strix G16 outperformed it?)\n\n\\-You could probably bring this to the office and others wouldn't think it was a gaming laptop\n\n\\-Easily one of the top ten\n\nCons:\n\n\\-The factory reset process is the most challenging out of all my gaming laptops, because it requires a USB with its drivers to be installed during, making the entire process far longer.  So if you don't have like a second computer to install the drivers on, you're cooked with this model.\n\n\\-Strangely is outperformed by a Strix G16 in spite of having a slightly better CPU(in Counter-Strike: Global Offensive, it gets a max of 293 FPS, while the Strix G16 gets a max of 310FPS).\n\n\\-Fans can be loud\n\n\\-8GB of VRAM is not enough for some\n\nI've switched between using the laptop stand(pictured), and an Aicheson 5 fan cooling pad(not pictured), and both cool it down to similar temperatures.  Would I recommend buying this gaming laptop?  Yes.",
    "Reddit: Lenovo legion GO S (z2go/16/512) review from ex-SD oled owner.\n[GO S with generic case and Skull &amp;amp; Co caps from switch2 ](https://preview.redd.it/5twvceb9bjqf1.jpg?width=4032&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=26c40a96be77fd28b3fa2e72f5522b8fb1484e4e)\n\n# How in the world did I end up with that device?\n\n  Well, first and foremost I would like to warn any reader that that at the end of this text there will be some bullet-points and some conclusions. \n\nTo begin with, I originally had Steam deck Oled with all bells and whistle like 2tb drive, Jsaux clear backplate with thermal pad, hall effect tighter joysticks so I am no stranger to both hardware and software tinkering. However, due to my own stupidity I bricked my unit with no further hope of fixing it. Not only was i devastated that I lost my only gaming machine but also I lost a leverage that i could use for upgrading to a more powerful handheld.\n\nSo, here I am, researching all possible videos/posts and forums on different handhelds. Let me make it clear - SteaDeck oled is really unique but its hardware is virtually outdated and I hated the hd screen (90hz tho) especially after havinf 8' Switch 2, so a big screen was a must for me. Next issue is... the pricing, after not being able to sell SD I had limited time and money to get a handheld since I use games to substitute doomscrolling and  watching brainrot videos. So... let me give you a quick breakdown of current and upcoming handhelds: \n\n* Current Ally x -  **pros:** awesome big battery, upgraded sticks, Z1Extreme, two usb C ports and more or less supported by case manufacturers (which is important!!!) There is also steam os and bazzite if you don't care for modern-anticheat-microtransaction trash. **Cons:** Price for a new unit (don't tell me about open-box ones and 2nd options), Extremely small screen with really big bezels, which is a deal-breaker for me.\n* Xbox Ally X and Ally - not worth of current discussion since the official price hasn't been announced  but with current tendencies I am not willing to pay $1k+ for a handheld. Same goes for GO 2, 8AI+, A8 etc \n* Onexplayer/Zotac/GPD etc are non-existent for me since I care for the brand as well.\n\nI found out that there is LENOVO LEGION GO S but it was a bit confusing a bit. There are a few models with different configurations which you can google but basically there is Z1Extreme and Z2GO. Although, the z2 go is weaker and inferior to Z1E it is not that bad as most youtubers and reddit connoisseurs made it look. So i decided to give it a shot since it cost me about $300 to get a new one.\n\n\n\n#  I am getting tired of writing this so I am going to make quick.\n\n1. **The screen** is gorgeous. Its bigger 120hz with VRR makes game really immersive and all UI element in STEAMOS are crisp. Also VRR helps smooth out the frameate.\n2.    **The joysticks** and hall-effect and even better than steam deck's and i like the buttons as they are not as wiggly as SD's. The only gripe I have is that triggers could use a bit more go and the bumpers are too clicky. the rest is actually near-silent.\n3. **Materials** \\- some people say thet the plastics feel cheaper than steam deck but i stand that it feels better.\n4. **The erhonomics** are top-notch.\n5. The Z2go is and will be a great basic option since the Xbox ally (non-x) will have Z2A which sucks big time. Pair z2go with lossless scaling and you will transform the way ypu game.\n6. It has **official SteamOS support** which is good in turms of valve's support. \n\n\n\n#   Some ugly truths...\n\n1.  **The battery** is really not great, so a powerbank is a must have, however, in my usecase I am surrounded with outlets and stock charger quickly replenishes juice while i have works and smoke breaks.\n2. **The fans** are not that loud especially if you don't face people with air intakes, it can get noise when installing stuff but the device's thermals remain within 50-70C\n3. **The cases and accessories** support could be better. It's cool that there is dbrand killswitch but the thing is pricy, I managed to find literally 3 cases(the one in picture/full-cover silicon/normal silicone) but you can get most big carry cases, just check the sub.\n\nWell, that is all, folks. I am extremely content with this device which will help me wait for a worthwhile upgrade. If you want an entry-level device give it a go (no pun intended) It won't disappoint you. Don't listen to people on the internet but make a well-weighted decision and pls keep in mind that it's only a handheld, tho the niche is full of powerful units, it will take some time for companies to make them more affordable and available (hello, Lenovo UK) \n\n  \nCheers!",
    "Reddit: ASUS ROG Strix SCAR 16 vs Lenovo Legion 7i Pro 5090 ( which one to buy)\nHey everyone,\n\nI'm finally upgrading to a top-tier gaming laptop and have narrowed my choice down to two options: -ASUS ROG Strix SCAR 16 -Lenovo Legion 7i Pro, both configured with the NVIDIA GeForce RTX 5090 GPU and Intel Core Ultra 9 275HX CPU.\n\nI plan to use it primarily for gaming and some work (video editing, general productivity),\n\nI'm looking for the best overall experience and future-proofing.\n\nHere's my current understanding of the pros and cons based on my research:\n\nASUS ROG Strix SCAR 16 (2025 Model) Pros:\n\nFaster Storage Future-proofing: Both M.2 SSD slots support PCIe Gen 5 speeds.\n\nBetter Ports/Features: Includes Thunderbolt 5 support, a larger glass trackpad, and Windows Hello IR camera.\n\nEasy Access: Features a tool-less bottom panel for easy upgrades to RAM and storage.\n\nCons:\n\nMixed reviews on reliability, bad customer Support and LM issues\n\nLenovo Legion 7i Pro (2025 Model) Pros:\n\nMore metal in the chassis\n\nFull-size keyboard with a numpad\n\nBetter reliability better overall customer service and warranty option.\n\nCons:\n\nThermals: Might run slightly warmer the Scar ? Less future proof : Slower Secondary SSD Slot: Only one M.2 slot supports PCIe Gen 5; the second is Gen 4. Lacks a Windows Hello camera and only has Thunderbolt 4 ports (not 5).\n\nI'm really torn. The SCAR seems to win on paper on future proofing and specs but I think loses on reliability against Legion’s reliability and consistent good performance I just hate that it’s not as futureproof as the SCAR",
    "Reddit: 1 Month Review for the Lenovo Legion 5 15AKP10\nThis is meant to be more a buyer's guide on the laptop and what you should expect from it. This is purely based on my opinions and observations from using the laptop. \n\nThe model is the Legion 15.1” Ryzen 7 AI 350 with a 5070. It came originally with 16gb of ram, but added another stick of 16 to make 32gb.\n\nI would recommend if possible go for the pre-built models instead of the customizable models. Purely on the wait times for the customizable model, seemingly lasting more than a month, even if it says otherwise.\n\nI paid $1,260 for the model that I got. Before taxes, the laptop cost $1,157. To get that price, I used 2 of the promotions that they had going on, as well as the student discount that Lenovo offers. I did pay $50 for the extra ram so that will increase the overall cost of the laptop.\n\nThe battery life on the laptop, I would say is the weakest link for this laptop. On average when unplugged I see closer to 4 and half hours. I will add that I have the battery being limited to 80% of its charge to save overall health. \n\nThe 5070 is more than capable to play practically any game you throw at it. The only game that really works the GPU is the Witcher 3 in the highest settings and Cyberpunk when you start to enable raytracing features. I will admit if you are paying the normal price for a 5070 laptop, it is a bad deal for what you are getting. In the future, it will more than likely be a problem for triple AAA games, due to the limited 8gb vram.\n\nThe CPU for what I have used it for is alright. I wouldn't call it anything special. It does its job and I respect it for that.\n\nThe OLED screen is an aspect of the laptop that really shines. A real upgrade coming from an IPS screen. \n\nYou will want to upgrade the ram if it already doesn't come with 32gb and add more storage for the laptop. As of me writing this, I know that ram prices are garbage, so maybe take the upgrade at a later date.\n\nThe build quality has been really good. I haven't had any issue with the laptop so far. I do know that it has only been a month.\n\nIf there are any questions, feel free to ask in the comments, and I'll try to get to them.",
    "Reddit: “Microsoft and Asus open Xbox Ally preorders — the X costs $999” - The Verge\nROG Xbox Ally X $999.99\n\nROG Xbox Ally $599.99\n\n\n“Today, Microsoft and Asus are officially opening preorders for the ROG Xbox Ally and ROG Xbox Ally X at $599 and $999 respectively in the US. They’re $799 CAD and $1299 CAD in Canada, €599 and €899 in Europe, £499 and £799 in the UK, and $799 AUD and $1599 AUD in Australia. They both ship October 16th.\n\n(In the United States, the Xbox Ally X will be exclusive to Best Buy, the Asus Shop, and Microsoft; the Xbox Ally is going wider at Amazon, Best Buy, Walmart, Microsoft, the Asus Shop, and Ant Online.)\n\nThere’s a few different ways to look at those prices. If you’re used to console pricing, Microsoft’s first Xbox handhelds are not cheap! Even the vanilla white Xbox Ally costs $150 more than a Switch 2, which was itself criticized for price, and it costs $100 more than a far more powerful Xbox Series X did at launch in the US, Microsoft’s new Xbox price hike notwithstanding. In Europe and the UK, the weaker of the two Allys costs the same as an Xbox Series X.\n\n\nBut you can’t play that Xbox in a passenger seat. And if you’re a PC gamer, or want to be, things look a bit rosier. These “Xbox” handhelds will be the first with a new build of Windows that hides the desktop and Explorer shell, frees up gobs of memory for your games, and (hopefully) lets you navigate solely by controller.\n\n\nHandhelds have unfortunately been getting pricier and pricier anyhow, to the point flagship ones now cost as much as gaming laptops. At $999, the Xbox Ally X might compare well to the $999 MSI Claw 8 AI Plus or the $1,349 Lenovo Legion Go 2 that offers the same AMD Z2 Extreme chip you’ll find here — particularly because my colleagues and I agree the new Allys have one of the most comfortable designs we’ve held. (In summary: Prongs rock.)\n\n\n\nJust know you’re getting a wildcard if you opt for the $599 Ally, as it contains a never-before-seen Ryzen Z2 A processor that’s much more like the chip in the Steam Deck. Instead of 8 Zen 5 CPU cores and 16 RDNA 3.5 GPU cores designed to run between 15 and 35 watt TDP, you’re getting 4 Zen 2 CPU cores and 8 RDNA 2 GPU cores designed to run between 6 and 20 watts for lower performance gaming.\n\nWe’re planning to have reviews of the Xbox Ally and Xbox Ally X in the coming weeks.\n\nMicrosoft says they’ll be available in Australia, Belgium, Canada, Czech Republic, Denmark, Egypt, Finland, France, Germany, Greece, Hong Kong, Hungary, Indonesia, Ireland, Italy, Japan, Mexico, the Netherlands, New Zealand, Norway, Poland, Portugal, Republic of Korea, Romania, Saudi Arabia, Singapore, Slovenia, South Africa, Spain, Sweden, Taiwan, Thailand, Turkey, Ukraine, United Arab Emirates, United Kingdom, United States, and Vietnam — and will additionally come to Brazil China, India, Luxembourg, Malaysia, Philippines and Switzerland.”\n\nYes I know this is about steam deck, but we all want to discuss this",
    "Reddit: Is this Lenovo Legion 5 worth it for this price?\nAhoy!\n\nI am about to buy a new laptop and I wanna know if this is worth it for the price with it's current specs. I'd prefer 1TB of SSD, but I saw that this laptop may have additional slot available for future m.2 storage so I can deal with it.\n\nI plan on playing steam/GOG/Epic Games on it and using it with my video editing software. I'll be playing indie games mostly, but also big titles like GTA and Cyberpunk. I don't mind turning down in game settings, I just want to be able to run games.\n\nAny advice is helpful, even other laptop recommendations are helpful.\n\nThank you in advance!\n\nLink: [https://www.microcenter.com/product/698178/lenovo-legion-5-15ahp10-153-gaming-laptop-computer-eclipse-black#tab-reviews-bm](https://www.microcenter.com/product/698178/lenovo-legion-5-15ahp10-153-gaming-laptop-computer-eclipse-black#tab-reviews-bm)\n\nEdit: I did pull the trigger on it that same day! I like it so far, I mostly removed bloatware and played some Cyberpunk 2077 on it. Ran very well. I'm still new to things so I haven't put it fully to the test\n\n  \nEdit/Update: Had this laptop for 2 months now. I really like it, plays Cyberpunk 2077 and The Sims 4 very well. I do wish it was a bit brighter, and also invest in a microfiber cloth as this holds on to every finger smudge on the keyboard, case, and mouse trackpad. I've only edited my YouTube videos using online tools like Canva so far, but I'll update if it can handle things like Da Vinci once I try them out.",
    "Reddit: Stick with legion 5 or pay more for hp omen max\nSo about 2 weeks ago I got the Lenovo Legion 5 amd 5060 1tb ssd for $1180 after tax. When I grabbed it immediate thoughts was the oled screen is beautiful but damn the reflective feels like a mirror if the lighting isn’t perfect. The sound was horrible and don’t understand the placement of the speakers being on the bottom(although I was comparing to my life’s Mac that’s about 5 years old).\nGames played well, the benchmarking was about middle of the road for the cpu and Gpu I got. For the price I felt happy but I noticed a microcenter just opened (the phx one) and since I have a few weeks window for a return I found that the hp omen max is on sale for $1799 before tax.\n\nThe perks is it has double the ram, noticed cost of ram went up buying on its own which is value ( I intended to grab another stick and possibly ssd for the Lenovo when I see a sale).\n\nThe screen is (on paper) not as pretty as a oled but maybe it’s not that bad (and a inch bigger at 16 which I can appreciate)\n\nA better cpu I think and let’s not forget a glorious 5080 with that 16gb of vram.\n\nI want this to be my main gaming setup, I’m tired of being stuck to my office and want to game in the living room while my wife watches her shows etc. \n\nThink battlefield 6, cyberpunk 2077 etc..\n\nI also am starting to develop games as a hobby if this changes anything\n\nI like price to performance from the legion, but I think this omen max might be worth it (although can’t find a solid review that looks at the amd version as most received the hp omen max intel that is getting a lot of praise..)"
  ],
  "count": 25
}