{
  "product": "LENOVO Legion 5 15IRX10",
  "reviews": [
    "Reddit: Lenovo LOQ 15IRX10 Unbiased Review - Still The Best Budget Friendly Gaming Laptop?\nGot my hands on the RTX 50 series [Lenovo LOQ ](https://www.amazon.com/Lenovo-LOQ-15IRX10-i5-13450HX-Backlit/dp/B0FNN465T6?crid=39HQ8VG01A7EE&amp;amp;dib=eyJ2IjoiMSJ9.JXI3BB9a2R7mIigTvzfDhPP7kb_GzWTmWWRO-MOU4xKn0k4lHx7l9wQA7mIvXPhKB5UxlQS8U1ss12edmyJd8Fd2pFf2jTRNryBxvR2QrDFv-H2eQeL_6NbWK3BkS_JP9eIu6D_gS8xhY2IyGUCRbWn3AVybDpjBavEedXQ4WF8Sm1XzULG6qRPpEo4OZQTeCWlHqPf4mIuzerTl7R0wnW9pRxqj1RCEZ1YSX9-n1Go.Jxk5Hum3PluTAEyXJ6F9btlSeDymGWRGestgNu5ptYg&amp;amp;dib_tag=se&amp;amp;keywords=lenovo%2Bloq&amp;amp;qid=1759686369&amp;amp;sprefix=lenovo%2Bloq%2Caps%2C96&amp;amp;sr=8-2-spons&amp;amp;sp_csd=d2lkZ2V0TmFtZT1zcF9hdGY&amp;amp;th=1&amp;amp;linkCode=ll1&amp;amp;tag=taohid0f-20&amp;amp;linkId=6b1ab50554dfae8958603caf3df6197f&amp;amp;language=en_US&amp;amp;ref_=as_li_ss_tl)and ran some tests on it at my workplace, I know the Lenovo LOQ is regarded as the best budget friendly gaming laptop, so heres a informational review about it. Keep in mind I put in whatever info I think were useful and not all, so feel free to ask questions below :)\n\n# TL:DR \n\nIf you can get it for a similar price or lower than the current one I linked, it is still the **BEST** budget friendly gaming laptop. Much better thermals than competitors, build quality is not as bad. But it has horrible battery life (expected) and pretty heavy. \n\n# Quick Specs (unit tested)\n\n* CPU: Intel Core i5-13450HX (4 P-cores + 8 E-cores, Turbo multi up to \\~4.6–4.8 GHz)\n* GPU: NVIDIA GeForce RTX 5050 Laptop\n* RAM: 16 GB DDR5 (single stick or dual-channel depending on the unit)\n* Storage: 1 TB NVMe SSD\n* Display: 15.6\" FHD (1920×1080) 144 Hz IPS, matte finish\n* Extras: Backlit keyboard, decent port selection, bundled laptop cooler (bundle)\n* Chassis: Mostly plastic / mixed materials, thicker design typical for budget gaming\n\n# Benchmarks (my runs + what’s realistic)\n\nThese are approximate based on my tests and expectations for this hardware class:\n\n* **Cinebench R23 Multi**: \\~11,500 pts\n* **Cinebench R23 Single**: \\~1,950 pts\n* **Geekbench 6 (Multi)**: \\~9,000\n* **Geekbench 6 (Single)**: \\~2,200\n* **3DMark Time Spy (Graphics Score)**: \\~5,500 – 6,500\n* **PCMark 10 (Overall)**: \\~5,200\n* **Battery (mixed use)**: \\~3–5 hours (web, docs, light gaming off plugged in)\n\nThese numbers are modest compared to high-end gaming rigs, but acceptable for 1080p competitive play and general use.\n\n# Performance (Real-world Impressions)\n\n# Gaming\n\nI tested a handful of modern titles:\n\n* *Valorant / CS2*: Easily 200+ FPS on high settings, 144 Hz fully usable. 300+FPS On Comp Settings\n* *Shadow of the Tomb Raider*: High preset (\\~1080p) gave \\~80–100 fps.\n* *Cyberpunk 2077*: On medium / DLSS / RT off, got \\~50–65 fps in many scenes—playable but with compromises.\n* *Assassin’s Creed Mirage / other open-world*: \\~60–80 fps on balanced settings.\n* *Fortnite (Performance Mode):* Easy stable 144FPS through out\n\nOverall, the RTX 5050 isn’t a monster GPU, but it’s decent for 1080p gaming with some settings trimmed. It handles esport titles extremely well, and can manage modern AAA titles if you accept some lowering in effects or quality. The 144 Hz panel is appropriate for its performance range.\n\n# Productivity / Everyday Use\n\nBrowser tabs, VS Code, streaming, office work – all felt smooth. The i5-HX CPU handles multitasking well, though putting too many heavy apps + games at once will saturate 16 GB and cause occasional stutters. The SSD is fast for everyday loads and large transfers, though sustained copy tasks will warm it up.\n\n# Thermals &amp;amp; Noise\n\n* Idle / light use: fans are mostly off or extremely quiet.\n* Under load (gaming or benchmarking): the fans ramp up to audible levels (but not screaming).\n* Surface temps: the keyboard area warms under load, especially near the top row, but palm rests remain usable. Under prolonged stress, underside hotspots (\\~45–50 °C) appear.\n* Throttling: I saw modest frequency drops when pushing both CPU + GPU hard for extended periods also expected in this class.\n\nThe bundled cooler in the bundle helped drop temps a few degrees and keep fan noise lower during long sessions, so it’s a worthwhile addition here.\n\n# Battery Life\n\nBattery is not the strong suit (common in gaming laptops). In mixed use (web + light gaming) I got **\\~3–5 hours**. In full gaming mode, battery drops rapidly (1–2 hours max). Plugging in is necessary for serious gaming. Lowering screen brightness helps a bit.\n\n# Display &amp;amp; Build\n\nThe 15.6\" 144 Hz IPS panel is solid for the price: decent color and smooth motion. Not wow-level (not IPS-OLED or high brightness) but entirely serviceable. The matte finish helps indoors. For competitive gaming it works well; for color-critical creative tasks it’s average.\n\nBuild feels “budget-gamer”: thicker plastic chassis, some flex in the lid and keyboard deck. Hinges are acceptable. The keyboard has decent travel and feedback for this tier, and the backlight helps in low light. Trackpad is usable but nothing fancy (plastic surface). The design is more utility than style.\n\nPorts were adequate (USB-A, USB-C, HDMI, Ethernet, audio) — enough to connect a monitor, external drive, etc.\n\n# Comparisons\n\n* [ASUS TUF A14](https://www.amazon.com/ASUS-Gaming-Copilot-Laptop-WQXGA/dp/B0DZQHB8S5?crid=TTZMP9O2DKP6&amp;amp;dib=eyJ2IjoiMSJ9.rTflZLBJjbJ_RxBMQ5nZm9EAPchU0DwyULsI48n5xSsnADybkabMsbY9646Td5VJZPIIxvXOxVrBaGLyHxJHQv8r9NhU1y3gXGM8vUd4fmMEn7A3-AwEPc2ijmdrw5dxTSOm0VO2cO4W3nJOZjgVdQJGjuYXU4loZ-qZ_muDawjMGRmRb579PF8_Z9_VUM8-4D2kvuZca_aiE1-mUxuvGnP10CQAaTxE2f9zt3toYbw.WStf93bYTHvf19hr2Jh7riqZV5VLoC6Mh7wSTYrMy-w&amp;amp;dib_tag=se&amp;amp;keywords=asus+tuf+a14&amp;amp;qid=1759687237&amp;amp;sprefix=asus+tuf+a14%2Caps%2C108&amp;amp;sr=8-3&amp;amp;linkCode=ll1&amp;amp;tag=taohid0f-20&amp;amp;linkId=d6f4ef4e28210a7f68ebfc1044ce1a87&amp;amp;language=en_US&amp;amp;ref_=as_li_ss_tl): Much better battery life (10 hours), worser cooling but better build quality\n* [Acer Nitro 16](https://www.amazon.com/acer-Nitro-IPS180Hz-Display-Graphics/dp/B0FSQ2MZFK?crid=2Z9XAG3XMD0PH&amp;amp;dib=eyJ2IjoiMSJ9.FoEtgdZ-17a8_SycXEwRUmhyWyPad-pO-B9AhfeZ3tou9yrxLfqEGemrvtWFN8dPbB2CXWiKeYsdCRV5wNzqsxToyU-W3P94ZjJeOCaMIAkt9dCIWS0W3COrQKrc1SxHYACKxs8RRzvA1JsM_yBANoEZ5FmCNgT1xHYzhRbQpl_D1ElaTi5CmnvbGOWbCccjYSAMAku4uEz_Zhbl5EYAKl55snQSIUjCccK9aWthzXA.XUiG-ZOy3kmNAfsI2t0IvDArxxGHYnNfywsBoP32n30&amp;amp;dib_tag=se&amp;amp;keywords=acer%2Bnitro%2B5%2Brtx%2B5050&amp;amp;qid=1759687102&amp;amp;sprefix=acer%2Bnitro%2B5%2Brtx%2B5050%2Caps%2C93&amp;amp;sr=8-1&amp;amp;th=1&amp;amp;linkCode=ll1&amp;amp;tag=taohid0f-20&amp;amp;linkId=acca023be983bae67e1e1b15733d8a4d&amp;amp;language=en_US&amp;amp;ref_=as_li_ss_tl)**:** Bit better cooling since it has more space, similar performance. Worser build quality and system management software.\n\n# A Potentially Better Choice\n\nIf you can push your budget a bit, I would highly suggest going for the[ Lenovo Legion](https://www.amazon.com/Lenovo-Legion-Notebook-GeForce-Eclipse/dp/B0FGGBBYK7?crid=3NY9IKQT28O6Z&amp;amp;dib=eyJ2IjoiMSJ9.mTi9eJgjmema6Qe8FaCHYTRLJTFH8cUQKq25PFAgnlz6zEqYvy-7mgwQqj2upPrHQ3a12CnHW9dIOx1_feUmtmxGoqTzhrM2OzjAuKrGpxWpbh4kGjF5cm7-9T4ZdrcTdZOnddiWPauKmSui9F3SWplCeC_JWtA40QAP3ThlmV4kYjHqyQqq1zbXn_hUdELuS0yhWUgeclW_uDkwjuP-TQ5ImOPojfesrvugwqymzc8.fYLgOWP90ArwWGF-E4s7D_1j5AAWx8dCBDpvIYGvajM&amp;amp;dib_tag=se&amp;amp;keywords=rtx+5060+laptop&amp;amp;qid=1759686877&amp;amp;sprefix=rtx+5060+laptop%2Caps%2C153&amp;amp;sr=8-3&amp;amp;linkCode=ll1&amp;amp;tag=taohid0f-20&amp;amp;linkId=e31dd311a2fc005f3225e98da808c98b&amp;amp;language=en_US&amp;amp;ref_=as_li_ss_tl) instead, much better performance+screen+thermals. \n\nAlternatively, check **ASUS TUF / ROG / MSI gaming laptops** in the same price range with better thermal designs or stronger GPU options. You might trade off battery or weight but get better sustained fps.\n\n# Pros and Cons\n\n**Pros:**\n\n* Good 1080p/144 Hz gaming performance for the price\n* Good everyday responsiveness and multitasking\n* Bundled cooling pad helps thermal behavior\n* Solid port selection\n* Competent build for budget (mostly serviceable)\n\n**Cons:**\n\n* Build is plasticky and flexy compared to premium laptops\n* GPU / CPU combo is limited for future AAA (you’ll need to dial settings)\n* Battery life is weak\n* Thermals under load produce heat and some throttling\n* Display isn’t exceptional — decent but not color-accurate or high brightness\n\n# Tips for Buyers\n\n* Immediately **Use**[ CTT Debloat](https://christitus.com/windows-tool/)**, get rid of useless bloatware** (trust me it helps).\n* Use the bundled cooler — it helps in long sessions.\n* Set fan profiles to “Performance” or “Turbo” when gaming; use quieter mode for non-gaming.\n* Consider upgrading RAM (if slot available) to dual-channel (if not already) for better GPU performance.\n* Keep BIOS/firmware/driver updates current, sometimes performance/thermal improvements come via updates.\n* Thermal Repaste every 1-2 years.\n\n# Overall\n\nThe [Lenovo LOQ 15IRX10](https://www.amazon.com/Lenovo-LOQ-15IRX10-i5-13450HX-Backlit/dp/B0FNN465T6?crid=39HQ8VG01A7EE&amp;amp;dib=eyJ2IjoiMSJ9.JXI3BB9a2R7mIigTvzfDhPP7kb_GzWTmWWRO-MOU4xKn0k4lHx7l9wQA7mIvXPhKB5UxlQS8U1ss12edmyJd8Fd2pFf2jTRNryBxvR2QrDFv-H2eQeL_6NbWK3BkS_JP9eIu6D_gS8xhY2IyGUCRbWn3AVybDpjBavEedXQ4WF8Sm1XzULG6qRPpEo4OZQTeCWlHqPf4mIuzerTl7R0wnW9pRxqj1RCEZ1YSX9-n1Go.Jxk5Hum3PluTAEyXJ6F9btlSeDymGWRGestgNu5ptYg&amp;amp;dib_tag=se&amp;amp;keywords=lenovo%2Bloq&amp;amp;qid=1759686369&amp;amp;sprefix=lenovo%2Bloq%2Caps%2C96&amp;amp;sr=8-2-spons&amp;amp;sp_csd=d2lkZ2V0TmFtZT1zcF9hdGY&amp;amp;th=1&amp;amp;linkCode=ll1&amp;amp;tag=taohid0f-20&amp;amp;linkId=6b1ab50554dfae8958603caf3df6197f&amp;amp;language=en_US&amp;amp;ref_=as_li_ss_tl) is a solid entry-to-mid gaming laptop. It’s not going to crush every title at ultra, but for most 1080p gaming it delivers good fps, especially in esports or mid-tier titles. It handles day-to-day use well too. The real trade-offs are build, battery, and performance ceiling. If your priority is “good gaming performance without going into premium prices,” it’s one of the better picks in the budget/mid tier.\n\n*(Heads up: This post has amazon affiliate links. If you buy through them, I will get a small commission , doesn’t cost you extra. Helps support the time I put into testing and writing these reviews, so I appreciate it)*\n\nAnd please **upvote** this if you think it was helpful :) If you have any questions lmk!",
    "Reddit: Lenovo Legion 5i 15IRX10-965 15.1\" Eclipse Black 14900HX RTX 5070 1.799 € it is worth it?\nHello guys!\n\nI'm thinking about buying this laptop for $1,799.\n\nI missed out on the Legion 5 Ryzen 7 260 RTX 5060 for €1,499, and now only this Intel one is available.\n\nI need a laptop, so I'm thinking about buying one soon, but I'm wary of this Intel CPU because it gets hot and because of the reputation of Intel 13 and 14-inch chips, and because of Intel's reputation these days.\n\nI had a Legion Slim 5 14 OLED and loved it. I paid €1,349 for it last year, but I sold it because I wanted to build a gaming PC. It turned out I didn't use the PC as much as I wanted, so I sold it and now I need a laptop to buy and keep for a long time.\n\nI couldn't find any battery life tests for this laptop with this i9; YouTube reviews almost always feature the Intel Ultra 255HX. I'm unlikely to use the battery for many hours, as it's almost always plugged in, but I also didn't want to buy a laptop that would get too hot, etc.\n\nWhat do you think?\n\nThis model, assembled on Lenovo's website, costs 100 € less today, with a 9% discount.\n\nThank you very much!\n\nObs:\n\nThis model dont have Windows Hello that I think I will miss, but can survive with PIN.\n\nThunderbolt and USB 4 too, but this I wont use. I will install my two SSD's inside, an 2 TB Samsung Pro 990 and an Crucial 4 TB...\n\n[Portátil Lenovo Legion 5i 15IRX10-965 15.1\" Eclipse Black | PCDIGA](https://www.pcdiga.com/computadores-e-software/computadores-laptop/computadores-portateis/portatil-lenovo-legion-5i-15irx10-965-15-1-eclipse-black-83ly009bpg-199271076965)",
    "Reddit: Lenovo Legion 15IRX10\n\nIm in search of a laptop which can handle graphics design work / wed design alongside light gaming, titles such as DBD, The Sims 4 and such.\n\ni have been eyeing this legion for a while and was interested in seeing other peoples opinion \n\nprice is $1340",
    "Reddit: If you bought a laptop with an i9-14900HX or this motherboard you should read this\n\nI am NOT an expert or even intermediate with computers, so if any of this information is incorrect, please forgive me. I do, however, believe it is straight forward:\n\nI’m posting this because there is now enough evidence to show a significant issue with the 2024 Predator Helios Neo 16 (PHN16-72) and other laptops using the i9-14900HX. If your machine is currently failing or even if it’s still working fine.\n\nIntel has officially admitted to a product defect known as Vmin Shift Instability affecting 13th and 14th Gen processors. This was confirmed by Intel as a root cause of instability that leads to **permanent hardware damage**. While the focus was initially on desktops, reports from users show that the i9-14900HX which is a high-voltage mobile chip is hitting voltage spikes as high as 1.54V right before crashing, which is consistent with the desktop failures. \n\nYou can see Intel's official root cause announcement at this link: https://community.intel.com/t5/Processors/Intel-Core-13th-and-14th-Gen-Desktop-Instability-Root-Cause/m-p/1633442 and a report from The Verge confirming the damage is permanent here: https://www.theverge.com/2024/7/26/24206529/intel-13th-14th-gen-crash-raptor-lake-root-cause-microcode-update-permanent-damage\n\nAcer appears to be acknowledging this as a hardware issue. In community discussions, Acer support teams have been reviewing troubleshooting logs that show these voltage spikes and have moved to authorize full motherboard replacements as a standard warranty service. However, the problem for owners right now is the repair process. Service centers globally are reporting indefinite backorders for these 2024 boards. It seems the industry is transitioning to newer architectures, leaving the replacement parts for these defective units in very short supply. There is a discussion about these motherboard delays on the Acer community site here:\n https://community.acer.com/en/discussion/729034/mainboard-replacement-for-phn16-72-delayed-for-nearly-2-months-what-should-i-do\n\nThese posts are numerous. This is just ine example.\n\nIf your laptop is still working, you should be aware that Intel’s patches only prevent future damage and they cannot fix hardware that has already begun to degrade. Since Acer has acknowledged the need for motherboard swaps in these cases, and since parts are becoming increasingly extinct, you are in a critical window. If you wait until the machine completely breaks to file a claim, you may find yourself stuck in a 2-month backorder loop with no working computer. If you notice even minor instability or WHEA errors in your logs, you have a much stronger case for a product exchange now while the manufacturers are still processing these claims.\nI am curious if anyone has actually received a working 2024 i9 motherboard replacement recently, or if we are all just waiting for parts that are no longer being made.\n\nThese are the laptops affected by the issue, with similar patterns of failure:\n\n**ASUS: ROG Strix G16 (2024/2025) and ROG Strix G18 (2024).**\n\n**​ASUS: ROG Strix SCAR 16 and SCAR 18 (2024 models).**\n\n**​Lenovo: Legion Pro 7i (Gen 9) and Legion 5i (Gen 10 / 15IRX10).**\n\n**​Alienware: m18 R2 and m16 R2.**\n\n**​MSI: Raider GE78 HX and Titan 18 HX.**\n\n**​MSI: Katana 15 HX and Katana 17 HX (B14W series)**\n\n**​HP: Omen 16 and Omen 17 (2024/2025 Intel versions)**??\n\n**​Acer: The Predator Helios 16 (PH16-72) and the Helios 18 (PH18-72).**\n\n**Edit:** I found out there are class action lawsuits regarding the issue with intel, and took this off the website for one of them.\n\n\"Intel has not offered to compensate consumers to remedy their damages, instead Class Members are asked to download a “patch”, which will dramatically degrade the CPUs’ performance and slow their electronic devices down by between 5% to 30%.\"",
    "Reddit: I asked my parents for a legion 5 pro with rtx 5070 ti, got this instead\n**EDIT: i am grateful of this laptop, not ungrateful. Please keep that in mind before commenting hate. Some people got it wrong.**\n\nI genuinely don’t think i could be happier, since i never thought id get such a powerful laptop. Big upgrade from my legion 5 pro rtx 4070.\n\nHonest review after 2 weeks, id say it performs quite well.\n\nAround 40-70 fps on red dead 2 on ultra graphics, can stutter a bit\n\nTemps i’ve not seen risen over 75 degrees celsius on cpu, gpu stayed around 65 celsius\n\nBeamNG.Drive also performs extremely well on ultra graphics, 60 fps with traffic, seems good because the game is in Alpha and is yet not that optimized\n\nNo cons. Im also surprised it has facial recognition aswell. Thats something new for a gaming laptop, havent seen it before\n\nOtherwise a great laptop, if you have any questions let me know.\n\nI’m also looking for good steam games like red dead 2, if you have any suggestions i’m open about them",
    "Reddit: Akhirnya upgrade laptop setelah 7 tahun. Tolong review apakah rencana beli aksesoris2 berikut worth atau tidak\nLaptop terakhir MSI GL62M atau apa gitu, yang 1050ti. Selama pake gapernah ada keluhan apa2. Main game juga bukan yang incer spek hajar kanan, tapi belakangan mulai berasa perlu upgrade, jadilah skrg beli Lenovo Legion 5 15IRX10.\n\nKarena jarang banget upgrade laptop jadi lagi honeymoon phase mau disayang2 nih. Berikut list aksesoris2 yang mau dipasang, kalau ada komentar atau tips boleh share ya. Misalnya ada yang ga worth, atau mungkin ada aksesoris yg penting tapi belum didaftar gitu.\n\n-Cooling pad Memo FL08. Sebelumnya gw penganut stand rangka aluminum doang, no kipas. Tapi skrg muncul yang pakai gimmick sealed air flow kayak Llano V12 (dan versi murahnya Memo FL08 ini). Intakenya juga ada filter debu jadi cobain deh. Makan tempat jirr wkwk\n\n-Upgrade RAM dari 16GB ke 32GB. Kaget juga Win11 idle aja udah makan ram 4GB sendiri. Itu udah buang semua bloatware dan matiin background process dari app2 bawaan padahal.\n\n-Pasang SSD tambahan 1TB. Rencananya storage bawaan yang 512GB jadi buat OS dan program2. SSD baru 1TB nanti buat isi media, game, dll.\n\n-Dust plug silikon. buat nutup2 colokan yg belum dipakai\n\n-Mouse sama keyboard terpisah.\n\n-USB Hub 3.0. Rencananya buat colok keyboard sama gamepad biar rapi dari 1 lobang aja. Tapi kalau udah colok keyboard, gamepad gitu masih bisa colok HDD lagi ga ya?\n\nApa lagi ya kira2 aksesoris yg worth? buat audio gw pake TWS bluetooth aja. Cover silikon buat keyboard kayaknya ga butuh ya, malah bakal bikin panas kayak selimut gitu.\n\nKalau ada tips buat yg mau pasang RAM/SSD upgrade sendiri boleh share juga, dari kemarin nontonin video tutorial kayaknya bisa sih tapi masi nervous wkwk.",
    "Reddit: ThinkPad or Legion for continuous use every day?\nI'm currently looking for a replacement for my current laptop that has lasted 10 years and would appreciate some recommendations about what is the best purchase to make for my use case.\n\nThe laptop will be exclusively plugged in for 12-18 hours each day for web browsing, streaming media and occasional gaming (like Balatro, Backback Battles, Darkest Dungeon, Megabonk) so I am trying to find the best balance of good thermal management, low noise emissions and a suitable screen for long sessions. Longevity is important as I'd like to avoid spending an exorbitant amount of money every few years due to where I live.\n\nThinkPads were the most common suggestion I saw when looking for longevity. I'm not 100% sure on how effective cooling will be after being on for most of the day and how they will manage the less intensive games with their iGPU so I also looked into gaming laptops.  \nI was looking at AMD models originally due to what I've read about heat and recent issues but Intel has more options with 100% sRGB IPS screens.\n\nWhich specific model and CPU/GPU would you recommend out of this list? They are all 32GB + 1TB.  \nThe prices (NZD) will seem excessive due to the regional price difference but these are the cheapest I've found based on what is recommended. Lenovo NZ has a number for special deals so I can try and see if they'll give me more of a discount.\n\n**ThinkPad E16 G3 Intel**\n\n^(Intel Ultra 5 225H) **^($1,975.23)** ^(or Intel Ultra 7 255H) **^($2,365.11)**  \n^(16\" WQXGA 2560 x 1600, IPS, 100%sRGB, 400 nits, 120Hz)  \n^(Intel Arc 130T / Intel Arc 140T)  \n^(Intel Wi-Fi 6E AX211 2x2 AX)\n\n\\- AMD is 45% NTSC only. Is the E series likely to last?\n\n**ThinkPad T16 G4 AMD or Intel**\n\n^(AMD Ryzen AI 5 PRO 340) **^($2,461.55)** ^(or AMD Ryzen AI 7 PRO 350) **^($2,580.04)**  \n^(16\" WUXGA 1920 x 1200, IPS, 100%sRGB, 500 nits, 60Hz, Low Power)  \n^(Radeon 840M / Radeon 860M)  \n^(MediaTek Wi-Fi 7 MT7925 2x2 BE)\n\n^(Intel Ultra 5 225H) **^($2,489.41)** ^(or Intel Ultra 7 255H) **^($2,901.23)**  \n^(16\" WUXGA 1920 x 1200, IPS, 100%sRGB, 500 nits, 60Hz, Low Power)  \n^(Intel Arc 130T / Intel Arc 140T)  \n^(Intel Wi-Fi 7 BE201 2x2 BE)\n\n\\- I see the T series recommended more as they are robust but it lacks the WQXGA and higher Hz screen. Not sure on the difference in cooling.\n\n**Legion 5i (15IRX10)**\n\n^(13th Generation Intel i7-13650HX) **^($2,489.00)**  \n^(15.3\" WUXGA 1920 x 1200, IPS, 100%sRGB, 300 nits, 165Hz)  \n^(RTX 5050 Laptop GPU 8GB GDDR7 or 5060) **^($2,589.00)** ^(or 5070) **^($2,849.00)**  \n^(Wi-Fi 6 802.11ax 2x2)\n\n\\- AMD is OLED only. Going from a 17.3\" to a 15.3\" after 10 years might be a bit of a shock.\n\n**Legion Pro 5 (16ADR10)**\n\n^(AMD Ryzen 9 8945HX) **^($3,199.00)**  \n^(16\" WQXGA 2560 x 1600, IPS, HDR 400, 100%DCI-P3, 500 nits, 240Hz, Low Blue Light)  \n^(RTX 5070 Laptop GPU 8GB GDDR7)  \n^(Wi-Fi 7 2x2 BE 160MHz)\n\n\\- Can only find one detailed reviewer with this CPU so I can't compare temp and noise emissions. Idles at 20-30w.",
    "Reddit: Help deciding between these\nIrrespective of any price differences, which one would be most recommended? \n\n1: HP Victus 15-fb3106AX\n\n2: Lenovo LOQ 15AHP10\n\n3: Lenovo Legion 5 15IRX10\n\n4: ASUS Vivobook Pro 15 OLED N6506CU",
    "Reddit: Which do you guys recommend I should get?\nI am looking for an upgrade on my old laptop from 2019. While researching, i really liked lenovo legion's reviews and decided to look for offers.\n\nHere are three that i'm considering after going through stores today. Would like to hear from you which I should get as the specs and all that are confusing me.\n\nI just want the one with the best performance out of the three, both in terms of gaming and doing productive stuff like cad software, gis, streaming, editing, etc. I believe all three can, but i just want to know which among them does it the best.\n\nSomething to note, as far as I know all three's storage and ram are upgradeable so I'm probably going to go 2 tb, 32 gb ram someday so yeah.\n\nHere are the three choices:\n1. Image 1 is Legion 5 15IRX10 (2025), specs are:\n&amp;gt; Processor: Intel i7 - 13650hx\n&amp;gt; GPU: rtx 5060 8gb vram\n&amp;gt; Ram: 24 gb DDR5 4800\n&amp;gt; Storage: 1 tb ssd \n\n2. Image 2 (after searching online) is LOQ 15IRX10, specs are:\n&amp;gt; Processor: Intel i7 - 14700hx\n&amp;gt; GPU: rtx 5060 8gb vram\n&amp;gt; Ram: 24 gb DDR5 4800\n&amp;gt; Storage: 512 tb ssd \n\n3. Image 3 is Legion pro 5, specs are:\n&amp;gt; Processor: AMD R9-7945 HX\n&amp;gt; GPU: rtx 4060 8 gb vram\n&amp;gt; Ram: 32 gb DDR5 4800\n&amp;gt; Storage: 1 tb ssd",
    "Reddit: Choosing new laptop after 1 years, Please Lets come together and make share experience!\nHi all\n\nI have my head all spinning from looking at laptops and reviews, but i need som help choosing and want to hear your experience with your laptop and if you whould recomend it or not, and a few questions about each laptop that i am thinking of buying, maybe help others choose the rigth laptop too. Cause it seems like it is very hard to find a decent gaming laptop today compared to 10 years ago, i am not talking performance wise but build quality and material choise, the \"dont make it to good generations of greedy laptops brands\". Seems like no matter what you choose there will allways be a downside, Either you get a laptop that is DOA or soon after cause of low soldering temp or some other build quality error(Lenovo), or a heinge that break(ASUS TUF), or a brittle and overall bad build quality (Acer Nitro) or constant system error and pain in the ass software wise or bad screen with low response time ghosting or so bad bleeding of ligth on the screen. so it is hard today compared to 10 years ago.\n\nI am upgrading from a 10 years old Lenovo y700 with gtx 970m, outdated for sure, but still going strong no problems, i cleaned it and took care of it, but what i read and hear i should be happy with a new laptop that last half as long, but migth not even be working upon arraival...\n\nI am looking for a decent mid range laptop, keep in mind I live in Denmark so prices are very high compared to US, budget is not for a ti so i preffer 5070 and what is important is the build quality, buildt to last, temp as low as possible for longlivity, screen ips for longlivity and no glare like oled, lower reselution prefferd cause i cant see the difference on a 15\" and i rather have more fps, and no ghosting so a response time over 7ms is to much, dont want a fast framerate only to feel like mouse is lagging around, ram and storage dont matter cause i will upgrade my self. \n\nBlunt but usefull questions that can help many;\n\nwhat cpu is running coldest? Please write your cpu and what temp you have under idle and max load gaming?\n\nIs there any cpu that will bottelneck a 5070 today?\n\nwhat is the response time on LOQ screens 1080p and 1444p, cant find it?\n\nand also the Legion screen IPS 2k 2.5k response time?\n\nIs the LOQ DOA and motherboard frying/cpu low temp soldering issues Fixed in all the new 2025 gen? and or are the error contained in one or more modelse if so witch is safe and witch is not? or contained to a region/contry? Is there a way to test and get the problem to appear so that you can do it before warrenty expieres?\n\nIs the above questions also a thing for the Legion and Legion pro series?\n\nwhat experience do your have with these laptops I have chosen, that is within the price range of my budget mid range considering in Denmark a TI will cost the double off a 5070. Please write if you have any of these and what your experience is good bad and whould you recomend it, or if you have another Laptop that has no known problems and is in same price range as these 1500-1.800 USD \n\n  \nLegion laptops in budget range:  \n  \nLegion Pro 5 Gen 10 -16\" - 16ADR10 - price 11.343,36 kr  \n  \n\\-AMD Ryzen™ 9 8945HX-processor(2,50 GHz op til 5,40 GHz)  \n\\-NVIDIA® GeForce RTX™ 5070 bærbar computer-GPU 8GB GDDR7  \n\\-16 GB DDR5-5200MT/s (SODIMM)  \n\\-1 TB SSD M.2 2242 PCIe Gen4 TLC  \n\\-16\" WQXGA (2560 x 1600), IPS, refleksbehandlet, uden touch, HDR 400, 100 % DCI-P3, 500 nits, 240 Hz, dæmpning af blåt lys  \n  \nLegion Pro 5i - 16\" - 16IAX10 - price 10.999 kr  \n  \n\\-14. Gen Intel® Core™ i9-14900HX-processor (E-cores op til 4,10 GHz P-cores op til 5,80 GHz)  \n\\-NVIDIA® GeForce RTX™ 5070 bærbar computer-GPU 8GB GDDR7  \n\\-16 GB DDR5-5600MT/s (SODIMM)  \n\\-1 TB SSD M.2 2242 PCIe Gen4 TLC  \n\\-16\" WQXGA (2560 x 1600), IPS, refleksbehandlet, uden touch, HDR 400, 100 % DCI-P3, 500 nits, 240 Hz, dæmpning af blåt lys  \n  \n  \nLegion 5i Gen 10 - 15\" 15IAX10 - price - 11.826,34 kr  \n  \n\\-Intel® Core™ Ultra 7 255HX-processor(E-cores op til 4,50 GHz P-cores op til 5,20 GHz)  \n\\-NVIDIA® GeForce RTX™ 5070 bærbar computer-GPU 8GB GDDR7  \n\\-16 GB DDR5-5600MT/s (SODIMM)  \n\\-512 GB SSD M.2 2242 PCIe Gen4 TLC  \n\\-15,1\" WQXGA (2560 x 1600), OLED, blank, uden touch, HDR 600 Ægte sort, 100 % DCI-P3, 500 nits, 165 Hz  \n  \nLegion 5i Gen 10 - 15″ - 15IAX10 - price - 10.829,00 kr  \n  \n\\-13. Gen Intel® Core™ i7-13650HX-processor(E-cores op til 3,60 GHz P-cores op til 4,90 GHz)  \n\\-NVIDIA® GeForce RTX™ 5060 bærbar computer-GPU 8GB GDDR7  \n\\-16 GB DDR5-4800MT/s (SODIMM)  \n\\-512 GB SSD M.2 2242 PCIe Gen4 TLC  \n\\-15,3\" WUXGA (1920 x 1200), IPS, refleksbehandlet, uden touch, 100 % sRGB, 300 nits, 165 Hz  \n  \n  \nLOQ in budget range  \n  \nLOQ 15i Gen 10 -15\" - 15IRX10 - Price 9.174,99 kr  \n  \n\\-13. Gen Intel® Core™ i7-13650HX-processor(E-cores op til 3,60 GHz P-cores op til 4,90 GHz)  \n\\-NVIDIA® GeForce RTX™ 5070 bærbar computer-GPU 8GB GDDR7  \n\\-16 GB DDR5-4800MT/s (SODIMM)  \n\\-512 GB SSD M.2 2242 PCIe Gen4 QLC  \n\\-15,6\" WQHD (2560 x 1440), IPS, refleksbehandlet, uden touch, 100 % sRGB, 350 nits, 165 Hz  \n  \nLOQ 15 Gen 10 -15\" - 15AHP10 - Price 8.953,59 kr  \n  \n\\-AMD Ryzen™ 7 250-processor(3,30 GHz op til 5,10 GHz)  \n\\-NVIDIA® GeForce RTX™ 5060 bærbar computer-GPU 8GB GDDR7  \n\\-16 GB DDR5-5600MT/s (SODIMM)  \n\\-512 GB SSD M.2 2242 PCIe Gen4 QLC  \n\\-15,6\" WQHD (2560 x 1440), IPS, refleksbehandlet, uden touch, 100 % sRGB, 350 nits, 165 Hz  \n  \nASUS TUF Gaming A16  \n\\-AMD Ryzen™ 7 260 Processor 3.8GHz (24MB Cache, up to 5.1 GHz, 8 cores, 16 Threads  \n\\-NVIDIA® GeForce RTX™ 5060, 8GB GDDR7  \n\\-8 GB DDR5-5600 SO-DIMM  \n\\-1TB PCIe® 4.0 NVMe™ M.2 SSD  \n\\-16-tommer, 2.5K (2560 x 1600, WQXGA) 16:10 aspect ratio, IPS-level, Anti-blændingsskærm, sRGB:100%, Adobe:75.35%, Opdateringshastighed:165Hz, Response Time:3ms, G-Sync, MUX Switch + NVIDIA® Advanced Optimus  \n  \n  \nThanks all :)",
    "Reddit: Acer Nitro V 16S AI Unbiased Review - Is It Any Good?\nI have had a Nitro 5 myself for over 5 years and it ran like a beast, recently got the newer end model which is the[ Acer Nitro V 16S](https://www.amazon.com/Gaming-Processor-GeForce-Display-ANV16S-41-R2AJ/dp/B0F195W823?crid=2QANQ4COH4MDR&amp;amp;dib=eyJ2IjoiMSJ9.QlP95pi-vwC09vPSH01kVidvTsh20u1VdyDnGgw4pDWJzmMbn7eVIQ3QUPcGUjywZ7DBnO4B6Lb_PZiWi0VaJdzArPUdc_eCSflfu5Y0srAqOcfgccm36DI8FfxKvSnmuUkjqTVTBOYlWWxaJKkMQaHfoQ5VhRAmKHGo4yE1dV2ug0PvV-XCaNjwlHHYkv1m9ZHobhUbfsCIWNPYL_yoJge45uv2F-IGhwO3LMZZXno.mJElywLbr3ulUjB68Y-wmjZgm9iL7eme4YXyQSBnMq4&amp;amp;dib_tag=se&amp;amp;keywords=acer+nitro+5&amp;amp;qid=1759863380&amp;amp;sprefix=acer+n%2Caps%2C115&amp;amp;sr=8-13&amp;amp;linkCode=ll1&amp;amp;tag=taohid0f-20&amp;amp;linkId=a96c3f4a0ced9d7f96372471ff656721&amp;amp;language=en_US&amp;amp;ref_=as_li_ss_tl) AI at my workplace, and noticed it had a great sale as well so I wanted to do a review of it! Keep in mind this is all the info I though necessary so if you have any extra questions lmk below :)\n\n# TL;DR\n\nSlimmer than usual. Hard to beat for current price, great value-for-spec gaming laptop: solid 1080p / 1200p FPS performance, decent but fast display, and upgrade flexibility. But build quality, display color, and battery are where it shows its class. Not the best trackpad. If you're okay with those trade-offs, it's a solid pick.\n\nAlso I have heard a problem about this laptop not being able to charge itself when plugged in while gaming and the battery keeps draining which would tank performance, the model I had did not have this problem, even after long sessions. \n\n# Quick Specs \n\n* **CPU:** AMD Ryzen 7 260 (Zen 4 “Hawk Point”)\n* **GPU:** NVIDIA GeForce RTX 5060 Laptop (≈85 W TGP)\n* **Memory:** 32 GB DDR5 (dual-channel)\n* **Storage:** 1 TB PCIe 4.0 NVMe SSD\n* **Display:** 16″ IPS 1920×1200 (16:10), 180 Hz\n* **Battery:** \\~76 Wh (based on reviews)\n* **Ports &amp;amp; Connectivity:** USB-C, multiple USB-A, HDMI 2.1, Gigabit Ethernet, Wi-Fi 6E, etc.\n* **Chassis:** Mixed aluminum top + plastic bottom, but some models are fully plastic\n\n# Benchmarks / Performance\n\nHere are performance figures I gathered \n\n* **Shadow of the Tomb Raider (Ultra, 1200p):** \\~90 FPS average in tests with Ryzen 7 260 + RTX 5060.\n* **Cyberpunk 2077 (Medium):** \\~30–35 FPS at 1080p / 1200p in published reviews. \n* **Far Cry 6 (Ultra):** \\~82 FPS 1080p in tests. \n* **Red Dead Redemption 2 (Medium):** \\~69 FPS 1080p in tests. \n* **Time Spy (Graphics score):** In that ballpark of other RTX 5060 laptop GPUs. (Tom’s describes it as “in line with other RTX 5060 laptops”) \n* **Battery / endurance:** In light use modes, some Nitro V 16 units lasted \\~10+ hours in video/web tests. \n* **Display brightness / color:** One measurement for 165 Hz 1200p panel (in Nitro V 16 variants) measured \\~391.8 nits peak brightness, \\~77.4% DCI-P3, \\~109% sRGB in tests. \n\n# Performance (How it will feel day-to-day)\n\n* **Gaming:** Smooth for competitive shooters (Valorant, CS2), you’ll likely see 200+ FPS in well-tuned settings. For AAA stuff, you’ll push settings down a bit. DLSS or frame-generation helps.\n* **Multitasking / streaming / creative work:** 32 GB RAM is great ,you can keep browser, Discord, streaming tools, editors open without much swapping. The CPU will handle compiles, encoding, etc., decently.\n* **Load times:** The Gen 4 SSD will load maps, levels, and assets fast. Opening big files or game launch times will feel snappy.\n* **Thermal throttling:** Under long CPU+GPU stress, expect some throttling (due to power/thermal limits), but for most gaming sessions it should sustain pretty well.\n\n# Thermals &amp;amp; Fan Noise\n\n* Fans get noisy under load (Turbo mode). \n* The case plastic and build flex is a mild complaint in some models.\n* Hotspots underneath \\~45-50 °C in worst spots, chassis warms around keyboard top row. Palm rest stays cooler in good designs.\n* The cooling design is acceptable for this segment, you’ll feel heat, but it's not a deal breaker in casual use.\n\n# Battery Life\n\nDon’t expect miracle endurance. In light usage (docs, video, light gaming off battery) you may squeeze **5–7 hours** depending on brightness. Always game plugged in.\n\n# Display &amp;amp; Build\n\n* The 180 Hz IPS 1920×1200 is great for this machine’s target (gaming + general use). Not the most color-accurate, but serviceable for content work on the side.\n* Brightness (\\~350–400 nits region in tested units) is decent for indoor use; outdoor use less ideal. \n* Build is mixed: plastic base, aluminum lid in some variants. The lid flex makes it feel cheap a little\n* Keyboard is decent for typing + gaming. No fancy per-key RGB in many versions (four-zone RGB).\n* Port selection is valid: USB-C, USB-A, HDMI 2.1, Ethernet, several USB slots, microSD in some variants. \n* The webcam in many Nitro V 16 variants is 720p, so don’t expect studio quality. \n\n# Comparisons\n\n* [Lenovo LOQ](https://www.amazon.com/Lenovo-LOQ-15IRX10-i5-13450HX-Backlit/dp/B0FNN5F1MP?crid=3I7E8MYWSOHVD&amp;amp;dib=eyJ2IjoiMSJ9.aoEKncpM2Zx3YMnacnwEYcHxkIUl9Wcp7_evDCiKgVUPtFQ9Mi6TrPngCRKVG48qrCVqOxnEa0g3jIIISgF3OXTpl0RUNjHdji13ZKK9SGd9xMVMXqLIl-MHMkoPcEHmpls_rOfU3faVRxxJfi_JzXpdcnzlPTF4lVbQMN67_WBuqaxqUcbFJ1Z-3Q_fAwwiZTVQnyhMSDdGnmgjuhNNwIZ-uFAB-6p9JiUefws5r2E.CWJM5cRkTdTh5wNppToqEhHX89DqzpZhWs7425yQ2TI&amp;amp;dib_tag=se&amp;amp;keywords=lenovo%2Bloq%2Brtx%2B5050&amp;amp;qid=1759864725&amp;amp;sprefix=Lenovo%2BLOQ%2Brtx%2B50%2Caps%2C102&amp;amp;sr=8-1&amp;amp;th=1&amp;amp;linkCode=ll1&amp;amp;tag=taohid0f-20&amp;amp;linkId=51825969802540c7f0514571f4307dd0&amp;amp;language=en_US&amp;amp;ref_=as_li_ss_tl)**:** Worser performance but better thermals and build quality\n* [MSI Katana:](https://www.amazon.com/Katana-15-6-165Hz-Gaming-Laptop/dp/B0DZFVBQLK?crid=3CBM6LPO25UDW&amp;amp;dib=eyJ2IjoiMSJ9.nhIj8TUO897LCI1wCF9Uy42ixRjM1rC1FQzM7aTpB4B9fbQoges8vdcYGDXiT80jlAoNyUr51CeYalmkPkMdT49-xIcz4XbKf3WogrNIiThQFW3ueJjglIs40SAkByifQvyf4MFox20ocWYWJteDD5BPI0e0jlzBJzSkgqUQlzioyDdFeRgpmoY2Un7OGCqBiTTdYyjxgyA0BFWCzbEk551SqAibC3dqYa65tD-zn08.wWea6IXxkb-PPffARcZRmIg3ZRnzOQYD7EjazlOO8P4&amp;amp;dib_tag=se&amp;amp;keywords=msi%2Bkatana&amp;amp;qid=1759864571&amp;amp;sprefix=msi%2Bka%2Caps%2C117&amp;amp;sr=8-3&amp;amp;th=1&amp;amp;linkCode=ll1&amp;amp;tag=taohid0f-20&amp;amp;linkId=c7bb816dcc13574db7a77958ec18569f&amp;amp;language=en_US&amp;amp;ref_=as_li_ss_tl) Better performance, worser cooling and battery life and also priciers\n* [ASUS TUF A14](https://www.amazon.com/ASUS-Gaming-Copilot-Laptop-WQXGA/dp/B0DZQHB8S5?crid=2OX9GXD3JTLB3&amp;amp;dib=eyJ2IjoiMSJ9.VCdrpT2LeVeRkCUL_RlI975wTbhVEy6zJhr09MtxkZq9xdCX3gsoI433VvGSaJjJnbNUp-5Hx7A89bDFkME8gBHC-mCzFuSQqWELkyIE251AG4DDYxcgumG2jy5h9agJ7vLLq5O1hZV6MVby_nKygKJNK1Gd0ZYjEEL4TT6ShiIriYSAJwSpSrNgUmAVGZbUQ2u_r2ICfpUIFqxpkoU2aG_CuhwJ0jApYz4y4jYTKU4.sTVkzlJqttMveldHYelBTPU3dFi-jG_40kQ_90GN4Xs&amp;amp;dib_tag=se&amp;amp;keywords=asus+a14&amp;amp;qid=1759864661&amp;amp;sprefix=asus+a1%2Caps%2C282&amp;amp;sr=8-3&amp;amp;linkCode=ll1&amp;amp;tag=taohid0f-20&amp;amp;linkId=c68898ed7aae1a9345531dfa6f4837de&amp;amp;language=en_US&amp;amp;ref_=as_li_ss_tl)**:** A lot worser performance, much better battery life+portability\n\n# A Potentially Better Choice\n\nIf I were you and had a few extra bucks, I might lean toward a **Nitro V variant with RTX 5070 or a model in the ASUS TUF / ROG line with stronger GPU + better cooling**. You’ll get more headroom as games get more demanding. Or check a LOQ or Legion variant for similar specs but better thermal design.\n\n# Pros &amp;amp; Cons\n\n**Pros:**\n\n* Great value (good specs for price)\n* High refresh 180 Hz 16″ display\n* Fast SSD and ample RAM\n* Decent connectivity / upgrade options\n* Good for esports / general gaming\n\n**Cons:**\n\n* Build feels plastic / flexy\n* May drain battery when gaming and plugged in (didn't happen to me) \n* Display color / gamut not top-tier\n* Fans get loud under load\n* Webcam is weak\n* Battery life is weak for general use\n\n# Tips for Buyers\n\n* Use[ CTT Debloat](https://christitus.com/windows-tool/)**, get rid of useless bloatware** — cleans up performance.\n* Swap to “Performance / Turbo” mode when gaming; quieter modes for daily work.\n* Use a cooling pad for longer sessions.\n* Update BIOS / drivers (often useful for thermal / GPU performance tweaks).\n\n# Overall\n\nThis[ Nitro V 16S](https://www.amazon.com/Gaming-Processor-GeForce-Display-ANV16S-41-R2AJ/dp/B0F195W823?crid=2QANQ4COH4MDR&amp;amp;dib=eyJ2IjoiMSJ9.QlP95pi-vwC09vPSH01kVidvTsh20u1VdyDnGgw4pDWJzmMbn7eVIQ3QUPcGUjywZ7DBnO4B6Lb_PZiWi0VaJdzArPUdc_eCSflfu5Y0srAqOcfgccm36DI8FfxKvSnmuUkjqTVTBOYlWWxaJKkMQaHfoQ5VhRAmKHGo4yE1dV2ug0PvV-XCaNjwlHHYkv1m9ZHobhUbfsCIWNPYL_yoJge45uv2F-IGhwO3LMZZXno.mJElywLbr3ulUjB68Y-wmjZgm9iL7eme4YXyQSBnMq4&amp;amp;dib_tag=se&amp;amp;keywords=acer+nitro+5&amp;amp;qid=1759863380&amp;amp;sprefix=acer+n%2Caps%2C115&amp;amp;sr=8-13&amp;amp;linkCode=ll1&amp;amp;tag=taohid0f-20&amp;amp;linkId=a96c3f4a0ced9d7f96372471ff656721&amp;amp;language=en_US&amp;amp;ref_=as_li_ss_tl) / V 16 (Ryzen 7 260 + RTX 5060) is a strong entry-to-mid tier gaming laptop. It gives you solid 1080p–1200p gameplay, snappy general performance, and decent display real estate for the class. Build and battery life are trade-offs, but for what you get, it’s a good deal. If you don’t demand ultra premium features (OLED, best color, silent chassis, etc.), this is a smart pick.\n\n**And ofc be on the lookout for the potential battery drainage issue!**\n\n*(Heads up: This post has amazon affiliate links. If you buy through them, I will get a small commission , doesn’t cost you extra. Helps support the time I put into testing and writing these reviews, so I appreciate it)*\n\nAnd please **upvote** this if you think it was helpful :)",
    "Reddit: Lenovo Diwalia Sale Effective Prices till 23rd Oct\n**I dont reply to DMs. Check** [**ni6hant.com/coupons**](http://ni6hant.com/coupons) **for the coupons and** [**ni6hant.com/rebate**](http://ni6hant.com/rebate) **for the rebate process. You dont need to DM me to get these discounts. Many links are of Instagram reels where I sort of explained everything.**\n\n\n\n# Recommended Lenovo Gaming Lapotps here\n\n# ~₹95k-125k LOQ 250 5050/5060→ Best battery life Budget Gaming Laptop\n\n[All detials here](https://ni6hant.com/laptops/gaming-laptops/loq-270-5060/)\n\nIndia  \n[Customized AMD 250 5050 is just ₹74k](https://www.instagram.com/p/DP-uh_1AdKW/)  \n[Customized AMD 250 5060 1440p is just ₹85k](https://www.instagram.com/p/DP-voaqAUm3/)  \n[Quick Delivery AMD 250 5050 is just ₹88k but it Doesn't make sense consideering the customized ones above.](https://www.instagram.com/p/DQA8MK6AcWd/)  \n[Quick Delivery AMD 250 5060 is just ₹](https://ni6hant.com/laptops/)  \neffectively until 23rd Oct if you can do the [Extra Savings things ](https://ni6hant.com/laptops/#lenovo-discounts).\n\n\n\n# ~₹125k-135k Legion 5 Gen 10: AMD 260 5050/5060→ Best battery life Premium Laptop\n\n[Customized AMD 260 Zen 4 with Nvidia 5050/5060](https://ni6hant.com/laptops/gaming-laptops/legion-5-gen-10-260-5060/) |  \n[Customized AMD 350 Zen 5/5c with Nvidia 5050/5060/5070](https://ni6hant.com/laptops/gaming-laptops/legion-5-350-5060/).\n\nIndia→[Customized AMD 250 5050 is just 89k](https://www.instagram.com/p/DP-yAQOAdNX/) effectively until 23rd Oct if you can do the [Extra Savings things ](https://ni6hant.com/laptops/#lenovo-discounts).\n\n\n\n# ~₹160-₹190k Legion Pro 5 Gen 10 AMD - 5050/5060/5070→ Best Premium Performance Laptops while being 1\" thick\n\n[(IPS) 8945HX -AMD zen 4 CPU with 5050/5060/5070 Review](https://ni6hant.com/laptops/gaming-laptops/legion-pro-5-gen-10-amd-8945HX) |  \n[(OLED) 9945HX -AMD zen 5 CPU with 5000 series- Review halted due to lack of data but still worth considering](https://ni6hant.com/laptops/gaming-laptops/legion-pro-5-gen-10-amd-9945HX)  \n\n\nIndia  \n[Customized 8945HX 5060 IPS is just 125k](https://www.instagram.com/p/DP-zkROAao_/)  \n[Customized 8945HX 5070 IPS for just ₹141k](https://www.instagram.com/p/DP-3IhWAd1g/)  \n[Customized 9955HX 5060 OLED is just ₹127k](https://www.instagram.com/p/DP-4CWqAUeK/)  \n[Customized 9955HX 5070 OLED is just ₹143k](https://www.instagram.com/p/DP-6429Af4V/)  \neffectively until 23rd Oct if you can do the [Extra Savings things ](https://ni6hant.com/laptops/#lenovo-discounts).\n\n\n\n\n\nNot 100% Recommended Gaming Laptops\n\n\n\n# LOQ 13th Customized 13450HX/13650HX 3050/4050\n\n[Customized Models only due to Intel](https://lenovo-in.zlvv.net/o4k10O) | **Intel CPU. See** [**Important Note Above**](https://ni6hant.com/laptops/#important)\n\n\n\nIndia  \n[Customized 13450HX 3050 is just ₹55.4k](https://www.instagram.com/p/DP-9aWjAVsP/)  \n[Customized 13450HX 4050 for just ₹64k](https://www.instagram.com/p/DP_Bhj8gSJn/)  \n[Customized 13650HX 4050 for just ₹70k](https://www.instagram.com/p/DP_C2RVAbYy/)  \neffectively 23rd Oct if you can do the [Extra Savings things ](https://ni6hant.com/laptops/#lenovo-discounts).\n\n\n\n# Legion 5i Gen 10 - 13650HX,14700HX,14900HX with 5050,5060,5070 → Not 100% Recommended\n\n[(Review almost done)13650HX 5050, 5060, 5070](https://ni6hant.com/laptops/gaming-laptops/Legion-5-15IRX10-13650HX-5050-5060/)  \n[(To review later when there is enough data)14700HX 5050/5060/5070 &amp;amp; 14900HX 5070](https://ni6hant.com/laptops/gaming-laptops/Legion-5-15IRX10/)\n\n\n\n\n\nIndia  \n[Customized 13650HX 5060 is just ₹99k](https://www.instagram.com/p/DQBCPiagR1v/)",
    "Reddit: HELP ME CHOOSE WHAT LAPTOP TO BUY please\nThis is my first time buying a gaming laptop and I'm not very knowledgable about it.  (I chose gaming laptops because I heard rendering is good with a dedicated gpu, correct me if I'm wrong)  \nUsing it for: \n\n* Video editing (AE)\n* Learn Blender\n* Mostly used for Programming for now\n   * I bring it to school often but not daily (I can use the school's outlets).\n   * Maybe do hackathons and advance coding like ai/ml.\n* I rarely play games right now\n\nI don't care about the weight  \nI want it to last longer, so I can still use it after graduating.\n\nhttps://preview.redd.it/hv3lv5pznnwf1.jpg?width=1080&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=e0c646406e5e9566e372c4d32f30b12a728c225c\n\nhttps://preview.redd.it/dosm7gmznnwf1.jpg?width=1080&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=1e6495b120654aa841fc7ea2e762ce18468f19aa\n\nhttps://preview.redd.it/rbftd2kznnwf1.jpg?width=2160&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=02da98391baa78953c9ba404a84797b90f27b03d\n\nHere are some of my choices so far:\n\n**Lenovo Legion 5 R7000P**   \n84K+ - from [ZZM TRADING](https://shopee.ph/Lenovo-Legion-5-R7000P-2024-2025-16-R7-8845H-R9-8940HX-R9-8945HX-RTX-4060-5060-5070-ZZM-Trading-i.22739277.28257686402?sp_atk=1970807c-1bbb-46c7-ad2c-077c6d3a2c72&amp;amp;xptdk=1970807c-1bbb-46c7-ad2c-077c6d3a2c72) (It has really good specs and I've seen a lot of good reviews, but the downside is limited ang warranty. Not local and 1 year lang covered sa zzm mismo. Should I risk it?) \n\n* **Processor:** AMD Ryzen 9 8940HX (16 cores, 32 threads, up to 5.3GHz) \n* **Graphics:** NVIDIA GeForce RTX 5060 8GB GDDR7 \n* **Operating System:** Windows 11 Home Chinese (Free change os)\n* **Display:** 16\" WQXGA (2560x1600) IPS 240Hz 3ms 100% DCI-P3 Dolby Vision FreeSync Premium \n* **Memory:** 16GB DDR5 5600MHz \n* **Storage:** 1TB PCIe 4.0 NVMe SSD, Dual M.2 slots\n* **Wireless Connectivity:** Wi-Fi 7, Bluetooth Supported\n* **Battery:** 80Wh Li-ion, up to 6-8 hours\n* **Power Adapter:** 140 AC adapter\n\n\n\n**Lenovo Legion 15IRX10 83LY00EWPH**  \n80,999 from [PcCentral](https://shopee.ph/Lenovo-Legion-15IRX10-83LY00EWPH-15.3-165Hz-Intel-i7-13650HX-16GB-DDR5-512GB-SSD-RTX-5050-8GB-i.42550301.44415293523?sp_atk=46f9a090-3c2c-4c15-9b21-b00793f9be7a&amp;amp;xptdk=46f9a090-3c2c-4c15-9b21-b00793f9be7a)  \n\n* **Processor:** Intel® Core i7-13650HX, 14C (6P + 8E) / 20T, P-core 2.6 / 4.9GHz, E-core 1.9 / 3.6GHz, 24MB\n* **Graphics:** NVIDIA® GeForce RTX™ 5050 8GB GDDR7, Boost Clock 2662MHz, TGP 115W, 440 AI TOPS\n* **Chipset:** Intel® HM770 Chipset\n* **Memory:** 1x 16GB SO-DIMM DDR5-4800\n   * **Memory Slots:** Two DDR5 SO-DIMM slots, dual-channel capable\n   * **Max Memory:** Up to 32GB DDR5-4800 offering\n* **Storage:** 512GB SSD M.2 2242 PCIe® 4.0x4 NVMe®\n* **Storage Slot:** Two M.2 2280 PCIe® 4.0 x4 slots\n* **Max Storage Support:** Up to two drives, 2x M.2 SSD |  M.2 2242 SSD up to 1TB each\n* **Camera:** HD 720p with E-shutter\n* **Battery:** 80Wh\n* **Power Adapter:** 245W Slim Tip (3-pin)\n* **Display:** 15.3\" WUXGA (1920x1200) IPS 300nits Anti-glare, 100% sRGB, 165Hz, Dolby Vision®, G-SYNC® \n\n  \n**Acer Predator Helios Neo 16 PHN16-71-55V5**  \n76,999 - from [Predator Official Store](https://shopee.ph/Acer-Predator-Helios-Neo-16-PHN16-71-55V5-WUXGA-i5-13500HX-16GB-512GB-SSD-RTX-4060-Windows-11-Laptop-i.89732208.28750907502?gads_t_sig=VTJGc2RHVmtYMTlxTFVSVVRrdENkZXc2VFhGUzZQUkd1d3gzNWRibGNNSmlPZzlEU0pXeUpMcC9uanpEWVNlZTZPMzZXRkNUU0lHejZjNVlIaEIwcVByVEZDU05rUVU2ZHN2ZGxhY1NsZ2syUHpRUEdCUWcvVmthZTl2QnRvT0ZpT2I1N3hVY3lMdU14YmxYVUU1d3RnaUVHN25ibWJhdDZubzcrcStyYk8yNnVBS3JVS1pmODVMeWgwTWVOTnJxclFjYXZWUEhyR0c5YTVlRkZJbk9rdzNXRE5RZHhzakt1eVFPNnd1UXBuSHdBYVRmM3lhckpudFlhTzYxOFltbEgrb0RKcXFZOTBBa01UcG1GZktKMURjVk5KUXhIa3FnWnhBRi8ySlBkRGs9&amp;amp;uls_trackid=540jek5f02vj&amp;amp;utm_campaign=-&amp;amp;utm_content=17752-a62b09c37f39441fb87689e33ec23abe--103090&amp;amp;utm_medium=affiliates&amp;amp;utm_source=an_13266010000&amp;amp;utm_term=dui2gmg4axm5) (I read a of reviews saying acer laps are bad, is it true?)\n\n* **Processor:** Intel Core i5-13500HX processor (24 MB Smart Cache, 2.5 GHz Performance-core with Intel Turbo Boost Technology 2.0 up to 4.7 GHz, overclock capable), supporting hybrid core architecture with Performance-core and Efficient-core\n* **Memory:** 1x 16GB of DDR5 4800Mhz system memory, upgradable to 32 GB using two soDIMM modules\n* **Storage:** 512GB PCIe Gen4, 16 Gb/s, NVMe\n* **Display:** 16.0\"\" display with IPS (In-Plane Switching) technology, WUXGA 1920 x 1200, high-brightness (400 nits) Acer ComfyView™ LED-backlit TFT LCD, supporting 165 Hz, Grey to Grey 3 ms by Overdrive, Nvidia Advanced Optimus capable.\n* **Graphics:** NVIDIA® GeForce RTX™ 4060 with 8 GB of dedicated GDDR6 VRAM, supporting 3072 NVIDIA® CUDA® Cores.\n* **Operating System:** Windows 11 Home\n* **Connectivity:** WLAN Killer Wireless Wi-Fi 6 1650i 802.11 a/b/g/n/ac/ax wireless LAN Band: 2.4 GHz ,5 GHz 2x2 MU-MIMO technology Support Bluetooth 5.2 and above\n* **LAN:** KillerTM Ethernet E2600 10/100/1000 Mbps Hibernation mode support Wake On Lan support Pv4 and IPv6 support\n* **Battery:** 90 Wh 4-cell Li-ion battery\n* **Keyboard:** 103-/104-/107-key FineTip RGB-backlit keyboard with independent standard numeric keypad, international language support\n\n  \nHere are some less expensive ones I found:   \nAre these choices enough for my uses?  \n[Lenovo LOQ 15ARP9 83JC00GEPH](https://shopee.ph/Lenovo-LOQ-15ARP9-83JC00GEPH-15.6-FHD-Ryzen-7-7435HS-12GB-RAM-512GB-SSD-RTX-4050-i.42550301.27829306849?sp_atk=bdb73565-e876-4762-bea1-87a3c2ecf43b&amp;amp;xptdk=bdb73565-e876-4762-bea1-87a3c2ecf43b) | 15.6\" FHD | Ryzen 7 7435HS | 12GB RAM | 512GB SSD | RTX 4050   \n[Lenovo IdeaPad Gaming 3i - 16IAH7](https://shopee.ph/Lenovo-IdeaPad-Gaming-3i-16IAH7-Intel-Core-i7-16-WUXGA-8GB-RAM-512-SSD-NVIDIA-GeForce-i.88069863.17881888606?sp_atk=7defd9fe-737b-4744-a2a8-dce17e449a68&amp;amp;xptdk=7defd9fe-737b-4744-a2a8-dce17e449a68) | Intel Core i7-12650H | 16\" WUXGA | 8GB RAM | 512 SSD | NVIDIA GeForce RTX 3060 6GB GDDR6, Boost Clock 1425MH, TGP 105W  \n[Asus TUF A15 FA507NUR-LP051W](https://shopee.ph/Asus-TUF-A15-FA507NUR-LP051W-15.6-FHD-Ryzen-7-16GB-DDR5-512GB-SSD-RTX-4050-Windows-11-Gaming-Laptop-i.76498287.26304924850) | 15.6\" FHD | Ryzen™ 7 7435HS |16GB DDR5 | 512GB SSD | RTX 4050  \n\\-I'm sticking with windows for now since it is what I'm used to (considering also for labs, group exercises) and I don't have time to learn how to use MacOS.",
    "Reddit: Can't decide which laptop to buy\nI am a university student and I'm looking for a powerful laptop that would last me 5+ years.\n\nI had my last laptop for three years and it didn't satisfy me in any way. It was a disaster. So I'd really like to hear your opinion so I don't get screwed with a new one.\n\nOn the internet most people say that Lenovo laptops are some of the best on the market right now.\n\nI was originally thinking of buying a Legion 5 9th gen with rtx 4070, but now they are out of stock in my country. I still can get one from third party shops but they won't provide official warranty, just 1 year form the shop itself which feels unsafe.Anyway I still want a 4070 level performance or better. \nFrom the few reviews I can find now, 5060 is equal/slightly better than the 4070 in performance (although some say it's not and even worse). So my eye fell on the 10th gen with the 5060 graphics card.\n\nThere are some pretty good **Legion 5** variants with 5060 in my budget, but unfortunately they all have OLED display which makes me a bit wary because of shimmering and glossy display.\nThe only option with IPS display in my country is **83LY007KRA** for **$1700**.\n\nhttps://psref.lenovo.com/Detail/Legion/Legion_5_15IRX10?M=83LY007KRA\n\nBut I'm not sure about the weaker processor, which also limits RAM to 4800. \n**Will this lower the performance and how much will I lose in gaming?**\nAlso on the official Lenovo website it says 4.2 hours of battery life and 2.1kg of weight, which is great because I plan to take it to university.\n\nAnother option is the **Pro 5**. The cheapest version on our market is **83NNN003VRA** for **$1960**.\n\nhttps://psref.lenovo.com/Detail/Legion/Legion_Pro_5_16IRX10?M=83NN003VRA\n\nIt has a better processor, RAM speeds, screen and cooling system *(although I'm not 100% sure about the cooling)*. But the battery life isn't that good. The official Lenovo store site says “up to 3.4 hours”. I don't know how accurate and in which conditions is that tho. And I don't like charging port on the side. Won't it be bended all the time and break eventually?\nRyzen version is $73 more expensive, but judging from the only one review with it, battery life there is even worse because of the R 9 8940HX it barely pulls up to two hours. I'd like to buy next-gen processor, which should give 4.7 hours, but it's $150 more expensive and too far out of my budget. I have a 90w power bank with PD, but idk how much time it will provide.\n\n**So is it worth paying the extra $260 for the Pro 5 version or should I buy IPS Legion 5?**\n\nI was also thinking of buying LOQ. It's considerably cheaper and I could get a better performance with rtx 5070 for $1700 with the same RAM cutted Intel Core i7-13650HX, but all this drama with last year's generation motherboards is scary. Oh, and I just came across a post by a college student who's loq started to fall apart. \n**Seems like Legions has higher quality materials and this shouldn't happen?**\n\nIf anyone has had experience I'd also like to know if it's worth looking into Asus TUF or Acer Nitro? From the reviews they are not as durable and reliable, but positive reviews are always a minority so...\n\n**Thank you for any help!!**",
    "Reddit: Good Laptop/Deal\nI need a new laptop for university and gaming.\nSo it needs to have a decent battery time. I am no hardcore gamer so it doesn't need to run the newest games on the best settings but i still want it to be decent because i want to keep it for a few years.\nI found the LENOVO Legion 5 15IRX10 eith Intel® Core™ i9-14900HX, 1TB SSD, 24 GB RAM and GeForce RTX™ 5070 for 1899€.\nIs that a fair price?\nAny product reviews for that one?\nAny better recommendations?",
    "Reddit: My beloved boy have died - Lenovo Legion 5 Pro 16ITH6H (i7-11800h/3070/32GB)\nSo fell in love with this guy from the first minutes, i used to be \"desktop only\" pc user, it converted me to laptops only.\n\nI dusted it off every month, after 1,5 year of usage i have put PTM7950 into it, most of time it run undervolted to not run too hot. Even after all of this, its started to have issues with powering on, after few calls with laptop repair shops they said defineately that CPU need reballing and told me to push in specific place when turning it on and it was true, now it booted. They reballed it and after 2-3 weeks i had my sweet baby back. After few months problem re-occured and repair shop as service guarantee re-did the process, after next 2 months here we are....my boy is dead and nothing make him go up. I am not paying another 250 USD for reballing :(\n\nI have ordered new already - 16IAX10 - 275HX/5070/32GB but i am fighting with my thoughts, on one hand i love the way Lenovo laptops are designed aesthetically, on the other hand, if that new laptop will also die after 2 years i will go crazy...now i am prolongating Lenovo Care for 48 months, it was mistake i did not did it with previous.\n\nAm i stupid that i believe that next one will not die as soon as this one?\n\nTLDR: laptop died even tho i was treating it too well, what to do now.\n\n  \nEDIT + UPDATE: I have contacted with repair shop that did reballing twice, they will take him again and will investigate.",
    "Reddit: Lenovo Legion Go 2 pricing from the perspective of a Best Buy regional manager.\nGoing to write this out because I just got done ranting to my wife about all the comments I'm seeing with the entire internet upset over the price of the Legion Go 2, even though Lenovo gave the fans exactly what they asked for.  I wanted to give some perspective as someone who already has access to the pricing of the Xbox Ally X, as well as wholesale pricing for all units, etc.  I'm going to be using the $1349 Legion Go 2 here, because it's the closest thing to the best variant of the Xbox Ally X.\n\nFirst off, the Xbox Ally X will be rolling out at Best Buy with a $1099 price tag, with a $350 3 year protection plan.  The Legion Go 2 32GB / 1TB model is $1349, with a similarly priced $350 3 year protection plan.\n\nThe Xbox Ally X wholesale price (10,000 units), is $751.12, while the Legion Go 2 (5,000 units) wholesale price is $1099.  The Xbox Ally X carries the larger profit margin while simultaneously being the cheaper unit to produce.  For this reason, Best Buy orders far more ROG Ally X, and now Xbox Ally X products in comparison to the Legion Go products, which I find interesting, as the ROG Ally X has a nearly 30% return rate at Best Buy compared to the Legion Go (original) 8%.\n\nThe number one reason the ROG Ally X is returned - as marked under the options in the system - is \"Defective, Overheating\".  Whereas the Legion Go's highest return rate is generally marked as \"other\", which in most cases are returns where the product is just not what people expected, in this case it's safe to assume size was a factor.\n\nThe wholesale price gives us a good amount of information here as well.  Lenovo spent $350 more per unit to produce their product compared to what Asus did, which is likely do to the custom Samsung 8.8\" 2k 120hz OLED panel, which is a one of a kind panel not used in any other products.  In any case, generally speaking, the higher wholesale price is going to mean a higher quality product, which sadly almost always translates to a less profitable product as well.\n\nPeople can take this information how they choose, but personally, anyone who looks at the price of the Legion Go 2, only to say they're going with the Xbox Ally X instead, is making a big mistake.  If size is a concern, by all means, stay away, but in every other category, the extra $250 you're spending on a Legion Go 2 is 100% worth it.  Don't buy the 2TB version, there is a 4TB M.2 on the way Q1 of next year, I wouldn't put that in a ROG product, but the Legion Go 2 has far better cooling, I'll be doing it as soon as they come in.\n\nEDIT: For those looking to upgrade to a 2280 ssd, make sure you buy the adapter with the angle, the one that goes straight across does not fit properly.  A $10 adapter will let you use a 4TB nvme on day 1.\n\nExample adapter with the \"angle\":\n\n[https://www.amazon.com/dp/B0DKFLX2ZR?ref=ppx\\_yo2ov\\_dt\\_b\\_fed\\_asin\\_title](https://www.amazon.com/dp/B0DKFLX2ZR?ref=ppx_yo2ov_dt_b_fed_asin_title)",
    "Reddit: Lenovo dropped the ball on Legion Go 2 despite a killer screen\nLook: the Legion Go 2 nails several things. It has an 8.8-inch HDR OLED beautiful display, 1920×1200 resolution, up to 144Hz refresh and VRR support.  The build and detachable “TrueStrike” controllers are high quality, with hall-effect joysticks to reduce drift. \nSo far, so good.\n\nWhere Lenovo messed up: they piled on everything. Tons of extras, detachable controllers, docking/fps puck modes, extra large 8.8inch screen . But the result: bulky form-factor (≈ 2.03 lbs with controllers).  High price point — review unit around US $1,349.99. \n\nMy point: If Lenovo had stripped out the detachable controllers, removed non-essential features, focused purely on a sleek, high-end handheld with the OLED screen and solid internals, they could’ve launched at ~$1,000, hit a broader market, and told a clearer story. Instead we got something that feels over-engineered and niche.\nIn short: great hardware, but dumb strategic execution.",
    "Reddit: My Legion Go 2 Review\nHey all,\n\nI made a post yesterday about how I was underwhelmed by the Legion Go 2's performance, so I wanted to follow that up with a full review now that I've had a couple of days with the device. This'll just be a good / mid / bad list, with an overall verdict at the end as to who I think this device is for, and who it isn't for. Quick disclaimer as well, my handheld up until this point has been the SD OLED, so this may provide an ideal review for those who are also thinking of upgrading from that device. So without any further waffling, here's my review, starting with:\n\n  \n**The Good**\n\n* The display is great. This probably won't come as much of a surprise as I think the display is the main selling point of the device. It's big, bright and just downright impressive with no drawbacks as far as I'm concerned. 144Hz refresh rate, if you're able to hit it, is also a pretty big bonus. As an example, you can easily hit that in a game like Hades, and it's a significant upgrade when compared to the 90Hz display of the SD OLED.\n* Detachable controllers are great. They're ergonomic, the finish on them feels quite premium and the buttons / joysticks are also a joy to use. \n* Thermals and fan noise are surprisingly good. Monitoring thermals when pushing it, it never looks to hit thermal throttling territory and the device stays cool to the touch in all the important places. Fan noise is about on-par with the SD OLED, which is to say that it's noticeable but never annoying.\n\n  \n**The Mid**\n\n* Performance is solid, after some tweaking. Yesterday, my post caused a bit of a stir where I said that there are certain games where the SD OLED seems to be getting close, if not matching the LeGo 2 in performance. After some poking around, I noticed that the frame buffer was set to 2GB by default. Why Lenovo have done this is beyond me, there aren't many games outside of basic indies that use less than 2GB. After setting this to 8GB, performance across the board stabilised and performance in the games where the SD OLED was matching it, it was now pulling well ahead, so that was a relief.\n* Ergonomics with the controllers attached is reasonably comfortable. The controllers are well sculpted and, despite its pretty huge size, it masks this well when playing all sorts of games. Not much more to say there really!\n* Battery is also pretty good. I've been mostly playing with it in performance mode (25w), and it's able to last around 2.5 hours if the GPU and CPU are working pretty hard in games such as Diablo 4, for example. \n* Trackpad is serviceable, if it is a bit small\n\n  \n**The Bad**\n\n* Windows gets in the way, as we've all largely come to expect. If you want a unbox-and-play experience, be prepared to overcome the standard Windows hurdles before you do so.\n* The Lenovo launcher software (can't remember what it's called off the top of my head) isn't great. It's buggy, fails to launch some games entirely and often freezes and crashes. I've disabled it from starting up entirely on my device.\n* It's HEAVY. I didn't think this would be much of a problem to me, but after having it in my hands for 20 minutes, I can feel my hands and forearms tiring. It's a large departure from the significantly lighter SD OLED.\n* The value. For what Lenovo are charging for this thing, I think the value proposition is off by quite a margin. When other premium tier devices such as the Claw 8 AI, Xbox Ally X (rumoured) and the Ally X are a solid 20-25% cheaper, I think this makes it a hard sell, especially given the cons I've listed above. When you compare it to the SD OLED (which is more than 50% cheaper), it suffers even more in this category in my opinion.\n\n  \n**Verdict**\n\nFor me personally, I'll be returning the device. I think it's a good device overall, which performs quite well, has the best display on any handheld and from what I've read, is a significant upgrade over the original device. If that's what you're looking for, I think this device is for you. For me however, ergonomically, the SD OLED is the superior device, has a display that, even though smaller, rivals this, and the overall experience with Steam OS out of the box is vastly superior to Windows in its current state. Furthermore, the performance difference isn't so vastly significant that it makes it hard to go back to the SD. Despite the lesser hardware, the SD does make better use of its hardware overall IMO. Actually, now that I mention that, let me quickly put together some bullet points as to who I think this device is for, and who it's not for:\n\n\n\n**Who Should Buy This?**\n\n* You own a lower tier performing device, such as the SD OLED, and want to experience significantly higher framerates.\n* You're already a fan of the form factor of the original and just want a flat upgrade. Performance-wise I don't think you're going to see anything too significant, but there's no denying that the display is a knockout. It looks superb.\n\n**Who Shouldn't Buy This?**\n\n* You already own a device with a Z1 Extreme or equivalent and want a significant performance upgrade.\n* You have small / average sized hands (trust me this thing is an absolute unit).\n* If you've tried using Windows on a handheld in the past and didn't get on with it, your opinion isn't going to change this time around.\n\n  \nI think that covers all the important stuff. If there's something that I've missed please do leave a comment and I'll get back to you ASAP.",
    "Reddit: Amazon increased Lenovo Legion Go price for 2 hours, to then claim it's \"discounted\".",
    "Reddit: After the fake reviews, Alcatel is now forcing users to rate an application with 5 stars to use it\nUnfortunately, seems that Alcatel (or TCL, to be more correct, as they're the ones using the Alcatel brand for mobiles) has crossed another line with its new approach in their Android apps. After replacing the default apps sold with their phones with adware-filled \"alternatives\", after adding those applications into a security update to force them onto the users, after adding a series of fake five star reviews... now comes the time for the forced five star ratings.\n\nIn their [Calculator application](https://play.google.com/store/apps/details?id=com.tct.calculator), Alcatel now forces the users to [rate the application with 5 stars, before using the scientific calculator options](https://i.imgur.com/yMlrAx3.png). Sometimes, I wonder if they simply try to come up with new ways to break their customers' trust just for the fun of it. \n\n**Updates**\n\nThere are a few updates I'd like to make to the original post, based on some things that changed and comments on the thread.\n\n* Regarding the comments that this is not an Alcatel application: this was the application that, up until it was removed, was replacing the stock calculator application in Alcatel phones when updating it (that's how I ran into it, as I have an Alcatel idol 4, and other Alcatel users already commented the same in the thread). Replacing the stock apps with these shady versions is something that Alcatel has been doing for a few months: [news item @Slashgear](https://www.slashgear.com/alcatel-apps-just-went-adware-on-us-29517407/), [news item @AndroidPolice](https://www.androidpolice.com/2018/01/29/default-gallery-app-alcatel-phones-replaced-spamware-users-angry/)). Unfortunately, this is really tied to Alcatel, even though there's a gmail email account as a support link - which also happens in [other Alcatel applications](https://play.google.com/store/apps/details?id=com.tct.gallery3d).\n\n* It seems that the unlock worked even if the users rated it with less than 5 stars (I didn't test unlocking it with a lower rating, but there are a few reports of this in the thread). However, since the unlock message clearly stated that 5 stars were required, the vast majority of users was rating it with 5 stars (while leaving comments saying that they were doing it only to unlock the features). This is still against the Play Store's ToS (and a very shady thing to do).\n\n* The application seems to be gone from the Play Store. It is also no longer showing in my Idol 4 (as of this morning).\n\n* In my Idol4, the update notification for the other Alcatel stock applications has disappeared. I'm not sure if there's any relation to this situation. Up until now, I had update requests for all the stock applications to turn into their \"spam\" alternatives, but now they're not even listed under my installed apps. Can other Alcatel users confirm if the same is happening to them?\n\n* The developer seems to have a [second version of this calculator](https://play.google.com/store/apps/details?id=com.tct.calculator2) currently up. I'm not sure what's different or if it also has the rating demand. However, this second version doesn't seem to replace the stock app when updating OTA on Alcatel phones.",
    "Reddit: Watch Dogs: Legion - Review Thread\n\nGame Information\n--------------------\n\n**Game Title**: Watch Dogs: Legion\n\n**Platforms**:\n\n- PlayStation 4 (Oct 29, 2020)\n- Xbox One (Oct 29, 2020)\n- PC (Oct 29, 2020)\n- Google Stadia (Oct 29, 2020)\n\n**Trailers**:\n\n- [Watch Dogs: Legion: Opening Hours Gameplay | Ubisoft [NA]](https://www.youtube.com/watch?v=dZLu1LXogOg)\n- [Watch Dogs: Legion: First Gameplay Details and Play As Anyone Explained | Ubisoft [NA]](https://www.youtube.com/watch?v=-5EePfdMyC4)\n- [Watch Dogs: Legion: E3 2019 Gameplay Walkthrough | Ubisoft [NA]](https://www.youtube.com/watch?v=rIe3M1_Bu-Y)\n- [Watch Dogs: Legion: E3 2019 Official World Premiere Trailer | Ubisoft [NA]](https://www.youtube.com/watch?v=KbokXaPTk38)\n\n\n**Publisher**: Ubisoft\n  \n**Review Aggregator**:\n\n**[OpenCritic - 75 average - 62% recommended - 91 reviews](https://opencritic.com/game/7405/watch-dogs-legion)**\n\nCritic Reviews\n-------------\n    \n\n**[3DNews](https://opencritic.com/outlet/531/3dnews)** - [Алексей Лихачев](https://opencritic.com/critic/4018/-) - *Russian* - [9 / 10](https://3dnews.ru/1023984)\n\n&amp;gt;Watch Dogs: Legion doesn't have the main protagonist, instead we have a city full of oppressed and tired people with their own stories. Other than that this is the usual Watch Dogs game and fans of the first two should be pleased with what it can offer.\n\n-------------\n\n**[ACG](https://opencritic.com/outlet/310/acg)** - [Jeremy Penter](https://opencritic.com/critic/1355/jeremy-penter) - [Wait for Sale](https://www.youtube.com/watch?v=y3dklTrUt04)\n\n&amp;gt;Video Review - Quote not available\n-------------\n\n**[Ars Technica](https://opencritic.com/outlet/362/ars-technica)** - [Kyle Orland](https://opencritic.com/critic/2303/kyle-orland) - [Unscored](https://arstechnica.com/gaming/2020/10/watch-dogs-legion-review-a-meaningless-mob-with-mostly-merry-mayhem/)\n\n&amp;gt;In the end, the London of Watch Dogs: Legion feels a mile wide but only a few feet deep. What promises to be endless variety in character choice and hack-driven gameplay options quickly boils down to the repetition of the same old gameplay and plot tropes.\n\n-------------\n\n**[Attack of the Fanboy](https://opencritic.com/outlet/116/attack-of-the-fanboy)** - [Diego Perez](https://opencritic.com/critic/6269/diego-perez) - [3.5 / 5 stars](https://attackofthefanboy.com/reviews/watch-dogs-legion-review/)\n\n&amp;gt;Watch Dogs: Legion is incredibly ambitious, but the play as anyone system needs a little more work. The story suffers from the lack of a central protagonist, and it's hard to get attached to any of your characters when the character models and animations are stiff and robotic. Still, there's a lot of fun to be had in futuristic London.\n\n-------------\n\n**[BaziCenter](https://opencritic.com/outlet/482/bazicenter)** - [Bahram Bigharaz](https://opencritic.com/critic/3827/bahram-bigharaz) - *Persian* - [6.5 / 10](https://www.bazicenter.com/review/watch-dogs-legion/)\n\n&amp;gt;After so much anticipation, Watch Dogs: Legion is finally here, failing to impress. Almost every single problem that prevented the 2 previous version to reach their full potential is still there, and the ability to play as all NPCs added even more issues to the game. Yes, the world is beautiful and you have all the freedom that you want, but as a game, Watch Dogs Legion is shallow and suffers from poor level and character design. A strong contender for the most disappointing game of the year.\n\n-------------\n\n**[Bazimag](https://opencritic.com/outlet/594/bazimag)** - [Vahid Zohrabi Nejad](https://opencritic.com/critic/6344/vahid-zohrabi-nejad) - *Persian* - [5.6 / 10](https://bazimag.com/index.php/review/13253-watch-dogs-legion-review)\n\n&amp;gt;Watch Dogs Legion is yet another open-world game like other Ubisoft's games, full of great ideas, but in action, they don't have enough depth and don't perform well in general. A soulless world with poor level designs and exhausting missions make a graveyard for the series's real potential.\n\n-------------\n\n**[COGconnected](https://opencritic.com/outlet/94/cogconnected)** - [Michael Chow](https://opencritic.com/critic/2117/michael-chow) - [75 / 100](https://cogconnected.com/review/watch-dogs-legion-review/)\n\n&amp;gt;Overall, Watch Dogs: Legion is a fun game with a nifty new mechanic that can be utilized in different ways in the future.\n\n-------------\n\n**[Cerealkillerz](https://opencritic.com/outlet/465/cerealkillerz)** - [Manuel Barthes](https://opencritic.com/critic/4593/manuel-barthes) - *German* - [8 / 10](https://cerealkillerz.org/review-watch-dogs-legion-lang-lebe-der-widerstand/)\n\n&amp;gt;Until now the story of Watch Dogs was an up and down, which doesn't change that much in Watch Dogs: Legion. The energy that went into the unique recruiting mechanic leaves a lot missing in the actual game world and the story, which makes the trip to london a bit cloudy, classic british.\n\n-------------\n\n**[Cheat Code Central](https://opencritic.com/outlet/70/cheat-code-central)** - [Jon Gronli](https://opencritic.com/critic/7678/jon-gronli) - [5 / 5](http://www.cheatcc.com/ps4/rev/watchdogslegionreview.html)\n\n&amp;gt;Even though Watch Dogs Legion already gives you an impressive amount to do as well as a lot of options on how to do it, it’s still going to be growing. I can’t wait to see what’s coming next and how It is going to affect what’s already in place. I’m also looking forward to the multiplayer component, which I’m more than willing to write about when it comes out. So, come on. Join the resistance.\n\n-------------\n\n**[Console Creatures](https://opencritic.com/outlet/798/console-creatures)** - [Luke Williams](https://opencritic.com/critic/7697/luke-williams) - [Recommended](https://www.consolecreatures.com/review-watch-dogs-legion/)\n\n&amp;gt;Watch Dogs: Legion's Play as Anyone is an exciting mechanic and post-Brexit Britain is easily the best setting yet. However, Watch Dog: Legion's brilliance is hidden behind a fair amount of smog.\n\n-------------\n\n**[Critical Hit](https://opencritic.com/outlet/299/critical-hit)** - [Darryn Bonthuys](https://opencritic.com/critic/1229/darryn-bonthuys) - [7.5 / 10](https://www.criticalhit.net/gaming/watch-dogs-legion-review-ndash-my-name-is-url/)\n\n&amp;gt;Watch Dogs: Legion is a fascinating game, massively ambitious and crawling with technology that isn't just on the bleeding edge of what's possible, it's pure magic to see unfold. All of that may sound impressive but slick software and a bustling metropolis of people power can't hide the dull gameplay and shallow approach to the sandbox shenanigans of Watch Dogs: Legion. It's still a fascinating game to experience in short bursts, and it's going to be fascinating to see how Ubisoft evolves London to make it vox pop as a next-gen headliner.\n\n-------------\n\n**[Daily Star](https://opencritic.com/outlet/686/daily-star)** - [4 / 5 stars](https://www.dailystar.co.uk/tech/reviews/watch-dogs-legion-review-guns-22916108)\n\n&amp;gt;One that is very English, packed full of wild and interesting characters, each with their own story to tell.\n&amp;gt;\n&amp;gt;It’s a huge step forward in that regard and one that should be celebrated as it shows a way forward for video game development.\n\n-------------\n\n**[Digital Trends](https://opencritic.com/outlet/124/digital-trends)** - [Tom Caswell](https://opencritic.com/critic/2078/tom-caswell) - [2.5 / 5 stars](https://www.digitaltrends.com/game-reviews/watch-dogs-legion-review/)\n\n&amp;gt;While Ubisoft presents its best open world to date, the main gameplay hook falls flat.\n\n-------------\n\n**[Digitally Downloaded](https://opencritic.com/outlet/65/digitally-downloaded)** - Trent P - [4 / 5 stars](https://www.digitallydownloaded.net/2020/10/review-watch-dogs-legion-microsoft-xbox.html)\n\n&amp;gt;What players will find when picking up Watch Dogs: Legion is a game that is prepared for a long post-launch game-as-a-service experience. The additional DLC announced so far leans into the strengths of the game and established ideas that the series does well. The beekeepers, paintball guns and magician tricks all bring a sense of playful humour to the series, but it is worth noting that anyone who is (rightfully) tired of Ubisoft's content approach to games is going to find this one a very content-driven game.\n\n-------------\n\n**[DualShockers](https://opencritic.com/outlet/285/dualshockers)** - [Ben Bayliss](https://opencritic.com/critic/4388/ben-bayliss) - [7.5 / 10](https://www.dualshockers.com/watch-dogs-legion-review/)\n\n&amp;gt;Watch Dogs: Legion offers an incredibly vast recruitment system that wonderfully complements its hacking mechanics while boasting the darkest story in the series.\n\n-------------\n\n**[EGM](https://opencritic.com/outlet/38/egm)** - [Michael Goroff](https://opencritic.com/critic/4103/michael-goroff) - [8 / 10](https://egmnow.com/watch-dogs-legion-review/)\n\n&amp;gt;Watch Dogs: Legion pushes through Ubisoft's generally noncommittal attitude towards storytelling and exploiting current events to create something that feels like a genuine shift, or at least the prototype of that shift. It might be a sloppy game in many regards, but Legion offers a novel way to experience an open world, with its interconnected NPCs and the introduction of permadeath to the genre.\n\n-------------\n\n**[Enternity.gr](https://opencritic.com/outlet/783/enternity-gr)** - [Panagiotis Petropoulos](https://opencritic.com/critic/7436/panagiotis-petropoulos) - *Greek* - [8 / 10](http://www.enternity.gr/Article/Games/Reviews/Watch-Dogs-Legion-Review/62940.html)\n\n&amp;gt;Watch Dogs: Legion is much better in terms of depth and hacking and also comes with a huge living world. It's by far the best game of the series.\n\n-------------\n\n**[Everyeye.it](https://opencritic.com/outlet/425/everyeye-it)** - [Alessandro Bruni](https://opencritic.com/critic/3261/alessandro-bruni) - *Italian* - [7.6 / 10](https://www.everyeye.it/articoli/recensione-watch-dogs-legion-esercito-hacker-pronto-guerra-50686.html)\n\n&amp;gt;Ultimately, while perfectly able to offer players a good number of hours of fun, Watch Dogs Legion fails to fully realize the potential of its basic concept, yielding to the flattery of an open world model that, at the end of the console generation, loudly requires more innovation.\n\n-------------\n\n**[GAMES.CH](https://opencritic.com/outlet/762/games-ch)** - [Benjamin Braun](https://opencritic.com/critic/4867/benjamin-braun) - *German* - [89 / 100](https://www.games.ch/watch-dogs-legion/test/review-jIK/)\n\n&amp;gt;Watch Dogs Legion mostly benefits from its rich game world in futuristic London. It's also fun to build a whole army of DedSec agents, using their special abilities within fight and stealth sequences or utilizing them on solving puzzles. It's not all roses concerning story or performance on current-gen consoles. Nonetheless it's the best part of Ubisoft's open-world hacker series so far.\n\n-------------\n\n**[GRYOnline.pl](https://opencritic.com/outlet/559/gryonline-pl)** - [Michał Grygorcewicz](https://opencritic.com/critic/4438/micha-grygorcewicz) - *Polish* - [7.5 / 10](https://www.gry-online.pl/S020.asp?ID=14228)\n\n&amp;gt;I had really low expectations and Watch Dogs: Legion turned out to be a pleasant surprise. It’s a decent action game with some cool ideas and mechanics that yield several dozens of hours of fun, prvided you like wandering around virtual cities doing the same thing over and over again.\n\n-------------\n\n**[Gadgets 360](https://opencritic.com/outlet/309/gadgets-360)** - [Akhil Arora](https://opencritic.com/critic/1736/akhil-arora) - [8 / 10](https://gadgets.ndtv.com/games/reviews/watch-dogs-legion-review-xbox-one-x-2316944)\n\n&amp;gt;Watch Dogs: Legion lacks a soul. It's also a passive game, since there's no active push-and-pull. Albion took over London, and now you push them out one borough at a time.\n\n-------------\n\n**[Game Informer](https://opencritic.com/outlet/35/game-informer)** - [Marcus Stewart](https://opencritic.com/critic/6102/marcus-stewart) - [9 / 10](https://www.gameinformer.com/review/watch-dogs-legion/watch-dogs-legion-review-a-successful-team-building-exercise)\n\n&amp;gt;Legion offers a refreshing and fun change-up to the Watch Dogs formula that succeeds in letting players forge their own path like never before\n\n-------------\n\n**[Game Revolution](https://opencritic.com/outlet/93/game-revolution)** - [Paul Tamburro](https://opencritic.com/critic/472/paul-tamburro) - [4 / 5 stars](https://www.gamerevolution.com/review/663819-watch-dogs-legion-review-pc-ps4-ps5-xbox-series-x)\n\n&amp;gt;Watch Dogs: Legion‘s beautiful London and its array of recruitable denizens make it one of the most enjoyable games of the year.\n\n-------------\n\n**[GameMAG](https://opencritic.com/outlet/459/gamemag)** - [Александр Логинов](https://opencritic.com/critic/7072/-) - *Russian* - [7 / 10](https://gamemag.ru/reviews/watch-dogs-legion)\n\n&amp;gt;On the one hand Watch Dogs: Legion is a revolutionary game with ambitious open world and thousands upon thousands of characters, probably created by some kind of neural network. The gameplay is fine, and if you love original Watch Dogs, you will feel right at home with this new title. But on the other hand Legion clearly lacks a strong narrative lead.\n\n-------------\n\n**[GameOnAUS](https://opencritic.com/outlet/799/gameonaus)** - [Royce Wilson](https://opencritic.com/critic/5197/royce-wilson) - [Recommended](https://www.gameonaus.com/reviews/watch-dogs-legion-aaa-oooh-watch-dogs-of-london/)\n\n&amp;gt;There are some fantastic ideas in the game which mostly work, but also require an element of metaphorically ignoring the stagehands and the suspension of disbelief may simply be too much for many players.\n\n-------------\n\n**[GamePro](https://opencritic.com/outlet/488/gamepro)** - [Hannes Rossow](https://opencritic.com/critic/3625/hannes-rossow), [Markus Schwerdtel](https://opencritic.com/critic/3631/markus-schwerdtel) - *German* - [79 / 100](https://www.gamepro.de/artikel/watch-dogs-legion-test,3363330.html)\n\n&amp;gt;Watch Dogs: Legion relies on a unique concept that offers many possibilities, but for which many compromises are also made.\n\n-------------\n\n**[GameSkinny](https://opencritic.com/outlet/421/gameskinny)** - [Mark Delaney](https://opencritic.com/critic/1704/mark-delaney) - [8 / 10 stars](http://www.gameskinny.com/s11qg/watch-dogs-legion-review-deconstructing-the-sandbox)\n\n&amp;gt;Watch Dogs: Legion throws out a decade of Ubisoft's cluttered-map open worlds in favor of exciting systems that deliver unique emergent moments consistently.\n\n-------------\n\n**[GameSpot](https://opencritic.com/outlet/32/gamespot)** - [Alessandro Fillari](https://opencritic.com/critic/4067/alessandro-fillari) - [8 / 10](https://www.gamespot.com/reviews/watch-dogs-legion-review/1900-6417594/?ftag=CAD-01-10abi2f)\n\n&amp;gt;Watch Dogs: Legion struggles with tone at times, but its empowering message about unity and justice still shines in a game that is as absurd as it is impactful.\n\n-------------\n\n**[GameZone](https://opencritic.com/outlet/206/gamezone)** - [Cade Onder](https://opencritic.com/critic/2098/cade-onder) - [6 / 10](https://www.gamezone.com/reviews/watch-dogs-legion-2020/)\n\n&amp;gt;While it has its moments, Watch Dogs Legion doesn't have enough to feel like a fun place to escape to. The gameplay is too repetitive and too restrictive to allow for anything tremendously exciting over a long period of time. It's a game that shows all of its tricks within the first few hours and leaves you with nothing but jank for the remainder of your playthrough.\n\n-------------\n\n**[Gameblog](https://opencritic.com/outlet/450/gameblog)** - [Rami Bououd](https://opencritic.com/critic/5002/rami-bououd) - *French* - [7 / 10](http://www.gameblog.fr/tests/3758-watch-dogs-legion-ps4)\n\n&amp;gt;Watch Dogs Legion is a fun title with interesting and clever gameplay.\n\n-------------\n\n**[Gamerheadquarters](https://opencritic.com/outlet/337/gamerheadquarters)** - [Jason Stettner](https://opencritic.com/critic/2141/jason-stettner) - [7.8 / 10](https://gamerheadquarters.com/articles/watch-dogs-legion-review.html)\n\n&amp;gt;Watch Dogs: Legion is great, it features an intricately detailed open world London to explore where you can recruit basically anyone though the story could have been more intriguing and the performance while driving could have been better.\n\n-------------\n\n**[Gamersky](https://opencritic.com/outlet/597/gamersky)** - [不倒翁蜀黍](https://opencritic.com/critic/4897/-) - *Chinese* - [8.5 / 10](https://www.gamersky.com/review/202010/1332452.shtml)\n\n&amp;gt;Watch Dogs: Legion is the most ambitious and innovative one in the franchise. You can play as anyone and finish your job in any way. The open-world of future London is so beautiful and so well-crafted that I always can find something interesting to do.\n\n-------------\n\n**[GamesRadar+](https://opencritic.com/outlet/91/gamesradar-)** - [Alex Avard](https://opencritic.com/critic/2092/alex-avard) - [3.5 / 5 stars](https://www.gamesradar.com/watch-dogs-legion-review/)\n\n&amp;gt;Legion royally shakes up Watch Dogs' open-world template with a Play as Anyone mechanic that just about outweighs any headaches left by its rough edges.\n\n-------------\n\n**[GamingBolt](https://opencritic.com/outlet/297/gamingbolt)** - [Shubhankar Parijat](https://opencritic.com/critic/1198/shubhankar-parijat) - [9 / 10](https://gamingbolt.com/watch-dogs-legion-review-gotta-catch-em-all)\n\n&amp;gt;Watch Dogs: Legion is definitely the best game in the series so far- and dare I say, one of the most engaging and inventive open world games I have played in years.\n\n-------------\n\n**[GideonsGaming](https://opencritic.com/outlet/668/gideonsgaming)** - [Joseph Pugh](https://opencritic.com/critic/5900/joseph-pugh) - [Unscored](https://gideonsgaming.com/2020/10/28/watch-dogs-legion-xbox-review/)\n\n&amp;gt;Overall I'm having enough fun that I want to stop writing and go back to playing it, which is always a good sign. The recruit anyone system is working incredibly well, and it's super addictive. The simulation is impressive, even if I haven't determined how much of that simulation affects the gameplay yet. And the few design flaws haven't been enough to hinder my enjoyment after 16 hours. Here's hoping it remains that way as I continue working on my full review.\n\n-------------\n\n**[Glitched Africa](https://opencritic.com/outlet/687/glitched-africa)** - [Marco Cocomello](https://opencritic.com/critic/2466/marco-cocomello) - [75 / 100](https://www.glitched.africa/watch-dogs-legion-review)\n\n&amp;gt;Watch Dogs Legion is not a bad game I just believe it was too ambitious for its time. The recruiting system could have been something great but instead its shallow and delivered cliche characters with no real purpose. Unfortunately, this does not help the gameplay and story much. There’s a lot of fun to be had here but if you start expecting more from it, you are going to be let down.\n\n-------------\n\n**[God is a Geek](https://opencritic.com/outlet/111/god-is-a-geek)** - [Mick Fraser](https://opencritic.com/critic/572/mick-fraser) - [8.5 / 10](https://www.godisageek.com/reviews/watch-dogs-legion-review/)\n\n&amp;gt;Watch Dogs: Legion suffers from a little jank in the tank, but the recruitment system is fantastic and there's just so much to see and do. The open world is full of detail, and the whole experience is full of heart.\n\n-------------\n\n**[GotGame](https://opencritic.com/outlet/657/gotgame)** - [Dragos Dobre](https://opencritic.com/critic/6631/dragos-dobre) - [8 / 10](https://gotgame.com/2020/10/28/review-watch-dogs-legion/)\n\n&amp;gt;The post-Brexit dystopian London is exactly the right amount of craziness and fun I was expecting from a Watch Dogs game. Even though the original recipe hasn't changed a lot in the past few years, you can see the progress they made with Watch Dogs: Legion, polishing the game with every iteration.\n\n-------------\n\n**[IGN](https://opencritic.com/outlet/56/ign)** - [Dan Stapleton](https://opencritic.com/critic/201/dan-stapleton) - [8 / 10](http://www.ign.com/articles/watch-dogs-legion-review?watch)\n\n&amp;gt;Watch Dogs: Legion's bold use of roguelike mechanics in an open-world action game pay off in interesting ways, making this visit to near-future London feel more varied than the previous two games.\n\n-------------\n\n**[Impulsegamer](https://opencritic.com/outlet/31/impulsegamer)** - [John Werner](https://opencritic.com/critic/6151/john-werner) - [4.8 / 5](https://www.impulsegamer.com/watch-dogs-legion-xbox-one-review/)\n\n&amp;gt;Without a doubt, “Watch Dogs: Legion” ticks all the boxes required to be a true Watch Dogs game, embracing elements from both previous games while brining its own flavour to the table.\n\n-------------\n\n**[Inverse](https://opencritic.com/outlet/763/inverse)** - [Tomas Franzese](https://opencritic.com/critic/2097/tomas-franzese) - [7 / 10](https://www.inverse.com/gaming/watch-dogs-legion-review)\n\n&amp;gt;Watch Dogs: Legion pushes current-gen hardware to the limit, and suffers for it.\n\n-------------\n\n**[Life is Xbox](https://opencritic.com/outlet/398/life-is-xbox)** - [Dae Jim](https://opencritic.com/critic/2581/dae-jim) - [89 / 100](https://www.lifeisxbox.eu/2020/10/28/review-watch-dogs-legion/)\n\n&amp;gt;Watch Dogs Legion ‘play as everyone’ mechanic works brilliantly, this is a genre-defying feature and something that sets the game apart from its competition.\n\n-------------\n\n**[Marooners' Rock](https://opencritic.com/outlet/341/marooners-rock)** - [Andrew Peggs](https://opencritic.com/critic/2189/andrew-peggs) - [8.4 / 10](https://maroonersrock.com/watch-dogs-legion-xbox-one-review/)\n\n&amp;gt;Overall, I feel as if Ubisoft has dug back into what made Watch Dogs enjoyable to play. With some improvements to the overall gameplay and tweaks as time goes by, I can see others enjoying the game.\n\n-------------\n\n**[Metro GameCentral](https://opencritic.com/outlet/75/metro-gamecentral)** - [6 / 10](https://metro.co.uk/2020/10/28/watch-dogs-legion-review-the-london-formula-13491458/)\n\n&amp;gt;A disappointingly tame vision of a near future dystopia, that represents a perfectly competent use of the Ubisoft formula but falters in its attempts to add anything new to it.\n\n-------------\n\n**[MondoXbox](https://opencritic.com/outlet/794/mondoxbox)** - [ Andrea Giuliani](https://opencritic.com/critic/7623/-andrea-giuliani) - *Italian* - [8 / 10](https://www.mondoxbox.com/recensione/3289/watch-dogs-legion.html)\n\n&amp;gt;Watch Dogs Legion keeps the series' base mechanics while enhancing the whole formula thanks to the higher gameplay and tactical variety provided by the huge choice of agents available. This has the downside of making every character pretty forgettable though, keeping us from establishing an emotional bond with any of them.\n\n-------------\n\n**[New Game Network](https://opencritic.com/outlet/405/new-game-network)** - [Alex Varankou](https://opencritic.com/critic/2669/alex-varankou) - [65 / 100](http://www.newgamenetwork.com/article/2369/watch-dogs-legion-review/)\n\n&amp;gt;Being able to Play As Anyone in Watch Dogs: Legion is impressive at first, but it becomes a detriment to the core experience that's in need of revitalization. The hacking and stealth infiltrations haven't changed a bit, and with repetitive mission design and numerous technical issues, this latest chapter finds DedSec in an identity crisis.\n\n-------------\n\n**[Nexus Hub](https://opencritic.com/outlet/528/nexus-hub)** - Sahil Lala - [8 / 10](https://nexushub.co.za/nexus/review-watch-dogs-legion.html)\n\n&amp;gt;Watch Dogs: Legion is more of the same Watch Dogs formula fans of the franchise have come to expect. There are additional gimmicks and features that round off the product and it’s a great game to spend time in. The mystery plot and the intrigue around finding out just who exactly Zero Day is and putting a stop to him is great and will easily keep you entertained for 50 hours or more as you explore London.\n\n-------------\n\n**[PC Gamer](https://opencritic.com/outlet/162/pc-gamer)** - [Christopher Livingston](https://opencritic.com/critic/710/christopher-livingston) - [80 / 100](https://www.pcgamer.com/watch-dogs-legion-review/)\n\n&amp;gt;Playing as anyone works great in Legion—once you've finally found the right group of anyones.\n\n-------------\n\n**[PC Invasion](https://opencritic.com/outlet/176/pc-invasion)** - [Tim McDonald](https://opencritic.com/critic/1358/tim-mcdonald) - [7.5 / 10](https://www.pcinvasion.com/watch-dogs-legion-pc-review/)\n\n&amp;gt;The connected, living world here is a genuine revelation, and it's well worth exploring if you're willing to mess around and make your own fun. It's just a shame that some of the vibrancy and depth of Watch Dogs 2 has been lost in the process.\n\n-------------\n\n**[PCGamesN](https://opencritic.com/outlet/169/pcgamesn)** - [Dustin Bailey](https://opencritic.com/critic/1612/dustin-bailey) - [7 / 10](https://www.pcgamesn.com/watch-dogs-legion/review)\n\n&amp;gt;Richly realised systems and empowering abilities create a tremendously fun sandbox to dig into, but another toothless story ensures these flashes of brilliance never cohere, leaving Legion feeling less than the sum of its parts.\n\n-------------\n\n**[Pixel Arts](https://opencritic.com/outlet/740/pixel-arts)** - Arman Akbari - *Persian* - [7.5 / 10](https://www.pixelarts.ir/review/watch-dogs-legion-review)\n\n&amp;gt;Watch Dogs: Legion is a game that has been able to maintain diversity and difference among thousands of playable characters. However, along with the dynamic and detailed world, the game suffers from weakness in the design of the stages and unfortunately becomes repetitive and boring over time.\n\n-------------\n\n**[PlayStation Universe](https://opencritic.com/outlet/39/playstation-universe)** - [Neil Bolt](https://opencritic.com/critic/838/neil-bolt) - [6 / 10](https://www.psu.com/reviews/watch-dogs-legion-ps4-review/)\n\n&amp;gt;While Watch Dogs: Legion does the basics well and has a refreshing change of scenery, it moves backwards from Watch Dogs 2 in terms of characters and storytelling. It's still quite enjoyable to get up to tech-based naughtiness in London despite that, but the underlying open-world template Ubisoft keeps using ends up feeling overexposed here.\n\n-------------\n\n**[Polygon](https://opencritic.com/outlet/87/polygon)** - [Owen Good](https://opencritic.com/critic/983/owen-good) - [Unscored](https://www.polygon.com/reviews/2020/10/28/21537488/watch-dogs-legion-review-best-characters-skills-play-as-anyone-ps4-ps5-xbox-one-series-x-pc)\n\n&amp;gt;Watch Dogs: Legion’s cast of randos makes a surprisingly winning team\n\n-------------\n\n**[PowerUp!](https://opencritic.com/outlet/577/powerup-)** - Paul Verhoeven - [6.3 / 10](https://powerup-gaming.com/2020/10/28/watch-dogs-legion-review-pc-for-we-are-many/)\n\n&amp;gt;And that’s the real issue here: the previous game was a story and a damned good one. Watch Dogs Legion is a playground and a damned good one. All it took was a shift in priorities to make the open-world feel less like a world, and more like… well, a game.\n\n-------------\n\n**[Press Start](https://opencritic.com/outlet/491/press-start)** - [James Mitchell](https://opencritic.com/critic/3659/james-mitchell) - [8 / 10](https://press-start.com.au/reviews/playstation4-reviews/2020/10/28/watch-dogs-legion-review-london-brawling-to-the-faraway-towns/)\n\n&amp;gt;Watch Dogs Legion builds upon the solid foundation established by Watch Dogs 2 while adding its own ambitious twist with mixed results. Having literally every character playable is a gargantuan task, and from a gameplay perspective it works to cement Legion as the best Watch Dogs game thus far. Narratively speaking, however, it collapses under its own aspiration to offer an intriguing concept with spotty execution. Regardless, Legion is a triumph for making good on most of its lofty promise and a triumph for the series.\n\n-------------\n\n**[Rock, Paper, Shotgun](https://opencritic.com/outlet/270/rock-paper-shotgun)** - [Nate Crowley](https://opencritic.com/critic/5785/nate-crowley) - [Unscored](https://www.rockpapershotgun.com/2020/10/28/watch-dogs-legion-review/)\n\n&amp;gt;While I may not identify with any of my guerrillas and their grab-bag backstories, nor feel any sense of real investment in the fate of DedSec as a whole, I’m still attached to this strange band of possessed berserkers. We’ve had a good time together, in this nonsense dystopian playground.\n\n-------------\n\n**[Rocket Chainsaw](https://opencritic.com/outlet/348/rocket-chainsaw)** - [David Latham](https://opencritic.com/critic/2648/david-latham) - [4 / 5 stars](https://www.rocketchainsaw.com.au/xbox-one/watch-dogs-legion-xbox-one-x-review/)\n\n&amp;gt;Watch Dogs: Legion brings new ideas to the franchise while keeping within the world of Blume Corp’s ctOS.\n\n-------------\n\n**[Screen Rant](https://opencritic.com/outlet/664/screen-rant)** - [Leo Faierman](https://opencritic.com/critic/5830/leo-faierman) - [3 / 5 stars](https://screenrant.com/watch-dogs-legion-game-review/)\n\n&amp;gt;The takeaway is this: Watch Dogs: Legion is an ambitious simulation which reliably fails whenever players push against its boundaries. Like the cargo drones which grant them the ability to freely fly, it hits an invisible ceiling that prevents players from soaring above London’s skyscrapers.\n\n-------------\n\n**[Shacknews](https://opencritic.com/outlet/62/shacknews)** - [Donovan Erskine](https://opencritic.com/critic/4485/donovan-erskine) - [8 / 10](https://www.shacknews.com/article/121143/watch-dogs-legion-review-hack-teh-world)\n\n&amp;gt;Watch Dogs: Legion is a hacking good time and a great addition to Ubisoft’s technology-based saga.\n\n-------------\n\n**[Sirus Gaming](https://opencritic.com/outlet/409/sirus-gaming)** - [Lexuzze Tablante](https://opencritic.com/critic/1871/lexuzze-tablante) - [7 / 10](https://sirusgaming.com/2020/10/28/watch-dogs-legion-review/)\n\n&amp;gt;Watch Dogs Legion tries so hard to innovate the franchise, but in doing so, it feels like a product that was either rushed or there was no love for it. Ubisoft Toronto did their best to give us a whole new Watch Dogs experience, but when the second installment of the franchise is the benchmark, it’s hard for me not to nitpick on these issues I find in the game. I love the franchise, but this isn’t the kind of innovation I’ve expected Watch Dogs to have.\n\n-------------\n\n**[Skill Up](https://opencritic.com/outlet/639/skill-up)** - [Ralph Panebianco](https://opencritic.com/critic/5428/ralph-panebianco) - [Unscored](https://www.youtube.com/watch?v=6e89QS2Ooyg)\n\n&amp;gt;Watch Dogs: Legion is an ambitious title. Perhaps a little too ambitious. As much as certain parts of the game shine, you can't help but feel that the game is too clever by half.\n\n-------------\n\n**[Slant Magazine](https://opencritic.com/outlet/318/slant-magazine)** - [Steven Scaife](https://opencritic.com/critic/4843/steven-scaife) - [2.5 / 5 stars](https://www.slantmagazine.com/games/review-in-watch-dogs-legion-revolution-is-the-stuff-of-brand-aspirations/)\n\n&amp;gt;It's difficult to escape a sense that the game's ambition far outstrips the number of unique people it can plausibly render.\n\n-------------\n\n**[Star News](https://opencritic.com/outlet/386/star-news)** - [Rod Oracheski](https://opencritic.com/critic/2397/rod-oracheski) - [4 / 5 stars](http://starnews.ca/article/10768/review-watch-dogs-legion/)\n\n&amp;gt;Watch Dogs: Legion sticks you in the shoes of characters you’d never have chosen otherwise, and it works more often than it doesn’t.\n\n-------------\n\n**[Stevivor](https://opencritic.com/outlet/424/stevivor)** - [Luke Lawrie](https://opencritic.com/critic/3164/luke-lawrie) - [6 / 10](https://stevivor.com/reviews/watch-dogs-legion-review/)\n\n&amp;gt;There’s some fun to be had in Watch Dogs Legion, but it becomes so repetitive that by the end of the game everything feels like a chore — one I was desperately wanting to be over hours before its credits rolled.\n\n-------------\n\n**[The Digital Fix](https://opencritic.com/outlet/17/the-digital-fix)** - [Andrew Shaw](https://opencritic.com/critic/6893/andrew-shaw) - [8 / 10](https://www.thedigitalfix.com/gaming/review/watch-dogs-legion/)\n\n&amp;gt;The best Watch Dogs game yet. While it's dragged down by long load times and some repetition, Legion is a hugely enjoyable game that offers players a level of freedom that is rarely seen in this genre.\n\n-------------\n\n**[The Game Fanatics](https://opencritic.com/outlet/422/the-game-fanatics)** - [Trevor Paul](https://opencritic.com/critic/5192/trevor-paul) - [8.5 / 10](https://thegamefanatics.com/watch-dogs-legion-review-the-spy-who-hacked-me/)\n\n&amp;gt;Overall, Watch Dogs Legion is a ton of fun. There is so much to do and experience in this game and so many different ways to do it. The hacking puzzles are familiar but still fun and sometimes challenging. The real star of this game is the variety of characters you can recruit and the backstories that come with them.\n\n-------------\n\n**[The Games Machine](https://opencritic.com/outlet/497/the-games-machine)** - [Simone Rampazzi](https://opencritic.com/critic/5475/simone-rampazzi) - *Italian* - [8 / 10](https://www.thegamesmachine.it/watch-dogs-legion-pc-ps4-xbox-one/watch-dogs-legion-recensione/)\n\n&amp;gt;Watch Dogs: Legion starts with some really intriguing background ideas, ideas that try to dig deep and to leave us with many more questions about the near future. The overwhelming control of a state willing to know everything about its citizens, however, does not prevent a few uncertainties about the gameplay, a sore note that prevents the game from shining as hoped. However, it remains an enjoyable offer, ready to satisfy the taste of lovers of the genre.\n\n-------------\n\n**[TheSixthAxis](https://opencritic.com/outlet/68/thesixthaxis)** - [Miguel Moran](https://opencritic.com/critic/321/miguel-moran) - [8 / 10](https://www.thesixthaxis.com/2020/10/28/watch-dogs-legion-review/)\n\n&amp;gt;Watch Dogs Legion is a different type of sequel to Watch Dogs 2, contrasting in its approach to creating a hackable open world playground, but with no less impressive results. Playing as any citizen in London leads to some less-than-engaging story moments, but the web of relationships and activities that crop up as a result of the systemic design is mind-blowing. I rarely did the same thing twice in Watch Dogs Legion, and if I did, I wasn't doing it the same way twice. Watch Dogs Legion truly feels like a living, breathing world, and it's a world that I plan to revisit often, even though I've seen the credits on the main story roll.\n\n-------------\n\n**[ThisGenGaming](https://opencritic.com/outlet/407/thisgengaming)** - [Robby Bisschop](https://opencritic.com/critic/4075/robby-bisschop) - [90 / 100](https://thisgengaming.com/2020/10/28/watch-dogs-legion-the-most-in-depth-review/)\n\n&amp;gt;Watch Dogs: Legion is a massive game with perhaps the biggest recruitable main cast of characters we’ve ever seen. With its varied gameplay and its tried-and-true Ubisoft open-world experience, it offers dozens of hours of entertainment and isn’t to be missed.\n\n-------------\n\n**[TrueGaming](https://opencritic.com/outlet/449/truegaming)** - [محمد جابر الصهيبي](https://opencritic.com/critic/3264/-) - *Arabic* - [8.5 / 10](https://www.true-gaming.net/home/438667/)\n\n&amp;gt;Watch dogs legion gives you freedom and it's accentuated in the new recruiting system which makes this title worth playing even before the release of next gen version.\n\n-------------\n\n**[USgamer](https://opencritic.com/outlet/66/usgamer)** - [Mike Williams](https://opencritic.com/critic/299/mike-williams) - [3.5 / 5 stars](https://www.usgamer.net/articles/watch-dogs-legion-review)\n\n&amp;gt;The new \"Play As Anyone\" system is as impressive as it sounds on paper, creating a host of intriguing characters if you choose to dive into their backgrounds. Crafting your own version of DedSec is a ton of fun, especially early on. The problem is the gameplay of Watch Dogs Legion is mostly the same as its predecessors and the missions are quite repetitive overall. It's not a step back for the series, but the hacking and stealth core of the series does need an overhaul.\n\n-------------\n\n**[VG247](https://opencritic.com/outlet/549/vg247)** - [Lauren Aitken](https://opencritic.com/critic/6445/lauren-aitken) - [3 / 5 stars](https://www.vg247.com/2020/10/28/watch-dogs-legion-review/)\n\n&amp;gt;Watch Dogs fans and more die-hard anarchists among you might enjoy it more, but between the short storylines, underwhelming tech and mission types and the general “everything is on fire” vibe, it just doesn’t rate highly for me.\n\n-------------\n\n**[VICE]** - [Austin Walker](https://www.vice.com/en/contributor/austin-walker) - [UNSCORED](https://www.vice.com/en/article/pkdy5y/watch-dogs-legion-review)\n\n&amp;gt;'Watch Dogs: Legion' Promises Revolution, But Mostly Delivers Distraction\nYou can play as anyone you want, but the game remains the same.\n\n-------------\n\n**[Video Game Sophistry](https://opencritic.com/outlet/480/video-game-sophistry)** - [Andy Borkowski](https://opencritic.com/critic/3521/andy-borkowski) - [6 / 10](https://www.youtube.com/watch?v=9q7ayvoqncM&amp;amp;feature=youtu.be)\n\n&amp;gt;The ‘Play as Anyone’ feature is the game's biggest fault.  There’s no way to really work as a team. Instead each individual is one part of a fully fleshed out protagonist that has now been cut into 20 different pieces and called upon to work without the other. A severed hand doesn’t make a hero.\n\n-------------\n\n**[VideoGamer](https://opencritic.com/outlet/71/videogamer)** - [Josh Wise](https://opencritic.com/critic/7768/josh-wise) - [5 / 10](http://www.videogamer.com//reviews/watch-dogs-legion-review)\n\n&amp;gt;Where the action comes alive is in the leaving behind of bodies altogether. Most missions involve breaking and entering, and the thrill lies in the absence of any breaking.\n\n-------------\n\n**[Wccftech](https://opencritic.com/outlet/304/wccftech)** - [Rosh Kelly](https://opencritic.com/critic/1301/rosh-kelly) - [7.9 / 10](https://wccftech.com/review/watch-dogs-legion-bold-gameplay-mild-story/)\n\n&amp;gt;Watch Dogs Legion is a great step forward for the series, with enough experimental new gameplay features to complement the familiar mechanics. London is incredible, and exploring it is an almost visceral experience. It's just a shame that the story doesn't hold the same familiarity that the map does.\n\n-------------\n\n**[We Got This Covered](https://opencritic.com/outlet/19/we-got-this-covered)** - [Todd Rigney](https://opencritic.com/critic/4572/todd-rigney) - [3 / 5 stars](https://wegotthiscovered.com/gaming/watch-dogs-legion-review/)\n\n&amp;gt;Although the recruitment system provides a few hours of entertainment, Watch Dogs: Legion feels like a series of systems masquerading as an open-world adventure game. Compared to the first two entries, Legion is a massive step backward, both in terms of story and execution. This is paint-by-numbers Ubisoft on autopilot.\n\n-------------\n\n**[WellPlayed](https://opencritic.com/outlet/382/wellplayed)** - [Zach Jackson](https://opencritic.com/critic/2452/zach-jackson) - [8 / 10](https://www.well-played.com.au/watch-dogs-legion-review/)\n\n&amp;gt;With a surprisingly good narrative that excels thanks to the unique ability to turn anyone into a DedSec hacker, Watch Dogs: Legion is a damn good time\n\n-------------\n\n**[Windows Central](https://opencritic.com/outlet/515/windows-central)** - [Carli Velocci](https://opencritic.com/critic/1327/carli-velocci) - [4.5 / 5 stars](https://www.windowscentral.com/watch-dogs-legion-review)\n\n&amp;gt;Watch Dogs: Legion is a departure from the typical Ubisoft brand, and it's better for it. The play as anybody system just works, there's a lot to do, and it's unabashedly political in a way that feels important in 2020.\n\n-------------",
    "Reddit: Got a Lenovo Legion Pro 5 OLED laptop!\nSpecs: RTX 5060 GPU, Ryzen 7 8745HX CPU, 32GB RAM, 1TB SSD, and 16” 2560x1600 165Hz 500 nits OLED screen\n\nBought from Best Buy for $1300 pre-tax with Black Friday deal. It has a nice metal build quality, fans aren’t super loud, and the screen is fucking gorgeous. The speakers could be better but I usually play with a headset so whatevs. \n\nDespite the 8GB VRAM, the 115W GPU is good enough for my needs as I’ve been a console gamer most of my life. I get 60-100 FPS on medium/high settings in demanding games like Cyberpunk 2077, Stalker 2, Oblivion Remastered, Baldur’s Gate 3, and Ready or Not. It feels like my PS5 Pro in PC form.\n\nAfterburner says the GPU temp hovers around 65° and CPU at 75-85° under load in Ready or Not. That’s with the laptop slightly elevated. The CPU spikes to 101° while compiling shaders in Stalker 2. Not sure if that’s normal but I just hit FN+Q to go in silent mode and get it down to 80° but it’s otherwise normal in game on auto/balanced mode. Performance mode got me a whopping four extra frames with loud ass fans so auto mode it is lol. Not bothering to OC the GPU either.\n\nHopefully this bad boy can last 4-5 years. I know Lenovo is known for their decent laptops, yet I came from an MSI Vector 16 that had audio stutters due to latency spikes. Fucking around with drivers, audio settings, and BIOS lead nowhere. Only solution I found was disabling the Intel CPU e-cores with Process Lasso but it borked my audio in BG3 and I read it has compatibility issues with anti-cheat games, so I just had enough. I didn’t wanna deal with the headache anymore after six months and it left a bad taste in my mouth. I sold it on Marketplace for half of what I bought it for and the buyer seemed to like it despite me making the audio issue known. \n\nThe Legion is an upgrade in pretty much every way except graphics and refresh rate; the MSI had a 5070 Ti and 240Hz refresh rate. I can see Jarrod shaking his head right now lol. I’m aware of the $1300 MSI with 5070 Ti at Walmart but it doesn’t have OLED and it has iffy ratings/reviews. I didn’t wanna take another chance on MSI again. I don’t mind that much because I was always chasing frames instead of enjoying games. I even contemplated not buying another laptop and just sticking with my PS5 Pro and ROG Xbox Ally X, but I knew I’d miss playing shooters and BG3 with KB/M. I was tearing my hair out trying to find a laptop with desired specs/decent price the last few days and I kept coming back to this specific Legion Pro 5. All in all, I’m pretty happy with the laptop so far! \n\nAnd my cat’s name is Sally.  She’s a lovable, affectionate, and playful little furball! ❤️",
    "Reddit: So my 5+ year old Lenovo Legion died yesterday ..\nAnd I replaced it with another legion... The old one way with GTX 1650 and suffered from a motherboard and gpu fault. The estimated repair cost was so high that it cost almost half of what laptop cost me when I bought it. I wanted to use it for another 2-3 years before upgrading, but unfortunately it wasn't meant to be. Not sure if it was a good thing or bad thing that it worked flawlessly until the day before the failure. There was no symptom of a possible failure. It was so sudden.\n Anyway I decided it as an early opportunity to upgrade. There was no confusion regarding the replacement option, I wanted another Legion. The looks of a legion is way superior to those flashy looks of any other gaming laptop. On my budget I had only 2 options at the local store - As this is a work laptop too, I didn't have time for more look around online or offline. I chose the Legion 5 with  rtx 4060 13th gen i7 and 512 gb SSD and added another 2tb SSD..  It looks just as good, may be better... Performance is amazing...  Will purchase extended warranty for additional 3 yrs after the next payday...",
    "Reddit: Sharing my premium care service experience - Lenovo Legion pro 7i 2023\nHey guys,\n\nI’ve been using **Lenovo Legion laptops for the past 4 years**. Here’s my lineup so far:\n\n* **Legion 5 (2021)** — R5 5600H + RTX 3060\n* **Legion 5 Pro (2021)** — R7 5800H + RTX 3070\n* **Legion Pro 7i (2023)** — i9-13900HX + RTX 4080\n\nAll of them had **Premium Care**. All of them eventually needed **heatsink replacements**.\n\nThis post is mainly about the **Legion Pro 7i (2023)**.\n\n# Purchase &amp;amp; First Issues\n\n* Bought in **June 2023 (France)** directly from Lenovo\n* Everything was fine until **February 2025**\n* Then the classic **Lenovo CPU overheating issue** appeared\n\nI repasted the CPU **multiple times with liquid metal** — no real improvement (honestly… f\\*\\*\\* liquid metal).\n\nI finally requested an **onsite repair** → **Heatsink replaced in Feb 2025** → Worked fine… for a while\n\n# Overheating Again\n\nBy **November 2025**, overheating came back.\n\n* Called support\n* Another heatsink replacement scheduled\n* Repair happened **December 5th, 2025** (waited almost a month because the part was out of stock)\n\n# Repair Disaster\n\nShort version: **The technician had no idea how to apply liquid metal.**\n\nWhat he did:\n\n* Dumped the entire **1g LM tube** onto the CPU die\n* Tried to screw the heatsink on like LM magically spreads itself (as if it were PTM…)\n\nResult:\n\n* Laptop booted **instantly at 90°C**\n* Worse than before the repair\n\n# Support Hell Begins\n\nI called support again and asked for a manager.\n\n* Manager called me on **Monday, Dec 8th**\n* Scheduled a **motherboard + heatsink replacement** on **Friday, Dec 12th**\n\nTech came, replaced everything. → **Issue still there** (LM bois....)\n\nI called support *again* asking for a **real solution**, not endless repairs.\n\nThey asked me to:\n\n* Send photos of overheating\n* Send invoice by email\n\nI did **everything that same Friday afternoon**.\n\nThen… silence.\n\n# Premium Care Circus\n\n**Monday → Tuesday → Wednesday** No response.\n\nI called Premium Care again:\n\n* First agent thought I **didn’t even have Premium Care**\n* Escalated my issue… *to Premium Care* (yes, really)\n\nThen I used chat support:\n\n* Agent kept pushing me to send the laptop to the depot (no thanks — I know how badly devices get treated in their depots )\n* Second option: **another motherboard replacement**\n\nAt this point I was DONE. After replacing the motherboard, **what’s even left to replace?**\n\nThey kept trying to “troubleshoot” an issue they already knew about.\n\nI’ve called them so much in less than a month they probably recognize my voice by now lol\n\n# “3 Major Failed Repairs” Rule\n\nAnother agent told me:\n\n* The motherboard I received was **refurbished**\n* No other option except **another repair**\n* To be eligible for escalation, I need **3 major failed repairs**\n\nI asked:\n\n&amp;gt;“What counts as a major repair?”\n\nAnswer:\n\n&amp;gt;“The motherboard.”\n\nBro. I was DONE.\n\nI demanded to speak to a manager. Agent tried to scare me saying escalation could take **months**.\n\nI insisted.\n\n# EMEA Customer Care (Finally)\n\nManager called me **within 5 minutes**.\n\nHe still tried to push another repair. I refused and demanded escalation to **EMEA Customer Care**.\n\nSame **Wednesday, Dec 17th, 2025** → **4 hours later**, I received an email from EMEA Customer Care.\n\n(For those who want it — *use with caution*): [**emeacustcare@lenovo.com**](mailto:emeacustcare@lenovo.com) Keep in mind the **3 failed repair rule**\n\n# The Resolution\n\n**Thursday, Dec 18th, 2025** (Yes — just ONE day later…)\n\nEMEA Customer Care called me:\n\n* Approved a **device replacement**\n* New laptop shipped first\n* I migrate my data\n* Send the old one back within 5 days\n\nInitial offer:\n\n* **Legion Pro 7i Gen 10 (2025)** U9-275HX + RTX 5070 Ti\n\nDecent… but not great coming from a 4080.\n\nI asked if they could request:\n\n* **Legion Pro 7 (2025)** **Ryzen 9 9955HX3D + RTX 5080**\n\nThey acknowledged.\n\n **3 hours later** — I got the call: → **APPROVED.**\n\nNew PC Shipped on 24/12/2025 Received on 29/12/2025\n\nUpgrade from:\n\n* **i9-13900HX + RTX 4080** to:\n* **9955HX3D + RTX 5080** at no cost !\n\n# Final Advice\n\nIf you have **Lenovo Legion + Premium Care issues**:\n\n* Keep pushing repairs\n* After the **3rd failed repair**, **FORCE escalation to EMEA Customer Care**\n* This is the **only team that actually cares**\n\nThey even added **+3 months Premium Care warranty** as an apology.\n\nAt last… some sunlight in this ocean of darkness"
  ],
  "count": 25
}